import { Quest1 } from "./quest/quest1";
import { Quest2 } from "./quest/quest2";
import { Arrow } from "./quest/Arrow";
import { Emphas } from "./quest/Emphas";
import { Dropword } from "./quest/Dropword";
import img1 from "./file/obh.png";
import { ImagePic } from "./quest/ImagePic";
import { ColorPic } from "./quest/ColorPic";
import img2_1_1 from "./file/2_1/1.png";
import img2_1_2 from "./file/2_1/2.png";
import img2_1_3 from "./file/2_1/3.png";
import img2_1_4 from "./file/2_1/4.png";
import rebus1 from "./file/2_1/rebus1.png";
import { Rebus } from "./quest/Rebus";
import { Imgdrop } from "./quest/Imgdrop";
import { Select } from "./quest/Select";
import docter21 from "./file/2_1/docter.png";
import frends21 from "./file/2_1/frends.png";
import background2 from "./file/2_1/background2.png";
import background1 from "./file/1_1/bg1.png";
import { Dropword22 } from "./quest/DropWord22";
import select2 from "./file/2_2/2.png";
import i1 from "./file/2_2/i1.png";
import i2 from "./file/2_2/i2.png";
import i3 from "./file/2_2/i3.png";
import i4 from "./file/2_2/i4.png";
import i5 from "./file/2_2/i5.png";
import i6 from "./file/2_2/i6.png";
import i7 from "./file/2_2/i7.png";
import select3 from "./file/2_2/3.png";
import select4 from "./file/2_2/4.png";
import select5 from "./file/2_2/5.jpg";
import { SelectedWord } from "./quest/SelectedWord";
import { ColorWord } from "./quest/ColorWord";
import { Subsequence } from "./quest/Subsequence";
import select_1_1_1 from "./file/1_1/1.png";
import select_1_1_2 from "./file/1_1/9.png";
import select_1_1_13 from "./file/1_1/13.png";
import select_1_1_14 from "./file/1_1/14.png";
import sub_1_1_1 from "./file/1_1/11.png";
import mouse from "./file/mouse.png";
import sub_1_1_8 from "./file/1_1/1_1_12.png";
import { PickTrue } from "./quest/PickTrue";
import img_1 from "./file/2_1/imgd1.png";
import img2 from "./file/2_1/imgd2.png";
import img3 from "./file/2_1/imgd3.png";
import imgdrop1_2_1 from "./file/1_2/1.png";
import imgdrop1_2_2 from "./file/1_2/2.png";
import imgdrop1_2_3 from "./file/1_2/3.png";
import s1_2_4 from "./file/1_2/4.jpg";
import ip1_2_5 from "./file/1_2/5.jpg";
import ip1_2_6 from "./file/1_2/6.jpg";
import ip1_2_7 from "./file/1_2/7.jpg";
import ip1_2_8 from "./file/1_2/8.jpg";
import ip1_2_10 from "./file/1_2/10.png";
import ip1_2_11 from "./file/1_2/11.png";
import ip1_2_12 from "./file/1_2/12.png";
import ip1_2_13 from "./file/1_2/13.png";
import ip1_3_2_1 from "./file/1_3/2_1.png";
import ip1_3_2_2 from "./file/1_3/2_2.png";
import ip1_3_2_3 from "./file/1_3/2_3.png";
import ip1_3_3_1 from "./file/1_3/3_1.png";
import ip1_3_3_2 from "./file/1_3/3_2.png";
import ip1_3_3_3 from "./file/1_3/3_3.png";
import ip1_3_3_4 from "./file/1_3/3_4.png";
import ip1_3_4_1 from "./file/1_3/4_1.png";
import ip1_3_4_2 from "./file/1_3/4_2.png";
import ip1_3_4_3 from "./file/1_3/4_3.png";
import ip1_3_4_4 from "./file/1_3/4_4.png";
import ip1_3_4_5 from "./file/1_3/4_5.png";
import ip1_3_4_6 from "./file/1_3/4_6.png";
import ip1_3_5_1 from "./file/1_3/5_1.png";
import ip1_3_7_4 from "./file/1_3/7_4.png";
import ip1_3_8_1 from "./file/1_3/8_1.png";
import ip1_3_8_2 from "./file/1_3/8_2.png";
import ip1_3_8_4 from "./file/1_3/8_4.png";
import ip1_3_8_5 from "./file/1_3/8_5.png";
import ip1_3_9_1 from "./file/1_3/9_1.png";
import ip1_3_9_2 from "./file/1_3/9_2.png";
import ip1_3_9_3 from "./file/1_3/9_3.png";
import ip1_3_10_1 from "./file/1_3/10_1.png";
import i1_4_1 from "./file/1_4/1.png";
import i1_4_2 from "./file/1_4/2.png";
import i1_4_3 from "./file/1_4/3.png";
import i1_4_4 from "./file/1_4/4.png";
import i1_4_6 from "./file/1_4/6.png";
import i1_4_7 from "./file/1_4/7.png";
import i1_4_8 from "./file/1_4/8.png";
import i1_4_9 from "./file/1_4/9.png";
import i1_4_10 from "./file/1_4/10.png";
import i1_4_11 from "./file/1_4/11.png";
import i1_4_12 from "./file/1_4/12.png";
import i1_4_13 from "./file/1_4/13.png";
import i1_4_14 from "./file/1_4/14.jpg";
import i1_4_15 from "./file/1_4/15.jpg";
import i1_4_16 from "./file/1_4/16.png";
import i1_4_20 from "./file/1_4/20.png";
import i1_4_23 from "./file/1_4/23.png";
import i1_7_1 from "./file/1_7/1.png";
import i1_7_2 from "./file/1_7/2.png";
import i1_7_3 from "./file/1_7/3.png";
import i1_7_4 from "./file/1_7/4.png";
import i1_7_5 from "./file/1_7/5.png";
import i1_7_6 from "./file/1_7/6.png";
import i1_7_7 from "./file/1_7/7.png";
import i1_7_8 from "./file/1_7/8.png";
import i1_7_9 from "./file/1_7/9.png";
import i1_7_15 from "./file/1_7/15.jpg";
import i1_7_17 from "./file/1_7/17.png";
import i1_5_1 from "./file/1_5/1.png";
import i1_5_2 from "./file/1_5/2.png";
import i1_5_3 from "./file/1_5/3.png";
import i1_5_4 from "./file/1_5/4.png";
import i1_5_5 from "./file/1_5/5.png";
import i1_5_6 from "./file/1_5/6.png";
import i1_5_7 from "./file/1_5/7.png";
import i1_5_8 from "./file/1_5/8.png";
import i1_5_9 from "./file/1_5/9.png";
import i1_5_10 from "./file/1_5/10.png";
import i1_5_11 from "./file/1_5/11.png";
import i1_5_12 from "./file/1_5/12.png";
import i1_6_1 from "./file/1_6/01.png";
import i1_6_2 from "./file/1_6/02.png";
import i1_6_3 from "./file/1_6/03.jpg";
import i1_6_4 from "./file/1_6/04.png";
import i1_6_5 from "./file/1_6/05.png";
import i1_6_6 from "./file/1_6/06.jpg";
import i1_6_7 from "./file/1_6/07.jpg";
import i1_6_8 from "./file/1_6/08.jpg";
import i1_6_9 from "./file/1_6/09.jpg";
import i1_6_10 from "./file/1_6/10.jpg";
import i1_6_14 from "./file/1_6/14.png";
import i1_6_15 from "./file/1_6/15.png";
import i1_6_16 from "./file/1_6/16.jpg";
import i1_6_17 from "./file/1_6/17.png";
import i1_6_18 from "./file/1_6/18.png";
import i1_8_1 from "./file/1_8/1.png";
import i1_8_2 from "./file/1_8/2.png";
import i1_8_3 from "./file/1_8/3.png";
import i1_8_4 from "./file/1_8/4.png";
import i1_8_5 from "./file/1_8/5.jpg";
import i1_8_6 from "./file/1_8/6.png";
import i1_8_7 from "./file/1_8/7.png";
import i1_9_1 from "./file/1_9/01.jpg";
import i1_9_2 from "./file/1_9/02.png";
import i1_9_3 from "./file/1_9/03.png";
import i1_9_4 from "./file/1_9/04.png";
import i1_9_5 from "./file/1_9/05.png";
import i1_10_1 from "./file/1_10/01.jpg";
import i1_10_2 from "./file/1_10/02.jpg";
import i1_10_3 from "./file/1_10/03.jpg";
import i1_10_4 from "./file/1_10/04.jpg";
import i1_10_5 from "./file/1_10/05.png";
import i1_10_6 from "./file/1_10/06.png";
import i1_10_7 from "./file/1_10/07.png";
import i1_10_8 from "./file/1_10/08.png";
import i1_10_9 from "./file/1_10/09.png";
import i1_11_1 from "./file/1_11/1.png";
import i1_11_2 from "./file/1_11/2.png";
import i1_11_3 from "./file/1_11/3.png";
import i1_11_4 from "./file/1_11/4.png";
import i1_11_5 from "./file/1_11/5.png";
import i1_11_6 from "./file/1_11/6.png";
import i1_11_7 from "./file/1_11/7.png";
import i1_11_8 from "./file/1_11/8.png";
import i1_11_9 from "./file/1_11/9.png";
import i1_11_10 from "./file/1_11/10.png";
import i1_11_14 from "./file/1_11/14.png";
import i1_11_15 from "./file/1_11/15.png";
import i1_11_16 from "./file/1_11/16.png";
import i1_11_17 from "./file/1_11/17.jpg";
import i1_11_18 from "./file/1_11/18.jpg";
import i1_11_19 from "./file/1_11/19.jpg";
import i1_11_20 from "./file/1_11/20.png";






const Zog_book = {
  titleimg: img1,
  id: "1",
  title: "ОБЖ и культура поведения",
  class: null,
  theme: [
    {
      title: "Первый раздел: Безопасность",
      bg: background1,
      class: [
        {
          title: "Тема №1. Ты пешеход",
          quests: [
            <Select
              quiz={
                "Кто такой пешеход? Выбери правильный ответ."
              }
              img={select_1_1_1}
              ans={[
                { q: "Это тот человек, который находится в транспортном средстве, но не является водителем.", cl: "text-dark" },
                { q: "Это тот человек, который управляет транспортным средством.", cl: "text-dark" },
                { q: "Это человек, который передвигается по дороге пешком.", cl: "text-dark" }
              ]}
              trueans={[false, false, true]}
              addCl={"fw-bold text-success"}
            />,
            <Rebus
              quiz="Как называется часть дороги, предназначенная для движения пешеходов?"
              trueans={"ТРОТУАР"}
            />,
            <Select
              quiz={
                "Зачеркни те утверждения, которые неверны."
              }
              img={select_1_1_2}
              ans={[
                { q: "Пешеходы должны передвигаться по тротуарам, придерживаясь правой стороны.", cl: "text-dark" },
                { q: "Пешеходы должны передвигаться по тротуарам, придерживаясь левой стороны.", cl: "text-dark" },
                { q: "Если тротуаров нет, то нужно идти по обочине дороги по направлению движения транспортных средств.", cl: "text-dark" },
                { q: "Если тротуаров нет, то нужно идти по обочине дороги навстречу движущемуся транспорту.", cl: "text-dark" }

              ]}
              trueans={[false, true, true, false]}
              addCl={"fw-bold perek"}
            />,
            <Select
              quiz={
                "В каких правилах поведения пешехода пропущено слово НЕЛЬЗЯ? Оставь только верные ответы, а остальные удали."
              }
              img={mouse}
              ans={[
                { q: "______ переходить проезжую часть на красный сигнал светофора.", cl: "text-dark" },
                { q: "______ переходить проезжую часть в установленном месте по пешеходному переходу.", cl: "text-dark" },
                { q: "______ перебегать проезжую часть перед движущимся транспортом.", cl: "text-dark" },
                { q: "______ переходить перекрёсток по пешеходным переходам.", cl: "text-dark" }

              ]}
              trueans={[false, true, false, true]}
              addCl={"fw-bold text-white"}
            />,
            <Subsequence
              img={sub_1_1_1}
              trueans={["1", "6", "3", "5", "4", "2"]}
              arrans={["1", "", "", "", "", ""]}
              quiz="Укажи правильную последовательность действий при переходе улицы по нерегулируемому пешеходному переходу. Пронумеруй действия пешехода."
              ans={[
                "Подойдите к краю проезжей части.",
                "При отсутствии движущегося транспорта завершите переход дороги.",
                "Затем посмотрите налево.",
                "На середине проезжей части остановитесь и посмотрите направо.",
                "Если нет машин, дойдите до середины проезжей части.",
                "Оцените ситуацию на дороге и убедитесь, что нет приближающегося транспортного средства и движение будет безопасным."
              ]}
              col={[11, 11, 3, 8]}
            />,
            <Select
              quiz={
                "Прочитай задание Дум Думыча, рассмотри рисунок к нему и выбери правильный ответ."
              }
              quiz2={"Ваня находится у нерегулируемого перекрёстка. Ему нужно перейти на другую сторону улицы, где его ждёт Аня. У Вани есть три способа это сделать. Каждый способ обозначен на рисунке стрелками разного цвета. Но какой способ выбрать, чтобы не нарушить правила дорожного движения, мальчик не знает. Помоги Ване сделать правильный выбор. Найди правильный вариант среди перечисленных и подчеркни его."}
              quiz3={"По правилам дорожного движения Ваня может перейти перекрёсток:"}
              img={sub_1_1_8}
              ans={[
                { q: "только так, как указано красными стрелками", cl: "text-dark" },
                { q: "только так, как указано синими стрелками", cl: "text-dark" },
                { q: "только так, как указано жёлтой стрелкой", cl: "text-dark" },
                { q: "так, как указано жёлтой и красной стрелкой", cl: "text-dark" },
                { q: "так, как указано синей и красной стрелкой", cl: "text-dark" },
                { q: "так, как указано жёлтой и синей стрелкой", cl: "text-dark" },
                { q: "любым способом из указанных выше", cl: "text-dark" }
              ]}
              trueans={[false, false, false, false, true, false, false]}
              addCl={"fw-bold text-success"}
            />,
            <Select
              quiz={
                "Выбери все верные продолжения предложения. Закрась ячейки таблицы, в которых они записаны."
              }
              newquiz1={"Если в зоне видимости нет пешеходного перехода или перекрёстка, то перейти проезжую часть можно на участке, где …"}
              img={select_1_1_13}
              ansnew={[
                { q: "нет ограждений", cl: "text-dark" },
                { q: "есть ограждения", cl: "text-dark" },
                { q: "дорога хорошо просматривается хотя бы в одну сторону", cl: "text-dark" },
                { q: "дорога хорошо просматривается в обе стороны", cl: "text-dark" },
                { q: "нет движущихся машин рядом", cl: "text-dark" },
                { q: "есть движущийся вблизи транспорт", cl: "text-dark" },
              ]}
              newquiz2={"Если на улице нет пешеходного перехода, то её переходят …"}
              ans={[
                { q: "под прямым углом к обочине", cl: "text-dark" },
                { q: "наискосок", cl: "text-dark" },
                { q: "спокойно, не бегом", cl: "text-dark" },
                { q: "очень быстро, бегом", cl: "text-dark" }
              ]}

              trueans={[true, false, true, false, true, false, false, true, true, false]}
              addCl={"fw-bold bg-success text-white"}
            />,
            <Rebus
              quiz="Что должно быть на одежде (обуви) или рюкзаке (сумке) у пешехода, если он движется по обочине или краю проезжей части вне населённого пункта в тёмное время суток? *Слово нужно записать в единственном числе."
              trueans={"ФЛИКЕР"}
            />,
            <Select
              quiz={
                "Прочитай. Выбери правильный ответ."
              }
              quiz2={"Ваня начал переходить дорогу на зелёный сигнал светофора. Когда он дошёл до середины проезжей части, сигнал светофора изменился на красный, и машины начали движение. Как Ваня должен поступить в такой ситуации?"}
              img={select_1_1_14}
              ans={[
                { q: "Продолжить движение и закончить переход дороги бегом.", cl: "text-dark" },
                { q: "Остановиться на островке безопасности или линии, разделяющей транспортные потоки противоположных направлений, и ждать зелёного сигнала светофора.", cl: "text-dark" },
                { q: "Вернуться обратно и ждать зелёного сигнала светофора.", cl: "text-dark" },
                { q: "Можно воспользоваться любым из названных выше вариантов действий.", cl: "text-dark" }
              ]}
              trueans={[false, true, false, false]}
              addCl={"fw-bold bg-success text-white"}
            />,
            <PickTrue
              trueans={["Верно", "Верно", "Неверно"]}
              arrans={["Верно", "Неверно"]}
              quiz="Прочитай вопрос и ответы на него. Укажи возле каждого ответа, верный он или нет. Щелкни левой клавишей мыши на нужное слово."
              quiz2="Какими должны быть действия пешеходов при приближении транспортного средства с включённым проблесковым маячком синего цвета и специальным звуковым сигналом?"
              ans={[
                "При приближении такого транспортного средства пешеходы должны воздержаться от перехода проезжей части.",
                "При приближении такого транспортного средства пешеходы, находящиеся на проезжей части, должны незамедлительно освободить её и уступить дорогу этому транспортному средству.",
                "Требование уступить дорогу транспортному средству с включённым синим проблесковым маячком и специальным звуковым сигналом касается только водителей, на пешеходов это требование не распространяется, поэтому они могут спокойно переходить проезжую часть, соблюдая все меры предосторожности.",
              ]}
            />,
          ],
        },
        {
          title: "Тема №2.Сигналы светофора, регулировщика",
          quests: [
            <Imgdrop
              quiz={"Что означают сигналы светофора? Перенесите под каждый рисунок подходящую запись."}
              ans={[imgdrop1_2_1, imgdrop1_2_2, imgdrop1_2_3]}
              ansImg={true}
              col={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "Запрещает движение, предупреждает о смене сигнала" }],
                [{ id: "2", content: "Запрещает движение" }],
                [{ id: "3", content: "Разрешает движение" }],
              ]}
              arrImg={false}
              trueans={["2", "1", "3"]}
              h={100}
            />,
            <PickTrue
              trueans={["Нет", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) прямоугольник со словом «ДА», если утверждение верное, и прямоугольник со словом «НЕТ» – если неверное."
              ans={[
                "Если рядом нет движущихся машин, по улицу можно переходить на любой сигнал светофора.",
                "Светофоры для пешеходов могут не иметь жёлтого сигнала.",
                "Если сигнал светофора начал мигать, то это значит, что время его действия истекло и скоро будет включён другой сигнал.",
                "Если на светофоре постоянно мигает только жёлтый сигнал, то это значит, что светофор сломан.",
              ]}
            />,
            <Select
              quiz={
                "Можно ли переходить улицу, если на светофоре постоянно мигает только жёлтый сигнал?"
              }
              img={s1_2_4}
              ans={[
                { q: "Нельзя ни в каком случае.", cl: "text-dark" },
                { q: "Можно. Нужно только сначала внимательно осмотреться и пропустить движущийся транспорт.", cl: "text-dark" },
                { q: "Можно только в тёмное время суток.", cl: "text-dark" },
              ]}
              trueans={[false, true, false]}
              addCl={"fw-bold text-success"}
            />,
            <ColorPic
              ans={
                "Какой перекрёсток считается регулируемым? Выдели правильный ответ синим цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Перекрёсток, на котором установлены дорожные знаки.",
                "Перекрёсток, на котором есть светофор, который работает в нормальном режиме (красный – жёлтый – зелёный), или стоит регулировщик.",
                "Только тот перекрёсток, где стоит регулировщик.",
              ]}
              trueans={["#fff", "#32adf0", "#fff"]}
            />,
            <ImagePic
              imgArr={[ip1_2_5, ip1_2_6, ip1_2_7, ip1_2_8]}
              trueans={[0, 2, 3]}
              multi={true}
              quiz="Выбери картинки, на которых изображены регулируемые перекрёстки."
            />,
            <Select
              quiz={
                "Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              }
              quiz2={"Иногда бывает так, что на перекрёстке рядом со светофором стоит регулировщик, и его указания противоречат сигналам светофора. Как в этом случае нужно действовать пешеходам?"}
              img={mouse}
              ans={[
                { q: "Нужно ориентироваться на сигналы светофора.", cl: "text-dark" },
                { q: "Нужно выполнять только указания регулировщика.", cl: "text-dark" },
                { q: "Сообщить регулировщику, что его сигналы противоречат сигналам светофора.", cl: "text-dark" },
                { q: "Нужно ориентироваться и на сигналы светофора, и на сигналы регулировщика.", cl: "text-dark" },
              ]}
              trueans={[true, false, true, true]}
              addCl={"text-white"}
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Кто из пешеходов имеет право переходить улицу при данном сигнале регулировщика?"
              }
              img={ip1_2_10}
              ans={[
                { q: "Перейти улицу имеют право девочка и бабушка.", cl: "text-dark" },
                { q: "Перейти улицу имеют право мальчик и дедушка.", cl: "text-dark" },
                { q: "Перейти улицу имеют право дедушка и бабушка.", cl: "text-dark" },
                { q: "Перейти улицу имеют право мальчик и девочка.", cl: "text-dark" },
                { q: "Перейти улицу имеют право мальчик и бабушка.", cl: "text-dark" },
                { q: "Перейти улицу имеют право девочка и дедушка.", cl: "text-dark" },
                { q: "Никто из пешеходов не имеет право перейти улицу.", cl: "text-dark" },

              ]}
              trueans={[false, false, false, false, false, false, true]}
              addCl={"fw-bold text-primary"}
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Укажи всех пешеходов, которым разрешено переходить улицу при данном сигнале регулировщика?"
              }
              img={ip1_2_11}
              ans={[
                { q: "Бабушка", cl: "text-dark" },
                { q: "Девочка", cl: "text-dark" },
                { q: "Mальчик", cl: "text-dark" },
                { q: "Мужчина", cl: "text-dark" }
              ]}
              trueans={[true, false, true, false]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Нарушает ли правила дорожного движения девочка, переходящая улицу?"
              }
              img={ip1_2_12}
              ans={[
                { q: "Да", cl: "text-dark" },
                { q: "Нет", cl: "text-dark" },
              ]}
              trueans={[false, true]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Rebus
              img={ip1_2_13}
              quiz="Разгадай ребус, и узнаешь название города, в котором был установлен первый в мире светофор."
              trueans={"ЛОНДОН"}
            />,
          ],
        },
        {
          title: "Тема №3. Дорожные знаки",
          quests: [
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Без дорожных знаков невозможно безопасное движение по улицам и дорогам.",
                "Дорожные знаки делятся на несколько групп.",
                "Все дорожные знаки одинаковы по размеру, форме и величине.",
                "Знать дорожные знаки и следовать их указаниям обязаны только водители транспортных средств.",
              ]}
              trueans={["#32adf0", "#32adf0", "#f74f5a", "#f74f5a"]}
            />,
            <Imgdrop
              quiz={"Размести каждый знак в прямоугольнике под его названием."}
              dec={"Зажимай картинку левой клавишей мыши и перетаскивай в нужное место."}
              ans={["Место остановки такси", "Место остановки автобуса и (или) троллейбуса", "Место остановки трамвая"]}
              ansImg={false}
              col={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: ip1_3_2_1 }],
                [{ id: "2", content: ip1_3_2_2 }],
                [{ id: "3", content: ip1_3_2_3 }],
              ]}
              arrImg={true}
              trueans={["2", "1", "3"]}
              h={"20vw"}
            />,
            <ImagePic
              imgArr={[ip1_3_3_1, ip1_3_3_2, ip1_3_3_3, ip1_3_3_4]}
              trueans={[1]}
              quiz="Отметь запрещающий знак (нажми на нужную картинку)."
            />,
            <Emphas
              quiz="Под каждым знаком найди его название.
              (кликни левой клавишей мыши по нужными словам)"
              ans={[
                {
                  q: ip1_3_5_1,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
                {
                  q: ip1_3_4_1,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
                {
                  q: ip1_3_4_4,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
              ]}
              trueans={[1, 2, 0]}
              ansImg={true}
            />,
            <ImagePic
              imgArr={[ip1_3_4_1, ip1_3_4_2, ip1_3_4_3, ip1_3_4_4, ip1_3_4_5, ip1_3_4_6]}
              trueans={[1, 2, 3, 4]}
              quiz="Отметь знаки, которые не относятся к предупреждающим."
            />,
            <Imgdrop
              quiz={"Прочитай. Выбери знак, который соответствует описанию, и перенеси его в нужный прямоугольник."}
              dec={"Зажимай картинку левой клавишей мыши и перетаскивай в нужное место."}
              ans={["Этот знак указывает место, где находится пешеходный переход. Именно здесь нужно переходить дорогу.",
                "Этот знак предупреждает водителя о том, что впереди будет пешеходный переход. Там, где установлен этот знак переходить улицу нельзя!"
              ]}
              ansImg={false}
              col={4}
              arr={[
                [],
                [],
                [{ id: "1", content: ip1_3_4_6 }],
                [{ id: "2", content: ip1_3_4_5 }],
                [{ id: "3", content: ip1_3_5_1 }],
              ]}
              arrImg={true}
              trueans={["2", "1"]}
              h={"20vw"}
            />,
            <ImagePic
              imgArr={[ip1_3_4_4, ip1_3_4_2, ip1_3_4_6, ip1_3_7_4]}
              trueans={[2]}
              quiz="Ответь на вопрос Дум Думыча. Какой знак лишний?"
            />,
            <Imgdrop
              quiz={"Рассмотри рисунки. Какие дорожные знаки должны быть изображены на них вместо белых квадратов с вопросительными знаками?"}
              dec={"Перенеси нужный знак под каждый рисунок."}
              ans={[ip1_3_8_1, ip1_3_8_2]}
              ansImg={true}
              col={4}
              arr={[
                [],
                [],
                [{ id: "1", content: ip1_3_4_5 }],
                [{ id: "2", content: ip1_3_8_4 }],
                [{ id: "3", content: ip1_3_8_5 }],
              ]}
              arrImg={true}
              trueans={["2", "1"]}
              h={"20vw"}
            />,
            <Emphas
              quiz="Под каждым знаком найди его название.
              (кликни левой клавишей мыши по нужными словам)"
              ans={[
                {
                  q: ip1_3_9_1,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_9_2,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_9_3,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_4_2,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"]
                },
              ]}
              trueans={[1, 2, 3, 0]}
              ansImg={true}
            />,
            <Rebus
              img={ip1_3_10_1}
              quiz="Разгадай ребус, запиши название знака."
              trueans={"ТЕЛЕФОН"}
            />,
          ],
        },
        {
          title: "Тема №4. Ты пассажир",
          quests: [
            <Select
              quiz={
                "Кто такой пассажир? Выбери два правильных ответа."
              }
              ans={[
                { q: "Это тот человек, перевозится транспортным средством, но не является водителем.", id: 0, a: true },
                { q: "Это тот человек, который управляет транспортным средством.", id: 1, a: false },
                { q: "Это тот человек, который перевозится транспортным средством или управляет им.", id: 2, a: false },
                { q: "Это тот человек, который входит в транспортное средство или выходит из него.", id: 3, a: true },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <ImagePic
              imgArr={[i1_4_1, i1_4_2, i1_4_3, i1_4_4]}
              trueans={[0]}
              des="Щёлкни левой клавишей мыши на нужном знаке."
              quiz="Помоги Ване найти знак, который используется для обозначения остановочного пункта троллейбуса?"
            />,
            <Select
              quiz={
                "Вспомни, как нужно вести себя на автобусной или троллейбусной остановке. Выдели красным цветом то, что делать нельзя."
              }
              ans={[
                { q: "Cтоять у самой кромки тротуара.", id: 0, a: true },
                { q: "Выбегать к подъезжающему к остановке автобусу или троллейбусу.", id: 1, a: true },
                { q: "Становиться на остановке в первый ряд(ближний к дороге).", id: 2, a: true },
                { q: "Сидеть на установленной на остановке скамейке.", id: 3, a: false },
                { q: "Выходить и выбегать на проезжую часть во время ожидания автобуса или троллейбуса.", id: 4, a: true },
                { q: "Спокойно подходить к остановившемуся транспорту для посадки.", id: 5, a: false },
                { q: "Заходить в автобус или троллейбус не спеша,соблюдая очерёдность.", id: 6, a: false },
                { q: "Расталкивать людей, пытаясь оказаться первым у двери автобуса или троллейбуса.", id: 7, a: true },
              ]}
              addCl={"fw-bold text-danger"}
            />,
            <ImagePic
              imgArr={[i1_4_6, i1_4_7, i1_4_8, i1_4_9, i1_4_10, i1_4_11]}
              trueans={[0, 2, 5]}
              quiz="Выбери те картинки, где ребята не нарушают правила безопасного поведения, ожидая на остановке автобус."
            />,
            <ImagePic
              imgArr={[i1_4_12, i1_4_13, i1_4_14, i1_4_15]}
              trueans={[0, 3]}
              quiz="Выдели картинки, к которым можно подписать следующие правила: 1) Нельзя высовываться в окно в движущемся транспорте. 2) Не отвлекайте водителя во время его работы."
            />,
            <Select
              quiz={
                "Рассмотри картинку. Вспомни правила безопасного поведения в метро. Ответь на вопрос."
              }
              img={i1_4_16}
              ans={[
                { q: "1", id: 0, a: false },
                { q: "2", id: 1, a: false },
                { q: "3", id: 2, a: true },
                { q: "4", id: 3, a: false },
                { q: "5", id: 4, a: false },
                { q: "6", id: 5, a: false },
                { q: "7", id: 6, a: false },
                { q: "8", id: 7, a: false },
                { q: "9", id: 8, a: true },
              ]}
              addCl={"fw-bold text-white bg-primary"}
              gor={true}
            />,
            <Select
              quiz={
                "В каких правилах поведения в общественном транспорте пропущено слово НЕЛЬЗЯ?"
              }
              img={mouse}
              ans={[
                { q: "______ прислоняться к дверям и опираться на них.", id: 0, a: true },
                { q: "______ уступать место пассажирам детьми на руках, больным и пожилым людям.", id: 1, a: false },
                { q: "______ кричать и громко разговаривать, сорить, толкаться.", id: 2, a: true },
                { q: "______ оплачивать проезд.", id: 3, a: false },
                { q: "______ заранее готовиться к выходу.", id: 4, a: false },
                { q: "______ препятствовать закрыванию дверей", id: 5, a: true },
                { q: "______открывать двери транспортного средства во время его движения.", id: 6, a: true },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Subsequence
              img={i1_4_20}
              trueans={["4", "1", "3", "2"]}
              arrans={["", "", "", ""]}
              quiz="Напечатай возле каждого правила номер подходящей для него картинки."
              ans={[
                "В салоне автобуса, троллейбуса, вагоне поезда метро держитесь за поручни, чтобы не упасть, если водителю придётся резко затормозить.",
                "Во избежание быть зажатым дверьми не пытайтесь сесть в транспорт в последний момент перед отправкой.",
                "Если вагон поезда метро, автобус или троллейбус переполнен, лучше подождать следующего.",
                "Нельзя входить в транспорт с мороженым и напитками, даже если салон свободен; при резком торм ожении можно испачкать других пассажиров.",
              ]}
              col={[11, 11, 6, 6]}
            />,
            <SelectedWord
              quiz={"Как нужно обходить стоящий автобус, троллейбус, трамвай? Используя выпадающие списки, вставь пропущенные слова."}
              arrText={["Троллейбус нужно обходить ",
                ". Трамвай нужно обходить ",
                ". Автобус нужно обходить ",
              ]}
              arrWord={[["сзади", "спереди"], ["сзади", "спереди"], ["сзади", "спереди"]]}
              trueAns={["0", "1", "0"]}
              img={i1_4_23}
            />,
            <Select
              quiz={
                "Прочитай вопрос и ответы ребят на этот вопрос. Кто из ребят ответил правильно?"
              }
              quiz3={"Твой друг уронил на рельсы в метро мобильный телефон. Как нужно поступить в такой ситуации? Ваня: «Если нет приближающегося поезда, быстро спуститься на рельсы и поднять телефон». Катя: «Сначала дождаться ближайшего поезда, а затем после его ухода быстро спуститься на рельсы и поднять телефон». Саша: «Сообщить о случившемся дежурному по станции и попросить помощи»."}
              ans={[
                { q: "Ваня", id: 0, a: false },
                { q: "Ваня и Катя", id: 1, a: false },
                { q: "Катя", id: 2, a: false },
                { q: "Саша и Катя", id: 3, a: false },
                { q: "Саша", id: 4, a: true },
                { q: "Саша и Ваня", id: 5, a: false },
                { q: "Все ответили правильно", id: 6, a: false },
                { q: "Все ответили неправильно", id: 7, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
          ],
        },
        {
          title: "Тема №5. Правила езды велосипедах",
          quests: [
            <Subsequence
              img={i1_5_1}
              trueans={["4", "6", "5", "2", "3", "1", "8", "7"]}
              arrans={["", "", "", "", "", "", ""]}
              quiz="Укажи правильную последовательность действий при переходе улицы по нерегулируемому пешеходному переходу. Пронумеруй действия пешехода."
              ans={[
                "педаль",
                "спицы",
                "шина (покрышка)",
                "руль",
                "рама",
                "багажник",
                "цепь",
                "седло",
              ]}
              col={[11, 11, 3, 8]}
            />,
            <Select
              quiz={
                "До какого возраста детям запрещено выезжать на велосипеде на дорогу, где движутся автомобили?"
              }
              img={i1_5_2}
              ans={[
                { q: "до 14 лет", id: 0, a: true },
                { q: "до 16 лет", id: 1, a: false },
                { q: "до 15 лет", id: 2, a: false },
                { q: "до 18 лет", id: 3, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Где можно кататься на велосипедах детям в возрасте от 7 до 14 лет? Выдели зеленым правильные ответы."
              }
              ans={[
                { q: "во дворах", id: 0, a: true },
                { q: "в парках", id: 1, a: true },
                { q: "на скоростных автомобильных дорогах", id: 2, a: false },
                { q: "на велосипедных дорожках", id: 3, a: true },
                { q: "на стадионах", id: 4, a: true },
                { q: "по крайней правой полосе проезжей части, если рядом нет машин", id: 5, a: false },
                { q: "на велопешеходных дорожках", id: 6, a: true },
              ]}
              addCl={"fw-bold text-white bg-success"}
            />,
            <ImagePic
              imgArr={[i1_5_3, i1_5_4]}
              trueans={[0]}
              quiz="Велосипедисту необходимо пересечь проезжую часть по пешеходному переходу. Как
              правильно это сделать? Выбери картинки с правильным ответом."
            />,
            <Imgdrop
              quiz={"Расположи под каждым знаком его название."}
              ans={[ip1_3_4_2, ip1_3_3_3, i1_5_7]}
              ansImg={true}
              col={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "Велосипедная дорожка" }],
                [{ id: "2", content: "Движение на велосипеде запрещено" }],
                [{ id: "3", content: "Конец велосипедной дорожки" }],
              ]}
              arrImg={false}
              trueans={["2", "1", "3"]}
              h={"15vw"}
            />,
            <Select
              quiz={
                "Выбери правильные ответы на вопрос Дум Думыча."
              }
              quiz3={"В каких правилах поведения на воде пропущено слово НЕЛЬЗЯ?"}
              img={mouse}
              ans={[
                { q: "______ ездить на велосипеде, если неисправна тормозная система или рулевое управление.", id: 0, a: true },
                { q: "______ надевать шлем для езды на велосипеде.", id: 1, a: false },
                { q: "______ перевозить груз, мешающий управлению велосипедом.", id: 2, a: true },
                { q: "______ подавать определённый сигнал перед совершением поворота.", id: 3, a: false },
                { q: "______ цепляться за проезжающее мимо транспортное средство.", id: 4, a: true }
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Что нужно вставить на месте пропусков?"
              }
              quiz3={"Велосипедист, как и другие участники дорожного движения, обязан подавать сигналы о планируемых маневрах."}
              ans={[
                { q: "вытянуть в сторону левую руку", id: 0, a: true },
                { q: "вытянуть в сторону правую руку", id: 1, a: false },
                { q: "поднять согнутую в локте левую руку", id: 2, a: false },
                { q: "поднять согнутую в локте правую руку", id: 3, a: true },
              ]}
              ansnew={[
                { q: "вытянуть в сторону левую руку", id: 4, a: false },
                { q: "вытянуть в сторону правую руку", id: 5, a: true },
                { q: "поднять согнутую в локте левую руку", id: 6, a: true },
                { q: "поднять согнутую в локте правую руку", id: 7, a: false },
              ]}

              newquiz1={"Перед поворотом налево, велосипедист должен … или … ."}
              newquiz2={"Перед поворотом направо, велосипедист должен … или … ."}
              addCl={"fw-bold text-success"}
            />,
            <Select
              quiz={
                "Какой сигнал должен подать велосипедист другим участникам дорожного движения перед торможением или остановкой?"
              }
              img={i1_5_8}
              ans={[
                { q: "поднять вверх обе руки", id: 0, a: false },
                { q: "поднять вверх левую или правую руку", id: 1, a: true },
                { q: "вытянуть в сторону обе руки", id: 2, a: false },
                { q: "заложить правую руку за спину", id: 3, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <ImagePic
              imgArr={[i1_5_9, i1_5_10, i1_5_11, i1_5_12]}
              trueans={[1, 2]}
              quiz="Кто из ребят нарушает правила катания на велосипеде?"
            />,
            <ColorPic
              ans={
                "Выдели зелёным цветом те действия, которые разрешены, красным – те, которые запрещены."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели фразу, щёлкнув по ней левой клавишей мыши."}
              arr={[
                "разговаривать по телефону во время езды",
                "катать друзей на багажнике велосипеда",
                "кататься с друзьями по велосипедной дорожке, двигаясь в один ряд",
                "кататься в наушниках",
                "при движении по пешеходной дорожке предупреждать пешеходов звонком или голосом о том, что вы подъезжаете к ним сзади",
              ]}
              trueans={["#f74f5a", "#f74f5a", "#18d945", "#f74f5a", "#18d945"]}
            />,
          ],
        },
        {
          title: "Тема №6. Ситуационные задачи ПДД",
          quests: [
            <ImagePic
              imgArr={[i1_6_1, i1_6_2, i1_6_3, i1_6_4]}
              trueans={[0, 2, 3]}
              quiz="Отметь картинки, на которых изображены ребята, нарушающие правила безопасного поведения."
            />,
            <Select
              quiz={
                "Прочитай. Подчеркни правильный ответ."
              }
              newquiz1={`Четверо ребят переходили улицу на нерегулируемом пешеходном
          переходе. Игорь посмотрел направо и стал переходить дорогу. Ваня,
          разговаривая по телефону, глянул налево и начал переход проезжей
          части. Никита не стал смотреть по сторонам, ведь машины должны
          пропустить движущегося по переходу пешехода. Катя сначала
          осмотрелась и убедилась в том, что поблизости нет машин, затем
          ещё раз посмотрела налево и начала переход.
          Кто в этой ситуации действовал правильно?`}
              img={i1_6_5}
              ans={[
                { q: "Игорь", id: 0, a: false },
                { q: "Ваня", id: 1, a: false },
                { q: "Никита", id: 2, a: false },
                { q: "Катя", id: 3, a: true },
                { q: "Игорь и Катя", id: 4, a: false },
                { q: "Все действовали правильно", id: 5, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Прочитай. Выбери правильный ответ."
              }
              newquiz1={`Катя и Паша катаются на велосипедах. Им нужно
          попасть на другую сторону улицы. Они остановились
          возле пешеходного перехода и задумались, как
          правильно поступить. Катя предложила переехать
          проезжую часть на велосипеде, а Ваня сказал, что они
          должны перейти проезжую часть пешком, а велосипед
          вести рядом с собой.
          Кто прав?`}
              img={i1_6_6}
              ans={[
                { q: "Катя", id: 0, a: false },
                { q: "Паша", id: 1, a: true },
                { q: "Оба правы", id: 2, a: false },
              ]}
              addCl={"fw-bold text-white bg-success"}
            />,
            <ImagePic
              imgArr={[i1_6_7, i1_6_8, i1_6_9, i1_6_10]}
              trueans={[2]}
              quiz="Рассмотри картинки. В каком случае нарушены правила дорожного движения?"
            />,
            <Select
              quiz={
                "Рассмотри рисунки. Кому из этих велосипедистов запрещено ездить по дороге, где движутся автомобили?"
              }
              img={i1_6_14}
              ans={[
                { q: "Коле", id: 0, a: false },
                { q: "Ане", id: 1, a: false },
                { q: "Саше", id: 2, a: false },
                { q: "Мише", id: 3, a: false },
                { q: "Всем разрешено", id: 4, a: false },
                { q: "Всем запрещено", id: 5, a: true },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Ответь на вопрос Дум Думыча. Зачеркни все неправильные ответы."
              }
              newquiz1={`Каким сигналом велосипедист должен информировать других участников
          дорожного движения о том, что он намерен остановиться?`}
              img={i1_6_15}
              ans={[
                { q: "поднять руку вверх", id: 0, a: false },
                { q: "вытянуть в сторону правую руку", id: 1, a: true },
                { q: "вытянуть в сторону обе руки", id: 2, a: true },
                { q: "вытянуть в сторону левую руку", id: 3, a: true },
              ]}
              addCl={"fw-bold perek"}
            />,
            <Select
              quiz={
                "Прочитай. Ответь на вопрос."
              }
              newquiz1={`Должен ли пешеход, переходящий улицу на зелёный
          сигнал светофора, пропускать машину скорой помощи,
          движущуюся с включённым проблесковым маячком и
          специальным звуковым сигналом на красный свет?`}
              img={i1_6_16}
              ans={[
                { q: "Да", id: 0, a: true },
                { q: "Нет", id: 1, a: false },
                { q: "Зависит от скорости движения машины", id: 2, a: false },
              ]}
              addCl={"fw-bold text-white bg-success"}
            />,
            <Select
              quiz={
                "Кто из пешеходов нарушил правила дорожного движения?"
              }
              gor={true}

              img={i1_6_17}
              ans={[
                { q: "1", id: 0, a: true },
                { q: "2", id: 1, a: false },
                { q: "3", id: 2, a: false },
                { q: "4", id: 3, a: false },
                { q: "2 и 4", id: 4, a: false },
                { q: "1, 2 и 4", id: 5, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Emphas
              quiz="Под каждым определением найди его значение.
              (кликни левой клавишей мыши по нужными словам)"
              ans={[
                {
                  q: "Место пересечения дорог.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Предмет, который использует регулировщик для регулирования движения на проезжей части.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Полосатая разметка перехода.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Двухколесное или трехколесное транспортное средство без мотора.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
              ]}
              trueans={[3, 0, 1, 2]}
            />,
            <Rebus
              quiz="Разгадай ребус."
              trueans={"ФЛИКЕР"}
              img={i1_6_18}
            />,

          ],
        },
        {
          title: "Тема №7. ТБ зимой, общие.",
          quests: [
            <ImagePic
              imgArr={[i1_7_1, i1_7_2, i1_7_3, i1_7_4, i1_7_5, i1_7_6, i1_7_7, i1_7_8, i1_7_9]}
              trueans={[1, 3, 8]}
              quiz="Помоги Ване выбрать каждой строке один предмет одежды или обуви для зимней прогулки."
            />,
            <SelectedWord
              quiz={"Вспомни, как правильно нужно одеваться зимой. Прочитай предложения и с помощью выпадающих списков вставь пропущенные слова."}
              arrText={["Чем ",
                " слоёв одежды на человеке, тем лучше сохраняется тепло. Ноги быстро замерзают в ",
                " обуви.",
              ]}
              arrWord={[["больше", "меньше"], ["свободной", "тесной"]]}
              trueAns={["0", "1"]}
            />,
            <Emphas
              quiz="Выберете правильный ответ."
              ans={[
                {
                  q: "Что лучше сохраняет тепло?",
                  arr: ["Варежки", "Перчатки"],
                },
                {
                  q: `Какие носочки теплее?`,
                  arr: ["Из шерсти", "Из хлопка"],
                },
              ]}
              trueans={[0, 0]}
              ansImg={false}
            />,
            <ColorPic
              ans={
                "Что может стать зимой причиной переохлаждения организма? Выдели правильные ответы синим цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Мороз",
                "Могослойная одежда",
                "Высокая влажность воздуха",
                "Хорошее настроение",
                "Cильный ветер",
                "Tесная и влажная одежда и обувь"
              ]}
              trueans={["#32adf0", "#fff", "#32adf0", "#fff", "#32adf0", "#32adf0"]}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Вспомни правила безопасного поведения во время прогулки зимой."
              quiz2="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и прямоугольник со словом «нет» – если неверное."
              ans={[
                "Если почувствовал, что замерзаешь или промочил ноги, нужно немедленно возвращаться домой и сразу же переодеваться в сухую одежду.",
                "Чтобы не замёрзнуть на улице зимой, нужно поменьше двигаться.",
                "На морозе нельзя браться за металлические поверхности голыми руками.",
                "На улице нельзя снимать шапку и шарф, даже если появилось ощущение тепла.",
                "Если захотелось пить, можно съесть сосульку, чтобы утолить жажду."
              ]}
            />,
            <ColorPic
              ans={
                "Что нельзя делать, если ты отморозил пальцы рук или ног? Выдели нужные ответы красным цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "растирать замёрзшие участки тела снегом",
                "пить горячий чай",
                "укутываться тёплым одеялом",
                "заходить в тёплое помещение",
                "погружать руки или ноги в горячую воду, чтобы быстро согреться",
                "погружать руки или ноги в едва тёплую, прохладную воду."
              ]}
              trueans={["#f74f5a", "#fff", "#fff", "#fff", "#f74f5a", "#fff"]}
            />,
            <Select
              quiz={
                "Какие дополнительные опасности появляются на дороге зимой? Выбери все правильные ответы."
              }
              img={i1_7_15}
              ans={[
                { q: "Гололёд увеличивает тормозной путь автомобилей.", id: 0, a: true },
                { q: "Снегопад ухудшает видимость водителям и пешеходам.", id: 1, a: true },
                { q: "Тёплая одежда сковывает движения.", id: 2, a: true },
                { q: "Сугробы на обочинах дорог ограничивают обзор.", id: 3, a: true },
                { q: "Происходит сужение дороги из-за неубранного снега.", id: 4, a: true },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Выбери все верные продолжения предложения. Закрась ячейки таблицы, в которых они записаны."
              }
              newquiz1={"По сравнению с летом, зимой при переходе проезжей части расстояние между пешеходом и автомобилем должно быть"}
              ans={[
                { q: "больше", id: 0, a: true, },
                { q: "меньше", id: 1, a: false },
                { q: "таким же", id: 2, a: false }
              ]}
              newquiz2={"На улице сильный ветер и идёт снег. При переходе проезжей части я …"}
              ansnew={[
                { q: "натяну шапку на глаза и надену сверху капюшон, чтобы снег не попадал в глаза", id: 3, a: false },
                { q: "прищурюсь или закрою глаза", id: 4, a: false },
                { q: "откину назад капюшон, постараюсь прикрыться ладонью от снега так, чтобы не закрывать видимость дороги", id: 5, a: true },
              ]}
              addCl={"fw-bold bg-success text-white"}
            />,
            <Select
              quiz={
                "Ты с родителями гулял в городе возле ёлки, где было очень много людей, и потерялся. Телефон ты забыл дома. Попытки найти родителей не увенчались успехом. Как правильно поступить в этом случае? Отметь правильные ответы."
              }
              ans={[
                { q: "не уходить далеко от того места, где потерялся", id: 0, a: true },
                { q: "обратиться с просьбой помочь к любому человеку, который тебе улыбнётся или заговорит с тобой", id: 1, a: false },
                { q: "обратиться к полицейскому", id: 2, a: true },
                { q: "найти детей такого же возраста, как ты, и попросить помочь", id: 3, a: false },
                { q: "начинать паниковать и плакать", id: 4, a: false },
                { q: "не стоять на месте, бежать в любом направлении и искать родителей", id: 5, a: false },

              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Прочитай правила использования бенгальских огней, которые записал Серёжа. Зачеркни то, что неверно."
              }
              img={i1_7_17}
              ans={[
                { q: "Бенгальская свеча не считается огнеопасным изделием, поэтому поджигать её можно самостоятельно, без взрослых.", id: 0, a: true },
                { q: "Держать бенгальскую свечу нужно за металлическое основание под наклоном к горизонтальной поверхности на расстоянии вытянутой руки.", id: 1, a: false },
                { q: "Держать бенгальскую свечу нужно вертикально за металлическое основание.", id: 2, a: true },
                { q: "Нельзя прикасаться к горящему или только что потухшему бенгальскому огню.", id: 3, a: false },
                { q: "Потухшую бенгальскую свечку следует класть в стакан с водой.", id: 4, a: false },

              ]}
              addCl={"fw-bold perek"}
            />,
          ],
        },
        {
          title: "Тема №8. Правила поведения зимой во время игр, катания на санках, коньках. ТБ зимой на льду",
          quests: [
            <Select
              quiz={
                "На каких горках нельзя кататься на лыжах и санках?"
              }
              img={i1_8_1}
              ans={[
                { q: "горка со спуском на железные пути", id: 0, a: true },
                { q: "горка со спуском на проезжую часть дороги", id: 1, a: true },
                { q: "небольшая горка во дворе с ровным пологим склоном вдали от дороги", id: 2, a: false },
                { q: "горка, поросшая кустами и деревьями", id: 3, a: true },
                { q: "горка, специально оборудованная для катания", id: 4, a: false },
                { q: "горка, на которой есть торчащие камни", id: 5, a: true },
              ]}
              addCl={"fw-bold text-white bg-danger"}
              imgsize={"50%"}
            />,
            <ImagePic
              imgArr={[i1_8_2, i1_8_3, i1_8_4, i1_8_5]}
              trueans={[1, 3]}
              quiz="На каких картинках изображены ребята, которые не соблюдают правила безопасного катания с горки?"
            />,
            <Select
              quiz={
                "Подумай, как можно продолжить данное предложение. Выдели все правильные варианты ответа."
              }
              img={i1_8_6}
              newquiz1="Очень опасно спускаться с горки …."
              ans={[
                { q: "стоя на ногах", id: 0, a: true },
                { q: "сидя на санках спиной вперёд", id: 1, a: true },
                { q: "сидя на санках лицом вперёд и держась за санки", id: 2, a: false },
                { q: "паровозиком, сцепив несколько санок", id: 3, a: true },
              ]}
              addCl={"fw-bold text-danger"}
              imgsize={"40%"}
            />,
            <Select
              quiz={
                "Выдели красным цветом ответы на вопрос Дум Думыча."
              }

              img={mouse}
              newquiz1="В каких правилах безопасного поведения при катании с горки пропущено слово НЕЛЬЗЯ?"
              ans={[
                { q: "______ подниматься на горку там, где навстречу скатываются другие.", id: 0, a: true },
                { q: "______ подниматься на снежную или ледяную горку только в месте подъёма, оборудованном ступенями.", id: 1, a: false },
                { q: "______ съезжать с горки, пока не отойдёт в сторону тот, кто спускается впереди.", id: 2, a: true },
                { q: "______ поскорее отползать или откатываться в сторону, когда съехал.", id: 3, a: false },
              ]}
              addCl={"fw-bold text-danger"}
              imgsize={"50%"}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Да", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и
          прямоугольник со словом «нет» – если неверное."
              ans={[
                "Между лыжниками на лыжне должна быть безопасная дистанция (не менее 3–4 м).",
                "При спуске на лыжах с горки дистанцию можно не соблюдать.",
                "При спуске на лыжах с горки нельзя выставлять вперёд лыжные палки.",
                "Нельзя прыгать с трамплина: для этого нужны специальная подготовка и прыжковые лыжи. "
              ]}
            />,
            <Select
              quiz={
                "Выбери верный вариант ответа."
              }

              img={i1_8_7}
              newquiz1="Если во время катания на лыжах ты почувствовал, что теряешь равновесие, нужно:"
              ans={[
                { q: "падать вперёд, держа при этом палки сзади", id: 0, a: false },
                { q: "слегка присесть и падать на бок, держа при этом палки сзади", id: 1, a: true },
                { q: "падать на спину, держа при этом палки перед собой", id: 2, a: false },
              ]}
              addCl={"fw-bold text-white bg-success"}
              imgsize={"40%"}
            />,
            <PickTrue
              trueans={["Нельзя", "Нельзя", "Нужно", "Нужно", "Нельзя", "Нельзя"]}
              arrans={["Нельзя", "Нужно"]}
              quiz="Выбери (нажми) на прямоугольник, что нужно, а что нельзя делать во время игры в снежки."
              ans={[
                "Бросая снежки, целиться в голову и лицо.",
                "Использовать вместо снежков ледышки.",
                "Соблюдать правила игры.",
                "Быть внимательным по отношению к своим друзьям.",
                "Снимать шапку, шарфик, варежки.",
                "Бросаться большими глыбами снега.",
              ]}
            />,
            <Emphas
              quiz="Вспомни правила безопасности, которые нужно соблюдать на ледовом катке. Выбери
        правильное продолжение для каждого правила."
              ans={[
                {
                  q: "Выходить на лёд нужно _______.",
                  arr: ["аккуратно, держась за борт", "смело, с разбега"],
                },
                {
                  q: `Двигаться на катке нужно ______.?`,
                  arr: ["навстречу потоку людей", "по направлению потока людей"],
                },
                {
                  q: `Тем, кто плохо стоит на коньках, нужно держаться _____ .`,
                  arr: ["в центре катка", "ближе к бортику"],
                },
                {
                  q: `Если ты споткнулся и падаешь, нужно_____ .`,
                  arr: ["расслабиться, постараться сгруппироваться и упасть на бок", "хвататься за других людей, чтобы замедлить падение"],
                },
              ]}
              trueans={[0, 1, 1, 0]}
              ansImg={false}
            />,
            <ColorPic
              ans={
                "Прочитай. Выдели правильный ответ синим цветом."
              }
              dec="Все дети знают, что выходить на лёд без взрослых, даже если водоём хорошо знаком, ни в коем случае
      нельзя! Но дети иногда бывают непослушны и, не задумываясь о последствиях, нарушают правила
      безопасного поведения.
      Так мальчик Ваня, оказавшись на середине реки, почувствовал, что у него под ногами затрещал лёд.
      Подскажите, как правильно нужно действовать Ване в этой ситуации."
              arr={[
                "быстро бежать к ближайшему берегу",
                "стоять на месте и звать на помощь",
                "проверить прочность льда ударом ноги",
                "медленно и плавно лечь на живот и ползти или перекатываться в том направлении, откуда пришёл",
              ]}
              trueans={["#fff", "#fff", "#fff", "#32adf0"]}
            />,
            <Subsequence
              trueans={["1", "5", "2", "6", "4", "3"]}
              arrans={["1", "", "", "", "", ""]}
              quiz="Что делать, если ты провалились под лёд? Составь правильную последовательность
    действий, пронумеровав их."
              ans={[
                "Не паникуй, не делай резких движений.",
                "Выбравшись из полыньи, сначала откатись от неё на 3–4 метра в ту сторону, откуда пришёл.",
                "Широко раскинь руки, чтобы зацепиться за кромку льда и увеличить площадь опоры. Позови на помощь.",
                "Осторожно ползи к берегу.",
                "Затем постарайся забросить одну, а потом и другую ногу на лёд.",
                "Если тебя никто не видит и не слышит, постарайся выбраться из полыньи самостоятельно. Аккуратно наползай грудью на один край полыньи, а ногами упирайся в противоположный край."
              ]}
              col={[12, 12, 11, 11]}
            />,
          ],
        },
        {
          title: "Тема №9.Погодные явления и безопасность человека",
          quests: [
            <Select
              quiz={
                "Из чего складывается погода? Выбери правильные ответы."
              }
              img={i1_9_1}
              ans={[
                { q: "температура воздуха", id: 0, a: true },
                { q: "осадки", id: 1, a: true },
                { q: "отопление в домах", id: 2, a: false },
                { q: "ветер", id: 3, a: true },
                { q: "облачность", id: 4, a: true },
                { q: "народные приметы", id: 5, a: false },
              ]}
              addCl={"fw-bold text-white bg-success"}
              imgsize={"60%"}
            />,
            <Rebus
              img={i1_9_2}
              quiz="Напечатай ответ на вопрос Дум Думыча."
              trueans={"ГРОЗА"}
            />,
            <ColorPic
              ans={
                "Как правильно вести себя во время грозы, если ты находишься дома? Выдели зелёным цветом все правильные действия."
              }
              dec={"Цвет на палитре выбирай нажатием левой клавиши мыши; чтобы выделить ответ, щёлкни на нём левой клавишей мыши."}
              arr={[
                "закрыть все окна",
                "открыть окна, чтобы был сквозняк в помещении",
                "выключить телевизор, компьютер и другие электроприборы",
                "воздержаться от разговоров по телефону",
                "находиться поближе к окнам и дверям"
              ]}
              trueans={["#18d945", "#fff", "#18d945", "#18d945", "#fff"]}
            />,
            <PickTrue
              trueans={["Нельзя", "Нельзя", "Можно", "Можно", "Нельзя", "Нельзя", "Можно"]}
              arrans={["Можно", "Нельзя"]}
              quiz="Вспомни правила безопасного поведения во время грозы, если ты находишься на улице.
        Выбери слово МОЖНО или НЕЛЬЗЯ."
              ans={[
                "прятаться под высоким деревом, особенно отдельно стоящим.",
                "находиться на возвышенностях и открытых незащищённых местах.",
                "прятаться в зарослях кустарника.",
                "прятаться в сухой яме или траншее.",
                "находиться возле металлических предметов (металлических заборов, решёток) и прикрываться от дождя металлическими предметами (ведром, тазом и др.).",
                "купаться во время грозы.",
              ]}
            />,
            <Select
              quiz="Гололёд и гололедица на улицах и дорогах зимой часто являются причиной травм пешеходов.
                Какие меры предосторожности следует предпринять, чтобы снизить отрицательные
                последствия гололёда и гололедицы? Выбери верный вариант в каждом пункте."
              newquiz1="Чтобы снизить вероятность падения и получения травмы во время передвижения по улице, нужно:"
              ans={[
                { q: "надевать малоскользящую обувь с удобной подошвой", id: 0, a: true },
                { q: "надевать коньки", id: 1, a: false },
                { q: "надевать обувь на каблуке", id: 2, a: false },
                { q: "наступать на каблук обуви и не сгибать ноги в коленях", id: 3, a: false },
                { q: "наступать на всю подошву и слегка расслабить ноги в коленях", id: 4, a: true },
                { q: "передвигаться на носочках, спрятав руки в карманы", id: 5, a: false },
                { q: "передвигаться осторожно, небольшими шажками", id: 6, a: true },
                { q: "передвигаться быстро и уверенно", id: 7, a: false },
              ]}
              addCl={"fw-bold text-white bg-primary"}
            />,
            <Select
              quiz={
                "Как можно подготовить обувь для передвижения в гололёд, чтобы она не скользила? Удали неправильный ответ."
              }
              img={i1_9_3}
              ans={[
                { q: "наклеить крест-накрест лейкопластырь на сухую подошву и каблук", id: 0, a: false },
                { q: "выставить обувь на улицу на ночь", id: 1, a: true },
                { q: "перед выходом на улицу натереть подошву наждачной бумагой", id: 2, a: false },
                { q: "выйдя на улицу, наступить обувью в песок", id: 3, a: false }
              ]}
              addCl={"fw-bold text-white"}
              imgsize={"40%"}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Нет", "Да", "Нет", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Вспомни, как правильно действовать, если ты поскользнулся.
        Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и прямоугольник
        со словом «нет» – если неверное."
              ans={[
                "Если ты поскользнулся, сразу присядь, чтобы снизить высоту падения.",
                "Если ты поскользнулся, постарайся выпрямиться, чтобы упасть на спину.",
                "В момент падения старайся удержать сумку или вещи, которые у тебя в руках.",
                "В момент падения постарайся сгруппироваться, и, перекатившись, смягчить удар о землю.",
                "Постарайся как можно быстрее подняться после падения.",
                "После падения не торопись быстро подниматься, пошевели руками и ногами, убедись, что нигде не чувствуешь боли, только тогда аккуратно попробуй встать.",
              ]}
            />,
            <ColorPic
              ans={
                "Какие правила следует соблюдать, если на улице метель или пурга? Выдели правильные ответы синим цветом, неправильные – красным."
              }
              dec={"Цвет на палитре выбирай нажатием левой клавиши мыши; чтобы выделить ответ, щёлкни на нём левой клавишей мыши."}
              arr={[
                "Нельзя выходить из дома во время пурги. Плотно закрыть окна и двери.",
                "Если сильная метель застала в дороге, нужно спрятаться в овраге или яме.",
                "Находясь на улице во время метели, нельзя передвигаться, нужно стоять на одном месте.",
                "Если сильная метель или пурга застала в дороге, нужно зайт и в первый попавшийся дом и попроситься ос таться в нём до её окончания.",
              ]}
              trueans={["#32adf0", "#f74f5a", "#f74f5a", "#32adf0"]}
            />,
            <Emphas
              quiz="Выполни задания. Выберите правильные ответы."
              ans={[
                {
                  q: "Как называются учёные, которые ведут наблюдения за погодой и на основе этих наблюдений составляют прогнозы погоды?",
                  arr: ["метеорологи", "экологи", "зоологи", "психологи"],
                },
                {
                  q: `Народная примета, которая предсказывает дождь.`,
                  arr: ["Шишки хвойных деревьев раскрываются", "Вечером громко стрекочут кузнечики", "Низко летают ласточки"],
                },
                {
                  q: `Народная примета, которая предсказывает ясную погоду.`,
                  arr: ["Днём закрылись соцветия одуванчиков", "Воробьи купаются в песке", "Вечером громко стрекочут кузнечики"],
                }
              ]}
              trueans={[0, 2, 2]}
              ansImg={false}
            />,
            <Rebus
              img={i1_9_4}
              img2={i1_9_5}
              quiz="Найди и запиши слово, пропущенное в латинской пословице."
              quiz2="________ чувствовать себя безопасно в опасности."
              des="Чтобы найти слово, пройди по указанному маршруту. Начало движения –
            клеточка с совой."
              trueans={"ОПАСНО"}
            />,
          ],
        },
        {
          title: "Тема №10. Стихийные бедствия и безопасность человека.",
          quests: [
            <Emphas
              quiz="Определи, какое природное явление изображено на каждой картинке."
              ans={[
                {
                  q: i1_10_1,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_2,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_3,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_4,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                }
              ]}
              trueans={[1, 2, 3, 0]}
              ansImg={true}
            />,
            <Select
              quiz={
                "Прочитай. О каком природном явлении говорится в описании? Выдели правильный ответ."
              }
              quiz3="Это опасное явление природы может быть вызвано продолжительными ливнями, быстрым
            таянием снега, а в прибрежных районах – сильным ветром, воздействующим на водную
            поверхность, а также некоторыми другими причинами."

              ans={[
                { q: "землетрясение", id: 0, a: false },
                { q: "наводнение", id: 1, a: true },
                { q: "извержение вулкана", id: 2, a: false },
                { q: "засуха", id: 3, a: false }
              ]}
              addCl={"fw-bold text-white bg-success"}
            />,
            <Rebus
              img={i1_10_6}
              img2={i1_10_5}
              quiz="Разгадай ребус."
              des="Запиши, как называется природное явление, которое изобразил на своём
          рисунке мальчик."
              trueans={"ЦУНАМИ"}
            />,
            <Select
              quiz={
                "Ответь на вопрос Дум Думыча."
              }
              img={i1_10_7}

              ans={[
                { q: "Ветер разрушительной силы, скорость которого больше, чем у мчащегося по улице автомобиля.", id: 0, a: true },
                { q: "Это масса снега, падающая или соскальзывающая с крутых горных склонов и движущаяся с большой скоростью.", id: 1, a: false },
                { q: "Бурный грязе-каменный поток, возникающий в горах во время сильных дождей или таяния снегов.", id: 2, a: false },
              ]}
              addCl={"fw-bold text-success"}
            />,
            <ColorPic
              ans={
                "Выдели верные утверждения зелёным цветом, неверные – красным."
              }
              dec="Цвета на палитре выбирай нажатием левой клавиши мыши; чтобы выделить утверждение,
          щёлкни на нём левой клавишей мыши."
              arr={[
                "Снежные лавины образуются в горах после сильных снегопадов.",
                "Ураган может переворачивать машины на дорогах, вырывать с корнями деревья, срывать крыши домов, а иногда и разрушать здания.",
                "Извержение вулкана не несёт большой опасности для людей.",
                "Причиной большинства цунами являются землетрясения, которые происходят в океане, под водой.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#18d945", "#f74f5a"]}
            />,
            <Emphas
              quiz="Выбери правильные ответы."
              ans={[
                {
                  q: "Как называется предупредительный сигнал оповещения населения в случае стихийных бедствий?",
                  arr: ["Внимание всем!", "Тревога!", "Опасность!"],
                },
                {
                  q: "Как доводится до населения этот сигнал?",
                  arr: ["способом включения сирен", "рассылается по электронной почте", "с помощью телефонных звонков на мобильные телефоны"],
                },
                {
                  q: "Что должны сделать люди, услышав этот сигнал?",
                  arr: ["включить радио или телевизор и прослушать экстренное сообщение", "покинуть помещение и укрыться в подвалах или подземных переходах", "прибыть на железнодорожный вокзал или автовокзал"],
                },
              ]}
              trueans={[0, 0, 0]}
            />,
            <Imgdrop
              quiz={"Найди нужный заголовок к каждому набору действий и перенеси его в прямоугольник."}
              ans={[
                "Закрыть двери, окна и ставни. Выключить газ и электричество. Перенести на верхние этажи (чердаки) зданий ценные вещи и имущество. Подняться на верхний этаж здания или крышу.",
                "Закрыть двери, окна и ставни. Выключить газ и электричество. Погасить огонь в печи или камине. Собрав необходимые вещи и документы, спуститься в укрытие (подвал).",
              ]}
              ansImg={false}
              col={3}
              arr={[
                [],
                [],
                [{ id: "1", content: "Действия в случае внезапного затопления" }],
                [{ id: "2", content: "Действия в случае урагана или смерча" }],
              ]}
              arrImg={false}
              trueans={["1", "0"]}
              h={"20vw"}
            />,
            <Select
              quiz="Какие предметы необходимо взять с собой, если поступило сообщение о начале эвакуации? Выбери всё необходимое из предложенного списка."

              img={i1_10_8}

              ans={[
                { q: "документы", id: 0, a: true },
                { q: "лекарства", id: 1, a: true },
                { q: "ролики", id: 2, a: false },
                { q: "запас продуктов", id: 3, a: true },
                { q: "учебники", id: 4, a: false },
                { q: "запасы воды", id: 5, a: true },
                { q: "любимые игрушки", id: 6, a: false },
                { q: "ценности", id: 7, a: true },
                { q: "тёплые вещи", id: 8, a: true },
                { q: "телевизор", id: 9, a: false },
              ]}
              addCl={"fw-bold text-white bg-info"}
              imgsize="40%"
            />,
            <Select
              quiz="Где можно спрятаться, если ураган застал тебя на открытой местности? Закрась правильные ответы."

              ans={[
                { q: "на дне оврага", id: 0, a: true },
                { q: "за деревом", id: 1, a: false },
                { q: "в автомобиле", id: 2, a: false },
                { q: "на возвышенном месте", id: 3, a: false },
                { q: "в придорожной канаве", id: 4, a: true },
                { q: "на мосту", id: 5, a: false },
              ]}
              addCl={"fw-bold text-white bg-warning"}
            />,
            <Select
              quiz="Что будет представлять наибольшую опасность для жизни, если ты выйдешь на
            улицу сразу после стихийного бедствия?"

              img={i1_10_9}

              ans={[
                { q: "грязь и кучи мусора", id: 0, a: false },
                { q: "оборванные электропровода", id: 1, a: true },
                { q: "стоящие на обочине дороги машины", id: 2, a: false },
                { q: "поваленные деревья", id: 3, a: false },
                { q: "нависающие на зданиях части предметов", id: 4, a: true },
              ]}
              addCl={"fw-bold text-white bg-danger"}
              imgsize="20%"
            />,
          ],
        },
        {
          title: "Тема №11. Правила безопасности летом на водоёмах.",
          quests: [
          //   <Select
          //   quiz="Зачеркни неверные утверждения."
          //   ans={[
          //     { q: "Летом на водоёмах нужно обязательно соблюдать правила безопасного поведения.", id: 0, a: false },
          //     { q: "Тот, кто хорошо умеет плавать, не может утонуть.", id: 1, a: true },
          //     { q: "Дети должны купаться строго под присмотром взрослых.", id: 2, a: false },
          //     { q: "Если ты пошёл купаться с друзьями, то тебе не грозит беда, потому что друзья всегда смогут спасти тебя.", id: 3, a: true },
          //   ]}
          //   addCl={"fw-bold perek"}
          // />,
        //   <ImagePic
        //   imgArr={[i1_11_1, i1_11_2, i1_11_3]}
        //   trueans={[1]}
        //   quiz="2 Кто из ребят прав?"
        // />,
        <Subsequence
        img={i1_11_10}
        trueans={["1", "3", "4", "2"]}
        arrans={["", "", "", ""]}
        quiz="Установи соответствие между рисунками и правилами поведения на воде. Напечатай возле каждого
        правила подходящую цифру."
        ans={[
          "Нельзя подплывать к движущимся судам, лодкам, катерам, катамаранам, гидроциклам.",
          "Нельзя нырять и долго находиться под водой.",
          "Нельзя в воде хватать друг друга за руки или ноги.",
          "Нельзя подавать сигналы ложной тревоги.",
        ]}
        col={[11, 11, 8, 4]}
      />,
      //   <ImagePic
      //   imgArr={[i1_11_4, i1_11_5, i1_11_6, i1_11_7, i1_11_8, i1_11_9]}
      //   trueans={[3]}
      //   quiz="Какой знак устанавливают в тех местах, где купание запрещено?"
      // />,

          ],
        },
        {
          title: "Тема №12",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №13",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №14",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №15",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №16",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №17",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №18",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №19",
          quests: [<Quest1 />, <Quest2 />],
        },
        {
          title: "Тема №20",
          quests: [<Quest1 />, <Quest2 />],
        },
      ],
    },
    {
      title: "Второй раздел: Здоровье",
      bg: background2,
      class: [
        {
          title: "Тема №1. Основы ЗОЖ",
          quests: [
            <ImagePic
              imgArr={[img2_1_1, img2_1_2, img2_1_3, img2_1_4]}
              trueans={[0]}
              multi={false}
              quiz="Говорят, что организм здорового человека работает как ...
                Какое слово пропущено? Отметь подходящую картинку (нажми на неё)."
            />,
            <Arrow
              quiz="Здоровье человека состоит из физического, психического, социального и духовного
            здоровья. Сопоставь каждое описание. (зажми левой клавишей мыши описание и перетяни его так, что бы описание было напротив правильно ответа."
              ans={[
                "Физическое здоровье",
                "Психическое здоровье",
                "Социальное здоровье",
                "Духовное здоровье",
              ]}
              description={[
                "Человек умеет управлять своим поведением,контролирует свои чувства и эмоции, спокоен",
                "У человека нормальная температура тела, крепкий сон, хороший аппетит, ничего не болит",
                "Человек способен сочувствовать, сопереживать, оказывать помощь другим людям, делать им добро бескорыстно",
                "Человек доброжелателен, умеет правильно выстраивать отношения с родными, друзьями, учителями, уважительно относится к людям",
              ]}
              trueans={[
                "У человека нормальная температура тела, крепкий сон, хороший аппетит, ничего не болит",
                "Человек умеет управлять своим поведением,контролирует свои чувства и эмоции, спокоен",
                "Человек доброжелателен, умеет правильно выстраивать отношения с родными, друзьями, учителями, уважительно относится к людям",
                "Человек способен сочувствовать, сопереживать, оказывать помощь другим людям, делать им добро бескорыстно",
              ]}
            />,
            <Emphas
              quiz="Выдели слова, которые пропущены в этих пословицах.
              (кликни левой клавишей мыши по нужными словам)"
              ans={[
                {
                  q: "___ лучше всякого лекарства.",
                  arr: ["Торт", "Сон", "Плаванье", "Газировка"],
                },
                {
                  q: "Если хочешь быть здоров – ___.",
                  arr: ["Одевайся", "Не ленись", "Закаляйся", "Убирайся"],
                },
                {
                  q: "___ залог здоровья.",
                  arr: ["Чистота", "Аппетит", "Чтение", "Учёба"],
                },
              ]}
              trueans={[1, 2, 0]}
              ansImg={false}
            />,
            <Dropword />,
            <ColorPic
              ans={
                "Если утверждение верное, закрасьте ячейку таблицы с ответом зелёным цветом, если неверное – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Режим дня – это правильное распределение времени на сон, питание,работу и отдых.",
                "Обязательно нужно мыть руки по приходу домой, до и после еды, после туалета.",
                "Врач-офтальмолог занимается лечение зубов.",
                "Длительность просмотра телевизора не должна превышать 4 часов подряд.",
                "Делать прививки нужно строго по рекомендациям: между первой и последующими прививками должно пройти определенное время в зависимости от вида прививки.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#f74f5a", "#18d945"]}
            />,
            <Arrow
              quiz="Найди к каждому описанию свою пословицу. (зажми левой клавишей мыши описание и перетяни его так, что бы описание было напротив правильно ответа."
              description={[
                "Пищу надо пережёвывать тщательно, чтобы желудку легче было её переварить, и она быстрее усвоится.",
                "Так могут говорить о сильном и здоровом человеке.",
                "Социальное здоровье",
              ]}
              ans={[
                "На нём хоть воду вози",
                "Быстрого да ловкого болезнь не догонит",
                "Кто долго жуёт, тот долго живёт",
              ]}
              trueans={[
                "Так могут говорить о сильном и здоровом человеке.",
                "Социальное здоровье",
                "Пищу надо пережёвывать тщательно, чтобы желудку легче было её переварить, и она быстрее усвоится.",
              ]}
            />,
            <Rebus
              img={rebus1}
              quiz="Разгадай ребус и запиши, как называется процесс введения людям вакцин, препаратов, которые помогают сформировать иммунитет против многих инфекционных заболеваний."
              trueans={"ВАКЦИНАЦИЯ"}
            />,
            <Imgdrop
              quiz={"Перенеси в каждый прямоугольник под описанием нужную картинку.(зажимай картинку левой клавишей мыши и перетаскивай в нужное место)"}
              ans={[
                "Ромашку применяют как успокаивающее, противоспалительное средство. Отваром ромашки полощут горло, например.",
                "Листья подорожника используют для заживления ран, порезов; а также – при укусах пчёл, ос и даже змей.",
                "Иван-чай (кипрей) заваривают как чай. Используют при многих заболеваниях, а также как успокоительное средство."
              ]}
              ansImg={false}
              col={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: img_1 }],
                [{ id: "2", content: img2 }],
                [{ id: "3", content: img3 }],
              ]}
              arrImg={true}
              trueans={["2", "3", "1"]}
              h={"20vw"}
            />,
            <Select
              quiz={
                "Что в себя включает понятие «Здоровый образ жизни»? Отметь это (нажми)."
              }
              img={docter21}
              ans={[
                { q: "Хорошее настроение", cl: "text-dark" },
                { q: "Соблюдение режима дня", cl: "text-dark" },
                { q: "Дружба с вредными привычками", cl: "text-dark" },
                { q: "Личная гигиена", cl: "text-dark" },
                { q: "Свежий воздух", cl: "text-dark" },
                { q: "Правильное питание", cl: "text-dark" },
                { q: "Подвижный образ жизни", cl: "text-dark" },
                { q: "Отказ от занятия спортом", cl: "text-dark" },
                { q: "Здоровый сон", cl: "text-dark" },
              ]}
              trueans={[true, true, false, true, true, true, true, false, true]}
              addCl={"fw-bold text-success"}
            />,
            <Select
              quiz={
                "Хорошие дружеские отношения помогают сохранять здоровье. Если ты кого-то обидел, надо обязательно попросить прощение. А если обидели тебя, надо уметь прощать. На чём же строятся дружеские отношения? Зачеркни лишнее (нажми на это)."
              }
              img={frends21}
              ans={[
                { q: "Доверие", cl: "text-dark" },
                { q: "Уважение", cl: "text-dark" },
                { q: "Конфликты", cl: "text-dark" },
                { q: "Драки", cl: "text-dark" },
                { q: "Искренность", cl: "text-dark" },
                { q: "Взаимопонимание", cl: "text-dark" },
              ]}
              trueans={[false, false, true, true, false, false]}
              addCl={"fw-bold perek"}
            />,
          ],
        },
        {
          title: "Тема №2. Гигиена тула и рук человека",
          quests: [
            <ColorPic
              ans={
                "Если утверждение верное, закрасьте ячейку таблицы с ответом зелёным цветом, если неверное – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Необходимо стричь ногти по мере их отрастания.",
                "Умываться и принимать душ надо ежедневно.",
                "Менять нижнее бельё можно через день.",
                "Мыть руки перед едой надо обязательно.",
                "Полоскать рот и чистить зубы надо каждый раз после еды.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#18d945", "#f74f5a"]}
            />,
            <Dropword22 />,
            <Select
              quiz={
                "Подумай, какие три слова описывают понятие «опрятный человек». (нажми один раз левой клавиши мыши на слово)"
              }
              img={select2}
              ans={[
                { q: "Глупый", cl: "text-dark" },
                { q: "Чистый", cl: "text-dark" },
                { q: "Грязный", cl: "text-dark" },
                { q: "Грустный", cl: "text-dark" },
                { q: "Аккуратный", cl: "text-dark" },
                { q: "Веселый", cl: "text-dark" },
                { q: "Дурно пахнущий", cl: "text-dark" },
                { q: "Чистоплотный", cl: "text-dark" },
              ]}
              trueans={[false, true, false, false, true, false, false, true]}
              addCl={"fw-bold text-success"}
            />,
            <ImagePic
              imgArr={[i1, i2, i3, i4, i5, i6, i7]}
              trueans={[0, 2, 3, 5, 6]}
              quiz="Что относится к предметам личной гигиены? Отметь нужные картинки (нажми на них)."
            />,
            <Select
              quiz={
                "Отметь ситуации, при которых нужно обязательно мыть руки. (нажми один раз левой клавиши мыши на вариант)"
              }
              img={select3}
              ans={[
                { q: "После посещения туалета", cl: "text-dark" },
                { q: "Перед принятием пищи", cl: "text-dark" },
                { q: "После чтения книги", cl: "text-dark" },
                { q: "После просмотра фильма", cl: "text-dark" },
                { q: "После разговора по телефону", cl: "text-dark" },
                { q: "После посещения общественных мест", cl: "text-dark" },
                { q: "Перед обработкой ран, порезов на коже", cl: "text-dark" },
                { q: "После возвращения домой с улицы", cl: "text-dark" },
                { q: "После ухода за больным членом семья", cl: "text-dark" },
              ]}
              trueans={[
                true,
                true,
                false,
                false,
                false,
                true,
                true,
                true,
                true,
              ]}
              addCl={"fw-bold text-success"}
            />,
            <Select
              quiz={
                "ДИЗЕНТЕРИЯ – болезнь грязных рук. Признаки: повышение температуры, боль в животе, рвота, жидкий стул... Чтобы этого избежать, необходимо соблюдать правила личной гигиены. Ну а что же надо делать при признаках заболевания? (нажми один раз левой клавиши мыши на предложение)"
              }
              img={select4}
              ans={[
                { q: "Принять какие-нибудь лекарства", cl: "text-dark" },
                { q: "Больше пить воды и лежать", cl: "text-dark" },
                { q: "Обратиться к врачу", cl: "text-dark" },
                { q: "Обратиться к врачу", cl: "text-dark" },
              ]}
              trueans={[false, false, true, false]}
              addCl={"fw-bold text-success"}
            />,
            <Select
              quiz={
                "Глядя на рисунок, повтори, как правильно мыть руки. Ниже прочти правила. Удали неверное правило. (нажми один раз левой клавиши мыши на предложение)"
              }
              img={select5}
              ans={[
                {
                  q: "Руки надо мыть тёплой, а не холодной или горячей водой",
                  cl: "text-dark",
                },
                {
                  q: "Нужно хорошо намыливать руки – с обеих сторон",
                  cl: "text-dark",
                },
                {
                  q: "Необходимо хорошо тереть руки друг о друга, уделяя внимание запястьям, пальцам, коже между пальцами и ногтям",
                  cl: "text-dark",
                },
                { q: "Мыло можно до конца не смывать", cl: "text-dark" },
                { q: "Руки надо мыть не менее 15 секунд", cl: "text-dark" },
              ]}
              trueans={[false, false, false, true, false]}
              addCl={"text-white"}
            />,
            <SelectedWord
              quiz={"Определи, какие пропущены слова в правилах профилактики «болезней грязных рук». Выбери пропущенные слова из выпадающего списка."}
              arrText={["Руки необходимо мыть обязательно после посещения ",
                ", по приходу с улицы и перед едой.  Мыть руки необходимо с",
                ", тщательно тереть друг о друга.  Нельзя покупать продукты питания на ",
                "«с рук». Покупать продукты питания надо только у продавца в ",
                " халате (фартуке), в специальном головном ",
                ", нарукавниках. Нельзя грызть",
                "и брать в рот ручки и карандаши."

              ]}
              arrWord={[["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"]]}
              trueAns={["3", "4", "0", "1", "5", "2"]}
            />,
            <ColorWord />,
            <ColorPic
              ans={
                "Если поступок хороший, закрасьте ячейку таблицы зелёным цветом, если плохой – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Чистить зубы утром и вечером",
                "Умываться каждый день утром и вечером",
                "Не следить за чистотой одежды.",
                "Регулярно мыть голову и принимать душ.",
                "Регулярно подстригать ногти.",
                "Еженедельно менять нижнее бельё.",
                "Пользоваться чужими мочалкой, зубной щёткой, полотенцем.",
              ]}
              trueans={[
                "#18d945",
                "#18d945",
                "#f74f5a",
                "#18d945",
                "#18d945",
                "#f74f5a",
                "#f74f5a",
              ]}
            />,
          ],
        }
      ],
    },
    {
      title: "Третий раздел: Культура поведения",
      bg: background2,
      class: [],
    },
  ],
};

export const DATA = [Zog_book];
