import { Arrow } from "./quest/Arrow";
import { Emphas } from "./quest/Emphas";
import { Dropword } from "./quest/Dropword";
import img1 from "./file/obh.png";
import { ImagePic } from "./quest/ImagePic";
import { ColorPic } from "./quest/ColorPic";
import img2_1_1 from "./file/2_1/1.png";
import img2_1_2 from "./file/2_1/2.png";
import img2_1_3 from "./file/2_1/3.png";
import img2_1_4 from "./file/2_1/4.png";
import rebus1 from "./file/2_1/rebus1.png";
import { Rebus } from "./quest/Rebus";
import { Imgdrop } from "./quest/Imgdrop";
import { Select } from "./quest/Select";
import docter21 from "./file/2_1/docter.png";
import frends21 from "./file/2_1/frends.png";
import background2 from "./file/2_1/background2.png";
import background1 from "./file/1_1/bg1.png";
import { DropwordList } from "./quest/DropwordList";
import select2 from "./file/2_2/2.png";
import i1 from "./file/2_2/i1.png";
import i2 from "./file/2_2/i2.png";
import i3 from "./file/2_2/i3.png";
import i4 from "./file/2_2/i4.png";
import i5 from "./file/2_2/i5.png";
import i6 from "./file/2_2/i6.png";
import i7 from "./file/2_2/i7.png";
import select3 from "./file/2_2/3.png";
import select4 from "./file/2_2/4.png";
import select5 from "./file/2_2/5.jpg";
import { SelectedWord } from "./quest/SelectedWord";
import { ColorWord } from "./quest/ColorWord";
import { Subsequence } from "./quest/Subsequence";
import select_1_1_1 from "./file/1_1/1.png";
import select_1_1_2 from "./file/1_1/9.png";
import select_1_1_13 from "./file/1_1/13.png";
import select_1_1_14 from "./file/1_1/14.png";
import sub_1_1_1 from "./file/1_1/11.png";
import mouse from "./file/mouse.png";
import sub_1_1_8 from "./file/1_1/1_1_12.png";
import { PickTrue } from "./quest/PickTrue";
import img_1 from "./file/2_1/imgd1.png";
import img2 from "./file/2_1/imgd2.png";
import img3 from "./file/2_1/imgd3.png";
import imgdrop1_2_1 from "./file/1_2/1.png";
import imgdrop1_2_2 from "./file/1_2/2.png";
import imgdrop1_2_3 from "./file/1_2/3.png";
import s1_2_4 from "./file/1_2/4.jpg";
import ip1_2_5 from "./file/1_2/5.jpg";
import ip1_2_6 from "./file/1_2/6.jpg";
import ip1_2_7 from "./file/1_2/7.jpg";
import ip1_2_8 from "./file/1_2/8.jpg";
import ip1_2_10 from "./file/1_2/10.png";
import ip1_2_11 from "./file/1_2/11.png";
import ip1_2_12 from "./file/1_2/12.png";
import ip1_2_13 from "./file/1_2/13.png";
import ip1_3_2_1 from "./file/1_3/2_1.png";
import ip1_3_2_2 from "./file/1_3/2_2.png";
import ip1_3_2_3 from "./file/1_3/2_3.png";
import ip1_3_3_1 from "./file/1_3/3_1.png";
import ip1_3_3_2 from "./file/1_3/3_2.png";
import ip1_3_3_3 from "./file/1_3/3_3.png";
import ip1_3_3_4 from "./file/1_3/3_4.png";
import ip1_3_4_1 from "./file/1_3/4_1.png";
import ip1_3_4_2 from "./file/1_3/4_2.png";
import ip1_3_4_3 from "./file/1_3/4_3.png";
import ip1_3_4_4 from "./file/1_3/4_4.png";
import ip1_3_4_5 from "./file/1_3/4_5.png";
import ip1_3_4_6 from "./file/1_3/4_6.png";
import ip1_3_5_1 from "./file/1_3/5_1.png";
import ip1_3_7_4 from "./file/1_3/7_4.png";
import ip1_3_8_1 from "./file/1_3/8_1.png";
import ip1_3_8_2 from "./file/1_3/8_2.png";
import ip1_3_8_4 from "./file/1_3/8_4.png";
import ip1_3_8_5 from "./file/1_3/8_5.png";
import ip1_3_9_1 from "./file/1_3/9_1.png";
import ip1_3_9_2 from "./file/1_3/9_2.png";
import ip1_3_9_3 from "./file/1_3/9_3.png";
import ip1_3_10_1 from "./file/1_3/10_1.png";
import i1_4_1 from "./file/1_4/1.png";
import i1_4_2 from "./file/1_4/2.png";
import i1_4_3 from "./file/1_4/3.png";
import i1_4_4 from "./file/1_4/4.png";
import i1_4_6 from "./file/1_4/6.png";
import i1_4_7 from "./file/1_4/7.png";
import i1_4_8 from "./file/1_4/8.png";
import i1_4_9 from "./file/1_4/9.png";
import i1_4_10 from "./file/1_4/10.png";
import i1_4_11 from "./file/1_4/11.png";
import i1_4_12 from "./file/1_4/12.png";
import i1_4_13 from "./file/1_4/13.png";
import i1_4_14 from "./file/1_4/14.jpg";
import i1_4_15 from "./file/1_4/15.jpg";
import i1_4_16 from "./file/1_4/16.png";
import i1_4_20 from "./file/1_4/20.png";
import i1_4_21 from "./file/1_4/21.png";
import i1_7_1 from "./file/1_7/1.png";
import i1_7_2 from "./file/1_7/2.png";
import i1_7_3 from "./file/1_7/3.png";
import i1_7_4 from "./file/1_7/4.png";
import i1_7_5 from "./file/1_7/5.png";
import i1_7_6 from "./file/1_7/6.png";
import i1_7_7 from "./file/1_7/7.png";
import i1_7_8 from "./file/1_7/8.png";
import i1_7_9 from "./file/1_7/9.png";
import i1_7_15 from "./file/1_7/15.jpg";
import i1_7_17 from "./file/1_7/17.png";
import i1_5_1 from "./file/1_5/1.png";
import i1_5_2 from "./file/1_5/2.png";
import i1_5_3 from "./file/1_5/3.png";
import i1_5_4 from "./file/1_5/4.png";
import i1_5_7 from "./file/1_5/7.png";
import i1_5_8 from "./file/1_5/8.png";
import i1_5_9 from "./file/1_5/9.png";
import i1_5_10 from "./file/1_5/10.png";
import i1_5_11 from "./file/1_5/11.png";
import i1_5_12 from "./file/1_5/12.png";
import i1_6_1 from "./file/1_6/01.png";
import i1_6_2 from "./file/1_6/02.png";
import i1_6_3 from "./file/1_6/03.jpg";
import i1_6_4 from "./file/1_6/04.png";
import i1_6_5 from "./file/1_6/05.png";
import i1_6_6 from "./file/1_6/06.jpg";
import i1_6_7 from "./file/1_6/07.jpg";
import i1_6_8 from "./file/1_6/08.jpg";
import i1_6_9 from "./file/1_6/09.jpg";
import i1_6_10 from "./file/1_6/10.jpg";
import i1_6_14 from "./file/1_6/14.png";
import i1_6_15 from "./file/1_6/15.png";
import i1_6_16 from "./file/1_6/16.jpg";
import i1_6_17 from "./file/1_6/17.png";
import i1_6_18 from "./file/1_6/18.png";
import i1_8_1 from "./file/1_8/1.png";
import i1_8_2 from "./file/1_8/2.png";
import i1_8_3 from "./file/1_8/3.png";
import i1_8_4 from "./file/1_8/4.png";
import i1_8_5 from "./file/1_8/5.jpg";
import i1_8_6 from "./file/1_8/6.png";
import i1_8_7 from "./file/1_8/7.png";
import i1_9_1 from "./file/1_9/01.jpg";
import i1_9_2 from "./file/1_9/02.png";
import i1_9_3 from "./file/1_9/03.png";
import i1_9_4 from "./file/1_9/04.png";
import i1_9_5 from "./file/1_9/05.png";
import i1_10_1 from "./file/1_10/01.jpg";
import i1_10_2 from "./file/1_10/02.jpg";
import i1_10_3 from "./file/1_10/03.jpg";
import i1_10_4 from "./file/1_10/04.jpg";
import i1_10_5 from "./file/1_10/05.png";
import i1_10_6 from "./file/1_10/06.png";
import i1_10_7 from "./file/1_10/07.png";
import i1_10_8 from "./file/1_10/08.png";
import i1_10_9 from "./file/1_10/09.png";
import i1_11_1 from "./file/1_11/1.png";
import i1_11_2 from "./file/1_11/2.png";
import i1_11_3 from "./file/1_11/3.png";
import i1_11_4 from "./file/1_11/4.png";
import i1_11_5 from "./file/1_11/5.png";
import i1_11_6 from "./file/1_11/6.png";
import i1_11_7 from "./file/1_11/7.png";
import i1_11_8 from "./file/1_11/8.png";
import i1_11_9 from "./file/1_11/9.png";
import i1_11_10 from "./file/1_11/10.png";
import i1_11_14 from "./file/1_11/14.png";
import i1_11_15 from "./file/1_11/15.png";
import i1_11_16 from "./file/1_11/16.png";
import i1_11_17 from "./file/1_11/17.jpg";
import i1_11_18 from "./file/1_11/18.jpg";
import i1_11_19 from "./file/1_11/19.jpg";
import i1_11_20 from "./file/1_11/20.png";
import i1_12_1 from "./file/1_12/1.jpg";
import i1_12_2 from "./file/1_12/2.png";
import i1_12_3 from "./file/1_12/3.png";
import i1_12_4 from "./file/1_12/4.png";
import i1_12_5 from "./file/1_12/5.jpg";
import i1_12_6 from "./file/1_12/6.png";
import i1_12_7 from "./file/1_12/7.png";
import i1_12_8 from "./file/1_12/8.png";
import i1_12_9 from "./file/1_12/9.jpg";
import i1_12_10 from "./file/1_12/10.jpg";
import i1_12_11 from "./file/1_12/11.png";
import i1_12_12 from "./file/1_12/12.png";
import i1_12_13 from "./file/1_12/13.jpg";
import i1_13_1 from "./file/1_13/1.jpg";
import i1_13_2 from "./file/1_13/2.jpg";
import i1_13_3 from "./file/1_13/3.jpg";
import i1_13_4 from "./file/1_13/4.png";
import i1_13_5 from "./file/1_13/5.jpg";
import i1_13_6 from "./file/1_13/6.jpg";
import i1_13_7 from "./file/1_13/7.jpg";
import i1_13_8 from "./file/1_13/8.jpg";
import i1_13_9 from "./file/1_13/9.jpg";
import i1_13_10 from "./file/1_13/10.jpg";
import i1_13_11 from "./file/1_13/11.png";
import i1_13_12 from "./file/1_13/12.jpg";
import i1_13_13 from "./file/1_13/13.jpg";
import i1_13_14 from "./file/1_13/14.jpg";
import i1_13_15 from "./file/1_13/15.jpg";
import i1_13_16 from "./file/1_13/16.jpg";
import i1_13_17 from "./file/1_13/17.jpg";
import i1_14_1 from "./file/1_14/1.png";
import i1_14_2 from "./file/1_14/2.png";
import i1_14_3 from "./file/1_14/3.png";
import i1_14_4 from "./file/1_14/4.png";
import i1_14_5 from "./file/1_14/5.png";
import i1_14_6 from "./file/1_14/6.png";
import i1_14_7 from "./file/1_14/7.png";
import i1_14_8 from "./file/1_14/8.png";
import i1_14_9 from "./file/1_14/9.png";
import i1_14_10 from "./file/1_14/10.png";
import i1_14_11 from "./file/1_14/11.jpg";
import i1_14_12 from "./file/1_14/12.png";
import i1_15_1 from "./file/1_15/1.png";
import i1_15_2 from "./file/1_15/2.png";
import i1_15_3 from "./file/1_15/3.png";
import i1_15_4 from "./file/1_15/4.png";
import i1_15_5 from "./file/1_15/5.png";
import i1_16_1 from "./file/1_16/1.png";
import i1_16_2 from "./file/1_16/2.png";
import i1_16_3 from "./file/1_16/3.png";
import i1_16_4 from "./file/1_16/4.png";
import i1_16_5 from "./file/1_16/5.png";
import i1_16_6 from "./file/1_16/6.png";
import i1_16_7 from "./file/1_16/7.png";
import i1_16_8 from "./file/1_16/8.png";
import i1_16_9 from "./file/1_16/9.jpg";
import i1_16_10 from "./file/1_16/10.jpg";
import i1_16_11 from "./file/1_16/11.png";
import i1_16_12 from "./file/1_16/12.png";
import i1_16_13 from "./file/1_16/13.png";
import i1_16_14 from "./file/1_16/14.png";
import i1_16_15 from "./file/1_16/15.png";
import i1_16_16 from "./file/1_16/16.png";
import i1_16_18 from "./file/1_16/18.png";
import i1_16_19 from "./file/1_16/19.png";
import i1_16_20 from "./file/1_16/20.png";
import i1_17_1 from "./file/1_17/1.png";
import i1_17_2 from "./file/1_17/2.jpg";
import i1_17_3 from "./file/1_17/3.png";
import i1_17_4 from "./file/1_17/4.jpg";
import i1_17_5 from "./file/1_17/5.png";
import i1_17_6 from "./file/1_17/6.png";
import i1_18_1 from "./file/1_18/1.png";
import i1_18_2 from "./file/1_18/2.png";
import i1_19_1 from "./file/1_19/1.png";
import i1_19_2 from "./file/1_19/2.png";
import i1_19_3 from "./file/1_19/3.png";
import i1_19_4 from "./file/1_19/4.jpg";
import i1_19_5 from "./file/1_19/5.jpg";
import i1_20_1 from "./file/1_20/1.png";
import i1_20_2 from "./file/1_20/2.png";
import i1_20_3 from "./file/1_20/3.png";
import i1_20_4 from "./file/1_20/4.png";
import i1_20_5 from "./file/1_20/5.png";
import i1_20_6 from "./file/1_20/6.png";
import i1_20_7 from "./file/1_20/7.png";
import i1_20_8 from "./file/1_20/8.png";
import i1_20_9 from "./file/1_20/9.png";







const Zog_book = {
  titleimg: img1,
  id: "1",
  title: "ОБЖ и правила поведения",
  class: null,
  theme: [
    {
      title: "ОБЖ и правила поведения",
      bg: background1,
      class: [
        {
          title: "Тема №1. Ты пешеход",
          quests: [
            <Select
              quiz={
                "Кто такой пешеход? Выбери правильный ответ."
              }
              img={select_1_1_1}
              ans={[
                { q: "Это тот человек, который находится в транспортном средстве, но не является водителем.", id: 0, a: false },
                { q: "Это тот человек, который управляет транспортным средством.", id: 1, a: false },
                { q: "Это человек, который передвигается по дороге пешком.", id: 2, a: true }
              ]}
              addCl={"text-success"}
              imgsize="70%"
            />,
            <Rebus
              quiz="Как называется часть дороги, предназначенная для движения пешеходов?"
              trueans={"ТРОТУАР"}
            />,
            <Select
              quiz={
                "Зачеркни те утверждения, которые неверны."
              }
              img={select_1_1_2}
              ans={[
                { q: "Пешеходы должны передвигаться по тротуарам, придерживаясь правой стороны.", id: 0, a: false },
                { q: "Пешеходы должны передвигаться по тротуарам, придерживаясь левой стороны.", id: 1, a: true },
                { q: "Если тротуаров нет, то нужно идти по обочине дороги по направлению движения транспортных средств.", id: 2, a: true },
                { q: "Если тротуаров нет, то нужно идти по обочине дороги навстречу движущемуся транспорту.", id: 3, a: false }

              ]}
              addCl={"perek"}
              imgsize="50%"
            />,
            <Select
              quiz={
                "В каких правилах поведения пешехода пропущено слово НЕЛЬЗЯ? Оставь только верные ответы, а остальные удали."
              }
              img={mouse}
              ans={[
                { q: "______ переходить проезжую часть на красный сигнал светофора.", id: 0, a: false },
                { q: "______ переходить проезжую часть в установленном месте по пешеходному переходу.", id: 1, a: true },
                { q: "______ перебегать проезжую часть перед движущимся транспортом.", id: 2, a: false },
                { q: "______ переходить перекрёсток по пешеходным переходам.", id: 3, a: true }

              ]}
              addCl={"text-white"}
              imgsize="25%"
            />,
            <Subsequence
              img={sub_1_1_1}
              trueans={["1", "6", "3", "5", "4", "2"]}
              arrans={["1", "", "", "", "", ""]}
              quiz="Укажи правильную последовательность действий при переходе улицы по нерегулируемому пешеходному переходу. Пронумеруй действия пешехода."
              ans={[
                "Подойдите к краю проезжей части.",
                "При отсутствии движущегося транспорта завершите переход дороги.",
                "Затем посмотрите налево.",
                "На середине проезжей части остановитесь и посмотрите направо.",
                "Если нет машин, дойдите до середины проезжей части.",
                "Оцените ситуацию на дороге и убедитесь, что нет приближающегося транспортного средства и движение будет безопасным."
              ]}
              col={[11, 11, 8, 4]}
              imgsize={"50%"}
            />,
            <Select
              quiz={
                "Прочитай задание Дум Думыча, рассмотри рисунок к нему и выбери правильный ответ."
              }
              quiz2={"Ваня находится у нерегулируемого перекрёстка. Ему нужно перейти на другую сторону улицы, где его ждёт Аня. У Вани есть три способа это сделать. Каждый способ обозначен на рисунке стрелками разного цвета. Но какой способ выбрать, чтобы не нарушить правила дорожного движения, мальчик не знает. Помоги Ване сделать правильный выбор. Найди правильный вариант среди перечисленных и подчеркни его."}
              quiz3={"По правилам дорожного движения Ваня может перейти перекрёсток:"}
              img={sub_1_1_8}
              ans={[
                { q: "только так, как указано красными стрелками", id: 0, a: false },
                { q: "только так, как указано синими стрелками", id: 1, a: false },
                { q: "только так, как указано жёлтой стрелкой", id: 2, a: false },
                { q: "так, как указано жёлтой и красными стрелками", id: 3, a: false },
                { q: "так, как указано синими и красными стрелками", id: 4, a: true },
                { q: "так, как указано жёлтой и синими стрелками", id: 5, a: false },
                { q: "любым способом из указанных выше", id: 6, a: false }
              ]}
              trueans={[false, false, false, false, true, false, false]}
              addCl={"podperek"}
              imgsize="60%"
              random={true}
            />,
            <Select
              quiz={
                "Выбери все верные продолжения предложения. Закрась ячейки таблицы, в которых они записаны."
              }
              newquiz1={"Если на улице нет пешеходного перехода, то её переходят …"}

              img={select_1_1_13}
              imgsize={'60%'}
              ans={[
                { q: "под прямым углом к обочине", id: 0, a: true },
                { q: "наискосок", id: 1, a: false },
                { q: "спокойно, не бегом", id: 2, a: true },
                { q: "очень быстро, бегом", id: 3, a: false }
              ]}
              newquiz2={"Если в зоне видимости нет пешеходного перехода или перекрёстка, то перейти проезжую часть можно на участке, где …"}
              ansnew={[
                { q: "нет ограждений", id: 4, a: true },
                { q: "есть ограждения", id: 5, a: false },
                { q: "дорога хорошо просматривается хотя бы в одну сторону", id: 6, a: false },
                { q: "дорога хорошо просматривается в обе стороны", id: 7, a: true },
                { q: "нет движущихся машин рядом", id: 8, a: true },
                { q: "есть движущийся вблизи транспорт", id: 9, a: false },
              ]}
              addCl={"text-success"}
            />,
            <Rebus
              quiz="Что должно быть на одежде (обуви) или рюкзаке (сумке) у пешехода, если он движется по обочине или краю проезжей части вне населённого пункта в тёмное время суток?"
              quiz2={" *Слово нужно записать в единственном числе."}
              trueans={"ФЛИКЕР"}
            />,
            <Select
              quiz={
                "Прочитай. Выбери правильный ответ."
              }
              quiz2={"Ваня начал переходить дорогу на зелёный сигнал светофора. Когда он дошёл до середины проезжей части, сигнал светофора изменился на красный, и машины начали движение. Как Ваня должен поступить в такой ситуации?"}
              img={select_1_1_14}
              ans={[
                { q: "Продолжить движение и закончить переход дороги бегом.", id: 0, a: false },
                { q: "Остановиться на островке безопасности или линии, разделяющей транспортные потоки противоположных направлений, и ждать зелёного сигнала светофора.", id: 1, a: true },
                { q: "Вернуться обратно и ждать зелёного сигнала светофора.", id: 2, a: false },
                { q: "Можно воспользоваться любым из названных выше вариантов действий.", id: 3, a: false }
              ]}
              addCl={"text-success"}
              imgsize="25%"
            />,
            <PickTrue
              trueans={["Верно", "Верно", "Неверно"]}
              arrans={["Верно", "Неверно"]}
              quiz="Прочитай вопрос и ответы на него. Укажи возле каждого ответа, верный он или нет. Щелкни левой клавишей мыши на нужное слово."
              quiz2="Какими должны быть действия пешеходов при приближении транспортного средства с включённым проблесковым маячком синего цвета и специальным звуковым сигналом?"
              ans={[
                "При приближении такого транспортного средства пешеходы должны воздержаться от перехода проезжей части.",
                "При приближении такого транспортного средства пешеходы, находящиеся на проезжей части, должны незамедлительно освободить её и уступить дорогу этому транспортному средству.",
                "Требование уступить дорогу транспортному средству с включённым синим проблесковым маячком и специальным звуковым сигналом касается только водителей, на пешеходов это требование не распространяется, поэтому они могут спокойно переходить проезжую часть, соблюдая все меры предосторожности.",
              ]}
            />,
          ],
        },
        {
          title: "Тема №2. Сигналы светофора, регулировщика",
          quests: [
            <Imgdrop
              quiz={"Что означают сигналы светофора? Перенесите под каждый рисунок подходящую запись."}
              ans={[imgdrop1_2_1, imgdrop1_2_2, imgdrop1_2_3]}
              ansImg={true}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "Запрещает движение, предупреждает о смене сигнала" }],
                [{ id: "2", content: "Запрещает движение" }],
                [{ id: "3", content: "Разрешает движение" }],
              ]}
              arrImg={false}
              trueans={["2", "1", "3"]}
              h={80}
              w={"80%"}
              hq={"15vw"}
            />,
            <PickTrue
              trueans={["Нет", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) ячейку таблицы со словом «ДА», если утверждение верное, и ячейку таблицы со словом «НЕТ» – если неверное."
              ans={[
                "Если рядом нет движущихся машин, то улицу можно переходить на любой сигнал светофора.",
                "Светофоры для пешеходов могут не иметь жёлтого сигнала.",
                "Если сигнал светофора начал мигать, то это значит, что время его действия истекло и скоро будет включён другой сигнал.",
                "Если на светофоре постоянно мигает только жёлтый сигнал, то это значит, что светофор сломан.",
              ]}
            />,
            <Select
              quiz={
                "Можно ли переходить улицу, если на светофоре постоянно мигает только жёлтый сигнал?"
              }
              img={s1_2_4}
              ans={[
                { q: "Нельзя ни в каком случае.", id: 0, a: false },
                { q: "Можно. Нужно только сначала внимательно осмотреться и пропустить движущийся транспорт.", id: 1, a: true },
                { q: "Можно только в тёмное время суток.", id: 2, a: false },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <ColorPic
              ans={
                "Какой перекрёсток считается регулируемым? Выдели правильный ответ синим цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Перекрёсток, на котором установлены дорожные знаки.",
                "Перекрёсток, на котором есть светофор, который работает в нормальном режиме (красный – жёлтый – зелёный), или стоит регулировщик.",
                "Только тот перекрёсток, где стоит регулировщик.",
              ]}
              trueans={["#000", "#32adf0", "#000"]}
            />,
            <ImagePic
              imgArr={[ip1_2_5, ip1_2_6, ip1_2_7, ip1_2_8]}
              trueans={[0, 2, 3]}
              multi={true}
              quiz="Выбери картинки, на которых изображены регулируемые перекрёстки."
            />,
            <Select
              quiz={
                "Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              }
              quiz2={"Иногда бывает так, что на перекрёстке рядом со светофором стоит регулировщик, и его указания противоречат сигналам светофора. Как в этом случае нужно действовать пешеходам?"}
              img={mouse}
              ans={[
                { q: "Нужно ориентироваться на сигналы светофора.", id: 0, a: true },
                { q: "Нужно выполнять только указания регулировщика.", id: 1, a: false },
                { q: "Сообщить регулировщику, что его сигналы противоречат сигналам светофора.", id: 2, a: true },
                { q: "Нужно ориентироваться и на сигналы светофора, и на сигналы регулировщика.", id: 3, a: true },
              ]}
              addCl={"text-white"}
              imgsize="25%"
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Кто из пешеходов имеет право переходить улицу при данном сигнале регулировщика?"
              }
              img={ip1_2_10}
              ans={[
                { q: "Перейти улицу имеют право девочка и бабушка.", id: 0, a: false },
                { q: "Перейти улицу имеют право мальчик и дедушка.", id: 1, a: false },
                { q: "Перейти улицу имеют право дедушка и бабушка.", id: 2, a: false },
                { q: "Перейти улицу имеют право мальчик и девочка.", id: 3, a: false },
                { q: "Перейти улицу имеют право мальчик и бабушка.", id: 4, a: false },
                { q: "Перейти улицу имеют право девочка и дедушка.", id: 5, a: false },
                { q: "Никто из пешеходов не имеет право перейти улицу.", id: 6, a: true },

              ]}
              addCl={"text-success"}
              random={true}
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Укажи всех пешеходов, которым разрешено переходить улицу при данном сигнале регулировщика?"
              }
              img={ip1_2_11}
              ans={[
                { q: "Бабушка", id: 0, a: true },
                { q: "Девочка", id: 1, a: false },
                { q: "Mальчик", id: 2, a: true },
                { q: "Мужчина", id: 3, a: false }
              ]}
              trueans={[true, false, true, false]}
              addCl={"text-success"}
            />,
            <Select
              quiz={
                "Рассмотри рисунок. Нарушает ли правила дорожного движения девочка, переходящая улицу?"
              }
              img={ip1_2_12}
              ans={[
                { q: "Да", id: 0, a: false },
                { q: "Нет", id: 1, a: true },
              ]}
              trueans={[false, true]}
              addCl={"text-success"}
            />,
            <Rebus
              img={ip1_2_13}
              quiz="Разгадай ребус, и узнаешь название города, в котором был установлен первый в мире светофор."
              trueans={"ЛОНДОН"}
            />,
          ],
        },
        {
          title: "Тема №3. Дорожные знаки",
          quests: [
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Без дорожных знаков невозможно безопасное движение по улицам и дорогам.",
                "Дорожные знаки делятся на несколько групп.",
                "Все дорожные знаки одинаковы по размеру, форме и величине.",
                "Знать дорожные знаки и следовать их указаниям обязаны только водители транспортных средств.",
              ]}
              trueans={["#32adf0", "#32adf0", "#f74f5a", "#f74f5a"]}
            />,
            <Imgdrop
              quiz={"Размести каждый знак в прямоугольнике под его названием."}
              dec={"Зажимай картинку левой клавишей мыши и перетаскивай в нужное место."}
              ans={["Место остановки такси", "Место остановки автобуса и (или) троллейбуса", "Место остановки трамвая"]}
              ansImg={false}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: ip1_3_2_1 }],
                [{ id: "2", content: ip1_3_2_2 }],
                [{ id: "3", content: ip1_3_2_3 }],
              ]}
              arrImg={true}
              trueans={["2", "1", "3"]}
              h="calc(5rem + 10vw)"
              w="calc(5rem + 5vw)"
            />,
            <ImagePic
              imgArr={[ip1_3_3_1, ip1_3_3_2, ip1_3_3_3, ip1_3_3_4]}
              trueans={[1]}
              quiz="Отметь запрещающий знак (нажми на нужную картинку)."
            />,
            <Emphas
              quiz="Под каждым знаком найди его название."
              quiz2="Кликни левой клавишей мыши по нужными словам"
              ans={[
                {
                  q: ip1_3_5_1,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
                {
                  q: ip1_3_4_1,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
                {
                  q: ip1_3_4_4,
                  arr: ["Движение пешеходов запрещено", "Пешеходная дорожка", "Дети"],
                },
              ]}
              trueans={[1, 2, 0]}
              ansImg={true}
              imgsize={'60%'}
            />,
            <ImagePic
              imgArr={[ip1_3_4_1, ip1_3_4_2, ip1_3_4_3, ip1_3_4_4, ip1_3_4_5, ip1_3_4_6]}
              trueans={[1, 2, 3, 4]}
              quiz="Отметь знаки, которые не относятся к предупреждающим."
            />,
            <Imgdrop
              quiz={"Прочитай. Выбери знак, который соответствует описанию, и перенеси его в нужный прямоугольник."}
              dec={"Зажимай картинку левой клавишей мыши и перетаскивай в нужное место."}
              ans={["Этот знак указывает место, где находится пешеходный переход. Именно здесь нужно переходить дорогу.",
                "Этот знак предупреждает водителя о том, что впереди будет пешеходный переход. Там, где установлен этот знак переходить улицу нельзя!",
              ]}
              ansImg={false}
              col={6}
              col2={4}
              arr={[
                [],
                [],
                [{ id: "1", content: ip1_3_4_6 }],
                [{ id: "2", content: ip1_3_4_5 }],
                [{ id: "3", content: ip1_3_5_1 }],
              ]}
              arrImg={true}
              trueans={["2", "1"]}
              h="calc(4rem + 9vw)"
              w="calc(4rem + 9vw)"
            />,
            <ImagePic
              imgArr={[ip1_3_4_4, ip1_3_4_2, ip1_3_4_6, ip1_3_7_4]}
              trueans={[2]}
              quiz="Ответь на вопрос Дум Думыча. Какой знак лишний?"
            />,
            <Imgdrop
              quiz={"Рассмотри рисунки. Какие дорожные знаки должны быть изображены на них вместо белых квадратов с вопросительными знаками?"}
              dec={"Перенеси нужный знак под каждый рисунок."}
              ans={[ip1_3_8_1, ip1_3_8_2]}
              ansImg={true}
              col={6}
              col2={4}
              arr={[
                [],
                [],
                [{ id: "1", content: ip1_3_4_5 }],
                [{ id: "2", content: ip1_3_8_4 }],
                [{ id: "3", content: ip1_3_8_5 }],
              ]}
              arrImg={true}
              trueans={["2", "1"]}
              h="calc(5rem + 8vw)"
              w="calc(5rem + 8vw)"
              hq="calc(5rem + 9vw)" />,
            <Emphas
              quiz="Под каждым знаком найди его название."
              quiz2="Кликни левой клавишей мыши по нужными словам."
              ans={[
                {
                  q: ip1_3_9_1,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_9_2,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_9_3,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"],
                },
                {
                  q: ip1_3_4_2,
                  arr: ["Движение на велосипеде запрещено", "Движение без остановки запрещено", "Дикие животные", "Скользкая дорога"]
                },
              ]}
              trueans={[1, 2, 3, 0]}
              ansImg={true}
              imgsize={'60%'}
            />,
            <Rebus
              img={ip1_3_10_1}
              quiz="Разгадай ребус, запиши название знака."
              trueans={"ТЕЛЕФОН"}
            />,
          ],
        },
        {
          title: "Тема №4. Ты пассажир",
          quests: [
            <Select
              quiz={
                "Кто такой пассажир? Выбери два правильных ответа."
              }
              ans={[
                { q: "Это тот человек, перевозится транспортным средством, но не является водителем.", id: 0, a: true },
                { q: "Это тот человек, который управляет транспортным средством.", id: 1, a: false },
                { q: "Это тот человек, который перевозится транспортным средством или управляет им.", id: 2, a: false },
                { q: "Это тот человек, который входит в транспортное средство или выходит из него.", id: 3, a: true },
              ]}
              addCl={"text-success"}
            />,
            <ImagePic
              imgArr={[i1_4_1, i1_4_2, i1_4_3, i1_4_4]}
              trueans={[0]}
              des="Щёлкни левой клавишей мыши на нужном знаке."
              quiz="Помоги Ване найти знак, который используется для обозначения остановочного пункта троллейбуса?"
            />,
            <Select
              quiz={
                "Вспомни, как нужно вести себя на автобусной или троллейбусной остановке. Выдели красным цветом то, что делать нельзя."
              }
              ans={[
                { q: "Cтоять у самой кромки тротуара.", id: 0, a: true },
                { q: "Выбегать к подъезжающему к остановке автобусу или троллейбусу.", id: 1, a: true },
                { q: "Становиться на остановке в первый ряд (ближний к дороге).", id: 2, a: true },
                { q: "Сидеть на установленной на остановке скамейке.", id: 3, a: false },
                { q: "Выходить и выбегать на проезжую часть во время ожидания автобуса или троллейбуса.", id: 4, a: true },
                { q: "Спокойно подходить к остановившемуся транспорту для посадки.", id: 5, a: false },
                { q: "Заходить в автобус или троллейбус не спеша, соблюдая очерёдность.", id: 6, a: false },
                { q: "Расталкивать людей, пытаясь оказаться первым у двери автобуса или троллейбуса.", id: 7, a: true },
              ]}
              addCl={"text-danger"}
            />,
            <ImagePic
              imgArr={[i1_4_6, i1_4_7, i1_4_8, i1_4_9, i1_4_10, i1_4_11]}
              trueans={[0, 2, 5]}
              quiz="Выбери те картинки, где ребята не нарушают правила безопасного поведения, ожидая на остановке автобус."
            />,

            <Select
              quiz={
                "Рассмотри картинку. Вспомни правила безопасного поведения в метро. Ответь на вопрос."
              }
              img={i1_4_16}
              quiz2={"Кто нарушил правила безопасного поведения в метро?"}
              ans={[
                { q: "1", id: 0, a: false },
                { q: "2", id: 1, a: false },
                { q: "3", id: 2, a: true },
                { q: "4", id: 3, a: false },
                { q: "5", id: 4, a: false },
                { q: "6", id: 5, a: false },
                { q: "7", id: 6, a: false },
                { q: "8", id: 7, a: false },
                { q: "9", id: 8, a: true },
              ]}
              addCl={"text-success"}
              gor={true}
              imgsize={"70%"}
              random={true}
            />,
            <ImagePic
              imgArr={[i1_4_12, i1_4_13, i1_4_14, i1_4_15]}
              trueans={[0, 3]}
              des={<>1) Нельзя высовываться в окно в движущемся транспорте. <br />
              2) Не отвлекайте водителя во время его работы.</>}
              quiz="Выдели картинки, к которым можно подписать следующие правила:"
            />,
            <Select
              quiz={
                "В каких правилах поведения в общественном транспорте пропущено слово НЕЛЬЗЯ?"
              }
              img={mouse}
              ans={[
                { q: "______ прислоняться к дверям и опираться на них.", id: 0, a: true },
                { q: "______ уступать место пассажирам детьми на руках, больным и пожилым людям.", id: 1, a: false },
                { q: "______ кричать и громко разговаривать, сорить, толкаться.", id: 2, a: true },
                { q: "______ оплачивать проезд.", id: 3, a: false },
                { q: "______ заранее готовиться к выходу.", id: 4, a: false },
                { q: "______ препятствовать закрыванию дверей", id: 5, a: true },
                { q: "______открывать двери транспортного средства во время его движения.", id: 6, a: true },
              ]}
              addCl={"text-success"}
              imgsize="25%"
            />,
            <Subsequence
              img={i1_4_20}
              trueans={["4", "1", "3", "2"]}
              arrans={["", "", "", ""]}
              quiz="Напечатай возле каждого правила номер подходящей для него картинки."
              ans={[
                "В салоне автобуса, троллейбуса, вагоне поезда метро держитесь за поручни, чтобы не упасть, если водителю придётся резко затормозить.",
                "Во избежание быть зажатым дверьми не пытайтесь сесть в транспорт в последний момент перед отправкой.",
                "Если вагон поезда метро, автобус или троллейбус переполнен, лучше подождать следующего.",
                "Нельзя входить в транспорт с мороженым и напитками, даже если салон свободен; при резком торм ожении можно испачкать других пассажиров.",
              ]}
              col={[11, 11, 8, 4]}
              imgsize={"90%"}
            />,
            <SelectedWord
              quiz={"Как нужно обходить стоящий автобус, троллейбус, трамвай? Используя выпадающие списки, вставь пропущенные слова."}
              arrText={[<>Троллейбус нужно обходить</>,
                <> <br/> Трамвай нужно обходить </>,
                <> <br/> Автобус нужно обходить </>,
              ]}
              arrWord={[["сзади", "спереди"], ["сзади", "спереди"], ["сзади", "спереди"]]}
              trueAns={["0", "1", "0"]}
              img={i1_4_21}
              imgsize={'50%'}
              col={true}
            />,
            <Select
              quiz={
                "Прочитай вопрос и ответы ребят на этот вопрос. Кто из ребят ответил правильно?"
              }
              quiz3={<>Твой друг уронил на рельсы в метро мобильный телефон. Как нужно поступить в такой ситуации? <br />Ваня: «Если нет приближающегося поезда, быстро спуститься на рельсы и поднять телефон». <br />Катя: «Сначала дождаться ближайшего поезда, а затем после его ухода быстро спуститься на рельсы и поднять телефон». <br />Саша: «Сообщить о случившемся дежурному по станции и попросить помощи».</>}
              ans={[
                { q: "Ваня", id: 0, a: false },
                { q: "Ваня и Катя", id: 1, a: false },
                { q: "Катя", id: 2, a: false },
                { q: "Саша и Катя", id: 3, a: false },
                { q: "Саша", id: 4, a: true },
                { q: "Саша и Ваня", id: 5, a: false },
                { q: "Все ответили правильно", id: 6, a: false },
                { q: "Все ответили неправильно", id: 7, a: false },
              ]}
              addCl={"text-success"}
              random={true}
            />,
          ],
        },
        {
          title: "Тема №5. Правила езды на велосипедах",
          quests: [
            <Subsequence
              img={i1_5_1}
              trueans={["4", "6", "5", "2", "3", "1", "8", "7"]}
              arrans={["", "", "", "", "", "", ""]}
              quiz="Укажи правильную последовательность действий при переходе улицы по нерегулируемому пешеходному переходу. Пронумеруй действия пешехода."
              ans={[
                "педаль",
                "спицы",
                "шина (покрышка)",
                "руль",
                "рама",
                "багажник",
                "цепь",
                "седло",
              ]}
              col={[11, 11, 3, 8]}
              imgsize={"60%"}
            />,
            <Select
              quiz={
                "До какого возраста детям запрещено выезжать на велосипеде на дорогу, где движутся автомобили?"
              }
              img={i1_5_2}
              ans={[
                { q: "до 14 лет", id: 0, a: true },
                { q: "до 16 лет", id: 1, a: false },
                { q: "до 15 лет", id: 2, a: false },
                { q: "до 18 лет", id: 3, a: false },
              ]}
              addCl={"text-success"}
              imgsize="50%"
            />,
            <Select
              quiz={
                "Где можно кататься на велосипедах детям в возрасте от 7 до 14 лет? Выдели зеленым правильные ответы."
              }
              ans={[
                { q: "во дворах", id: 0, a: true },
                { q: "в парках", id: 1, a: true },
                { q: "на скоростных автомобильных дорогах", id: 2, a: false },
                { q: "на велосипедных дорожках", id: 3, a: true },
                { q: "на стадионах", id: 4, a: true },
                { q: "по крайней правой полосе проезжей части, если рядом нет машин", id: 5, a: false },
                { q: "на велопешеходных дорожках", id: 6, a: true },
              ]}
              addCl={"text-success"}
            />,
            <ImagePic
              imgArr={[i1_5_3, i1_5_4]}
              trueans={[0]}
              quiz="Велосипедисту необходимо пересечь проезжую часть по пешеходному переходу. Как
              правильно это сделать? Выбери картинки с правильным ответом."
            />,
            <Imgdrop
              quiz={"Расположи под каждым знаком его название."}
              ans={[ip1_3_4_2, ip1_3_3_3, i1_5_7]}
              ansImg={true}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "Велосипедная дорожка" }],
                [{ id: "2", content: "Движение на велосипеде запрещено" }],
                [{ id: "3", content: "Конец велосипедной дорожки" }],
              ]}
              arrImg={false}
              trueans={["2", "1", "3"]}
              h="calc(2rem + 4vw)"
              w="calc(5rem + 10vw)"
              hq="calc(5rem + 10vw)"

            />,
            <Select
              quiz={
                "Выбери правильные ответы на вопрос Дум Думыча."
              }
              quiz3={"В каких правилах поведения на воде пропущено слово НЕЛЬЗЯ?"}
              img={mouse}
              ans={[
                { q: "______ ездить на велосипеде, если неисправна тормозная система или рулевое управление.", id: 0, a: true },
                { q: "______ надевать шлем для езды на велосипеде.", id: 1, a: false },
                { q: "______ перевозить груз, мешающий управлению велосипедом.", id: 2, a: true },
                { q: "______ подавать определённый сигнал перед совершением поворота.", id: 3, a: false },
                { q: "______ цепляться за проезжающее мимо транспортное средство.", id: 4, a: true }
              ]}
              addCl={"text-success"}
              imgsize="25%"
            />,
            <Select
              quiz={
                "Что нужно вставить на месте пропусков?"
              }
              quiz3={"Велосипедист, как и другие участники дорожного движения, обязан подавать сигналы о планируемых маневрах."}
              ans={[
                { q: "вытянуть в сторону левую руку", id: 0, a: true },
                { q: "вытянуть в сторону правую руку", id: 1, a: false },
                { q: "поднять согнутую в локте левую руку", id: 2, a: false },
                { q: "поднять согнутую в локте правую руку", id: 3, a: true },
              ]}
              ansnew={[
                { q: "вытянуть в сторону левую руку", id: 4, a: false },
                { q: "вытянуть в сторону правую руку", id: 5, a: true },
                { q: "поднять согнутую в локте левую руку", id: 6, a: true },
                { q: "поднять согнутую в локте правую руку", id: 7, a: false },
              ]}

              newquiz1={"Перед поворотом налево, велосипедист должен … или … ."}
              newquiz2={"Перед поворотом направо, велосипедист должен … или … ."}
              addCl={"text-success"}
            />,
            <Select
              quiz={
                "Какой сигнал должен подать велосипедист другим участникам дорожного движения перед торможением или остановкой?"
              }
              img={i1_5_8}
              ans={[
                { q: "поднять вверх обе руки", id: 0, a: false },
                { q: "поднять вверх левую или правую руку", id: 1, a: true },
                { q: "вытянуть в сторону обе руки", id: 2, a: false },
                { q: "заложить правую руку за спину", id: 3, a: false },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <ImagePic
              imgArr={[i1_5_9, i1_5_10, i1_5_11, i1_5_12]}
              trueans={[1, 2]}
              quiz="Кто из ребят нарушает правила катания на велосипеде?"
            />,
            <ColorPic
              ans={
                "Выдели зелёным цветом те действия, которые разрешены, красным – те, которые запрещены."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели фразу, щёлкнув по ней левой клавишей мыши."}
              arr={[
                "разговаривать по телефону во время езды",
                "катать друзей на багажнике велосипеда",
                "кататься с друзьями по велосипедной дорожке, двигаясь в один ряд",
                "кататься в наушниках",
                "при движении по пешеходной дорожке предупреждать пешеходов звонком или голосом о том, что вы подъезжаете к ним сзади",
              ]}
              trueans={["#f74f5a", "#f74f5a", "#18d945", "#f74f5a", "#18d945"]}
            />,
          ],
        },
        {
          title: "Тема №6. Ситуационные задачи ПДД",
          quests: [
            <ImagePic
              imgArr={[i1_6_1, i1_6_2, i1_6_3, i1_6_4]}
              trueans={[0, 2, 3]}
              quiz="Отметь картинки, на которых изображены ребята, нарушающие правила безопасного поведения."
            />,
            <Select
              quiz={
                "Прочитай. Подчеркни правильный ответ."
              }
              quiz2={`Четверо ребят переходили улицу на нерегулируемом пешеходном
          переходе. Игорь посмотрел направо и стал переходить дорогу. Ваня,
          разговаривая по телефону, глянул налево и начал переход проезжей
          части. Никита не стал смотреть по сторонам, ведь машины должны
          пропустить движущегося по переходу пешехода. Катя сначала
          осмотрелась и убедилась в том, что поблизости нет машин, затем
          ещё раз посмотрела налево и начала переход.
          Кто в этой ситуации действовал правильно?`}
              img={i1_6_5}
              ans={[
                { q: "Игорь", id: 0, a: false },
                { q: "Ваня", id: 1, a: false },
                { q: "Никита", id: 2, a: false },
                { q: "Катя", id: 3, a: true },
                { q: "Игорь и Катя", id: 4, a: false },
                { q: "Все действовали правильно", id: 5, a: false },
              ]}
              addCl={"text-success"}
              imgsize={"60%"}
              random={true}
            />,
            <Select
              quiz={
                "Прочитай. Выбери правильный ответ."
              }
              quiz2={`Катя и Паша катаются на велосипедах. Им нужно
          попасть на другую сторону улицы. Они остановились
          возле пешеходного перехода и задумались, как
          правильно поступить. Катя предложила переехать
          проезжую часть на велосипеде, а Ваня сказал, что они
          должны перейти проезжую часть пешком, а велосипед
          вести рядом с собой.
          Кто прав?`}
              img={i1_6_6}
              ans={[
                { q: "Катя", id: 0, a: false },
                { q: "Паша", id: 1, a: true },
                { q: "Оба правы", id: 2, a: false },
              ]}
              addCl={"text-success"}
              imgsize={'60%'}
              random={true}
            />,
            <ImagePic
              imgArr={[i1_6_7, i1_6_8, i1_6_9, i1_6_10]}
              trueans={[2]}
              quiz="Рассмотри картинки. В каком случае нарушены правила дорожного движения?"
            />,
            <Select
              quiz={
                "Рассмотри рисунки. Кому из этих велосипедистов запрещено ездить по дороге, где движутся автомобили?"
              }
              img={i1_6_14}
              ans={[
                { q: "Коле", id: 0, a: false },
                { q: "Ане", id: 1, a: false },
                { q: "Саше", id: 2, a: false },
                { q: "Мише", id: 3, a: false },
                { q: "Всем разрешено", id: 4, a: false },
                { q: "Всем запрещено", id: 5, a: true },
              ]}
              addCl={"text-success"}
              imgsize={'60%'}
              random={true}
            />,
            <Select
              quiz={
                "Ответь на вопрос Дум Думыча. Зачеркни все неправильные ответы."
              }
              quiz2={`Каким сигналом велосипедист должен информировать других участников
          дорожного движения о том, что он намерен остановиться?`}
              img={i1_6_15}
              ans={[
                { q: "поднять руку вверх", id: 0, a: false },
                { q: "вытянуть в сторону правую руку", id: 1, a: true },
                { q: "вытянуть в сторону обе руки", id: 2, a: true },
                { q: "вытянуть в сторону левую руку", id: 3, a: true },
              ]}
              addCl={"perek"}
              imgsize={'60%'}
            />,
            <Select
              quiz={
                "Прочитай. Ответь на вопрос."
              }
              quiz2={`Должен ли пешеход, переходящий улицу на зелёный
          сигнал светофора, пропускать машину скорой помощи,
          движущуюся с включённым проблесковым маячком и
          специальным звуковым сигналом на красный свет?`}
              img={i1_6_16}
              ans={[
                { q: "Да", id: 0, a: true },
                { q: "Нет", id: 1, a: false },
                { q: "Зависит от скорости движения машины", id: 2, a: false },
              ]}
              addCl={"text-success"}
              imgsize={'60%'}
            />,
            <Select
              quiz={
                "Кто из пешеходов нарушил правила дорожного движения?"
              }
              gor={true}

              img={i1_6_17}
              ans={[
                { q: "1", id: 0, a: true },
                { q: "2", id: 1, a: false },
                { q: "3", id: 2, a: false },
                { q: "4", id: 3, a: false },
                { q: "2 и 4", id: 4, a: false },
                { q: "1, 2 и 4", id: 5, a: false },
              ]}
              addCl={"text-success"}
              random={true}
              imgsize={'60%'}
            />,
            <Emphas
              quiz="Под каждым определением найди его значение."
              quiz2="Кликни левой клавишей мыши по нужными словам"
              ans={[
                {
                  q: "Место пересечения дорог.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Предмет, который использует регулировщик для регулирования движения на проезжей части.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Полосатая разметка перехода.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
                {
                  q: "Двухколесное или трехколесное транспортное средство без мотора.",
                  arr: ["Жезл", "Зебра", "Велосипед", "Перекрёсток"],
                },
              ]}
              trueans={[3, 0, 1, 2]}
            />,
            <Rebus
              quiz="Разгадай ребус."
              trueans={"ФЛИКЕР"}
              img={i1_6_18}
            />,

          ],
        },
        {
          title: "Тема №7. ТБ зимой общие",
          quests: [
            <ImagePic
              imgArr={[i1_7_1, i1_7_2, i1_7_3, i1_7_4, i1_7_5, i1_7_6, i1_7_7, i1_7_8, i1_7_9]}
              trueans={[1, 3, 8]}
              quiz="Помоги Ване выбрать каждой строке один предмет одежды или обуви для зимней прогулки."
            />,
            <SelectedWord
              quiz={"Вспомни, как правильно нужно одеваться зимой. Прочитай предложения и с помощью выпадающих списков вставь пропущенные слова."}
              arrText={["Чем ",
                " слоёв одежды на человеке, тем лучше сохраняется тепло. Ноги быстро замерзают в ",
                " обуви.",
              ]}
              arrWord={[["больше", "меньше"], ["свободной", "тесной"]]}
              trueAns={["0", "1"]}
            />,
            <Emphas
              quiz="Выберете правильный ответ."
              ans={[
                {
                  q: "Что лучше сохраняет тепло?",
                  arr: ["Варежки", "Перчатки"],
                },
                {
                  q: `Какие носочки теплее?`,
                  arr: ["Из шерсти", "Из хлопка"],
                },
              ]}
              trueans={[0, 0]}
              ansImg={false}
            />,
            <ColorPic
              ans={
                "Что может стать зимой причиной переохлаждения организма? Выдели правильные ответы синим цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "Мороз",
                "Могослойная одежда",
                "Высокая влажность воздуха",
                "Хорошее настроение",
                "Cильный ветер",
                "Tесная и влажная одежда и обувь"
              ]}
              trueans={["#32adf0", "#000", "#32adf0", "#000", "#32adf0", "#32adf0"]}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Вспомни правила безопасного поведения во время прогулки зимой."
              quiz2="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и прямоугольник со словом «нет» – если неверное."
              ans={[
                "Если почувствовал, что замерзаешь или промочил ноги, нужно немедленно возвращаться домой и сразу же переодеваться в сухую одежду.",
                "Чтобы не замёрзнуть на улице зимой, нужно поменьше двигаться.",
                "На морозе нельзя браться за металлические поверхности голыми руками.",
                "На улице нельзя снимать шапку и шарф, даже если появилось ощущение тепла.",
                "Если захотелось пить, можно съесть сосульку, чтобы утолить жажду."
              ]}
            />,
            <ColorPic
              ans={
                "Что нельзя делать, если ты отморозил пальцы рук или ног? Выдели нужные ответы красным цветом."
              }
              dec={"Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели выбранный ответ, нажав на нём левой клавишей мыши."}
              arr={[
                "растирать замёрзшие участки тела снегом",
                "пить горячий чай",
                "укутываться тёплым одеялом",
                "заходить в тёплое помещение",
                "погружать руки или ноги в горячую воду, чтобы быстро согреться",
                "погружать руки или ноги в едва тёплую, прохладную воду."
              ]}
              trueans={["#f74f5a", "#000", "#000", "#000", "#f74f5a", "#000"]}
            />,
            <Select
              quiz={
                "Какие дополнительные опасности появляются на дороге зимой? Выбери все правильные ответы."
              }
              img={i1_7_15}
              ans={[
                { q: "Гололёд увеличивает тормозной путь автомобилей.", id: 0, a: true },
                { q: "Снегопад ухудшает видимость водителям и пешеходам.", id: 1, a: true },
                { q: "Тёплая одежда сковывает движения.", id: 2, a: true },
                { q: "Сугробы на обочинах дорог ограничивают обзор.", id: 3, a: true },
                { q: "Происходит сужение дороги из-за неубранного снега.", id: 4, a: true },
              ]}
              addCl={"text-success"}
              imgsize="70%"
            />,
            <Select
              quiz={
                "Выбери все верные продолжения предложения. Закрась ячейки таблицы, в которых они записаны."
              }
              newquiz1={"По сравнению с летом, зимой при переходе проезжей части расстояние между пешеходом и автомобилем должно быть..."}
              ans={[
                { q: "больше", id: 0, a: true, },
                { q: "меньше", id: 1, a: false },
                { q: "таким же", id: 2, a: false }
              ]}
              newquiz2={"На улице сильный ветер и идёт снег. При переходе проезжей части я …"}
              ansnew={[
                { q: "натяну шапку на глаза и надену сверху капюшон, чтобы снег не попадал в глаза", id: 3, a: false },
                { q: "прищурюсь или закрою глаза", id: 4, a: false },
                { q: "откину назад капюшон, постараюсь прикрыться ладонью от снега так, чтобы не закрывать видимость дороги", id: 5, a: true },
              ]}
              addCl={"text-success"}
            />,
            <Select
              quiz={
                "Ты с родителями гулял в городе возле ёлки, где было очень много людей, и потерялся. Телефон ты забыл дома. Попытки найти родителей не увенчались успехом. Как правильно поступить в этом случае? Отметь правильные ответы."
              }
              ans={[
                { q: "не уходить далеко от того места, где потерялся", id: 0, a: true },
                { q: "обратиться с просьбой помочь к любому человеку, который тебе улыбнётся или заговорит с тобой", id: 1, a: false },
                { q: "обратиться к полицейскому", id: 2, a: true },
                { q: "найти детей такого же возраста, как ты, и попросить помочь", id: 3, a: false },
                { q: "начинать паниковать и плакать", id: 4, a: false },
                { q: "не стоять на месте, бежать в любом направлении и искать родителей", id: 5, a: false },

              ]}
              addCl={"text-success"}
            />,
            <Select
              quiz={
                "Прочитай правила использования бенгальских огней, которые записал Серёжа. Зачеркни то, что неверно."
              }
              img={i1_7_17}
              ans={[
                { q: "Бенгальская свеча не считается огнеопасным изделием, поэтому поджигать её можно самостоятельно, без взрослых.", id: 0, a: true },
                { q: "Держать бенгальскую свечу нужно за металлическое основание под наклоном к горизонтальной поверхности на расстоянии вытянутой руки.", id: 1, a: false },
                { q: "Держать бенгальскую свечу нужно вертикально за металлическое основание.", id: 2, a: true },
                { q: "Нельзя прикасаться к горящему или только что потухшему бенгальскому огню.", id: 3, a: false },
                { q: "Потухшую бенгальскую свечку следует класть в стакан с водой.", id: 4, a: false },

              ]}
              addCl={"perek"}
              imgsize={'40%'}
            />,
          ],
        },
        {
          title: "Тема №8. Правила поведения зимой во время игр, катания на санках, коньках. ТБ зимой на льду",
          quests: [
            <Select
              quiz={
                "На каких горках нельзя кататься на лыжах и санках?"
              }
              img={i1_8_1}
              ans={[
                { q: "горка со спуском на железные пути", id: 0, a: true },
                { q: "горка со спуском на проезжую часть дороги", id: 1, a: true },
                { q: "небольшая горка во дворе с ровным пологим склоном вдали от дороги", id: 2, a: false },
                { q: "горка, поросшая кустами и деревьями", id: 3, a: true },
                { q: "горка, специально оборудованная для катания", id: 4, a: false },
                { q: "горка, на которой есть торчащие камни", id: 5, a: true },
              ]}
              addCl={"text-success"}
              imgsize={"40%"}
            />,
            <ImagePic
              imgArr={[i1_8_2, i1_8_3, i1_8_4, i1_8_5]}
              trueans={[1, 3]}
              quiz="На каких картинках изображены ребята, которые не соблюдают правила безопасного катания с горки?"
            />,
            <Select
              quiz={
                "Подумай, как можно продолжить данное предложение. Выдели все правильные варианты ответа."
              }
              img={i1_8_6}
              newquiz1="Очень опасно спускаться с горки …."
              ans={[
                { q: "стоя на ногах", id: 0, a: true },
                { q: "сидя на санках спиной вперёд", id: 1, a: true },
                { q: "сидя на санках лицом вперёд и держась за санки", id: 2, a: false },
                { q: "паровозиком, сцепив несколько санок", id: 3, a: true },
              ]}
              addCl={"text-success"}
              imgsize={"40%"}
            />,
            <Select
              quiz={
                "Выдели красным цветом ответы на вопрос Дум Думыча."
              }

              img={mouse}
              newquiz1="В каких правилах безопасного поведения при катании с горки пропущено слово НЕЛЬЗЯ?"
              ans={[
                { q: "______ подниматься на горку там, где навстречу скатываются другие.", id: 0, a: true },
                { q: "______ подниматься на снежную или ледяную горку только в месте подъёма, оборудованном ступенями.", id: 1, a: false },
                { q: "______ съезжать с горки, пока не отойдёт в сторону тот, кто спускается впереди.", id: 2, a: true },
                { q: "______ поскорее отползать или откатываться в сторону, когда съехал.", id: 3, a: false },
              ]}
              addCl={"text-danger"}
              imgsize={"25%"}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Да", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и
          прямоугольник со словом «нет» – если неверное."
              ans={[
                "Между лыжниками на лыжне должна быть безопасная дистанция (не менее 3–4 м).",
                "При спуске на лыжах с горки дистанцию можно не соблюдать.",
                "При спуске на лыжах с горки нельзя выставлять вперёд лыжные палки.",
                "Нельзя прыгать с трамплина: для этого нужны специальная подготовка и прыжковые лыжи. "
              ]}
            />,
            <Select
              quiz={
                "Выбери верный вариант ответа."
              }

              img={i1_8_7}
              newquiz1="Если во время катания на лыжах ты почувствовал, что теряешь равновесие, нужно:"
              ans={[
                { q: "падать вперёд, держа при этом палки сзади", id: 0, a: false },
                { q: "слегка присесть и падать на бок, держа при этом палки сзади", id: 1, a: true },
                { q: "падать на спину, держа при этом палки перед собой", id: 2, a: false },
              ]}
              addCl={"text-success"}
              imgsize={"40%"}
            />,
            <PickTrue
              trueans={["Нельзя", "Нельзя", "Нужно", "Нужно", "Нельзя", "Нельзя"]}
              arrans={["Нельзя", "Нужно"]}
              quiz="Выбери (нажми) на прямоугольник, что нужно, а что нельзя делать во время игры в снежки."
              ans={[
                "Бросая снежки, целиться в голову и лицо.",
                "Использовать вместо снежков ледышки.",
                "Соблюдать правила игры.",
                "Быть внимательным по отношению к своим друзьям.",
                "Снимать шапку, шарфик, варежки.",
                "Бросаться большими глыбами снега.",
              ]}
            />,
            <Emphas
              quiz="Вспомни правила безопасности, которые нужно соблюдать на ледовом катке. Выбери
        правильное продолжение для каждого правила."
              ans={[
                {
                  q: "Выходить на лёд нужно _______.",
                  arr: ["аккуратно, держась за борт", "смело, с разбега"],
                },
                {
                  q: `Двигаться на катке нужно ______.?`,
                  arr: ["навстречу потоку людей", "по направлению потока людей"],
                },
                {
                  q: `Тем, кто плохо стоит на коньках, нужно держаться _____ .`,
                  arr: ["в центре катка", "ближе к бортику"],
                },
                {
                  q: `Если ты споткнулся и падаешь, нужно_____ .`,
                  arr: ["расслабиться, постараться сгруппироваться и упасть на бок", "хвататься за других людей, чтобы замедлить падение"],
                },
              ]}
              trueans={[0, 1, 1, 0]}
              ansImg={false}
            />,
            <ColorPic
              ans={
                "Прочитай. Выдели правильный ответ синим цветом."
              }
              dec="Все дети знают, что выходить на лёд без взрослых, даже если водоём хорошо знаком, ни в коем случае
      нельзя! Но дети иногда бывают непослушны и, не задумываясь о последствиях, нарушают правила
      безопасного поведения.
      Так мальчик Ваня, оказавшись на середине реки, почувствовал, что у него под ногами затрещал лёд.
      Подскажите, как правильно нужно действовать Ване в этой ситуации."
              arr={[
                "быстро бежать к ближайшему берегу",
                "стоять на месте и звать на помощь",
                "проверить прочность льда ударом ноги",
                "медленно и плавно лечь на живот и ползти или перекатываться в том направлении, откуда пришёл",
              ]}
              trueans={["#000", "#000", "#000", "#32adf0"]}
            />,
            <Subsequence
              trueans={["1", "5", "2", "6", "4", "3"]}
              arrans={["1", "", "", "", "", ""]}
              quiz="Что делать, если ты провалились под лёд? Составь правильную последовательность
    действий, пронумеровав их."
              ans={[
                "Не паникуй, не делай резких движений.",
                "Выбравшись из полыньи, сначала откатись от неё на 3–4 метра в ту сторону, откуда пришёл.",
                "Широко раскинь руки, чтобы зацепиться за кромку льда и увеличить площадь опоры. Позови на помощь.",
                "Осторожно ползи к берегу.",
                "Затем постарайся забросить одну, а потом и другую ногу на лёд.",
                "Если тебя никто не видит и не слышит, постарайся выбраться из полыньи самостоятельно. Аккуратно наползай грудью на один край полыньи, а ногами упирайся в противоположный край."
              ]}
              col={[12, 12, 11, 11]}
            />,
          ],
        },
        {
          title: "Тема №9. Погодные явления и безопасность человека",
          quests: [
            <Select
              quiz={
                "Из чего складывается погода? Выбери правильные ответы и подчеркни их."
              }
              img={i1_9_1}
              ans={[
                { q: "температура воздуха", id: 0, a: true },
                { q: "осадки", id: 1, a: true },
                { q: "отопление в домах", id: 2, a: false },
                { q: "ветер", id: 3, a: true },
                { q: "облачность", id: 4, a: true },
                { q: "народные приметы", id: 5, a: false },
              ]}
              addCl={"podperek"}
              imgsize={"60%"}
            />,
            <Rebus
              img={i1_9_2}
              quiz="Напечатай ответ на вопрос Дум Думыча."
              trueans={"ГРОЗА"}
            />,
            <ColorPic
              ans={
                "Как правильно вести себя во время грозы, если ты находишься дома? Выдели зелёным цветом все правильные действия."
              }
              dec={"Цвет на палитре выбирай нажатием левой клавиши мыши; чтобы выделить ответ, щёлкни на нём левой клавишей мыши."}
              arr={[
                "закрыть все окна",
                "открыть окна, чтобы был сквозняк в помещении",
                "выключить телевизор, компьютер и другие электроприборы",
                "воздержаться от разговоров по телефону",
                "находиться поближе к окнам и дверям"
              ]}
              trueans={["#18d945", "#000", "#18d945", "#18d945", "#000"]}
            />,
            <PickTrue
              trueans={["Нельзя", "Нельзя", "Можно", "Можно", "Нельзя", "Нельзя", "Можно"]}
              arrans={["Можно", "Нельзя"]}
              quiz="Вспомни правила безопасного поведения во время грозы, если ты находишься на улице.
        Выбери слово МОЖНО или НЕЛЬЗЯ."
              ans={[
                "прятаться под высоким деревом, особенно отдельно стоящим.",
                "находиться на возвышенностях и открытых незащищённых местах.",
                "прятаться в зарослях кустарника.",
                "прятаться в сухой яме или траншее.",
                "находиться возле металлических предметов (металлических заборов, решёток) и прикрываться от дождя металлическими предметами (ведром, тазом и др.).",
                "купаться во время грозы.",
              ]}
            />,
            <Select
              quiz="Гололёд и гололедица на улицах и дорогах зимой часто являются причиной травм пешеходов.
                Какие меры предосторожности следует предпринять, чтобы снизить отрицательные
                последствия гололёда и гололедицы? Выбери верный вариант в каждом пункте."
              newquiz1="Чтобы снизить вероятность падения и получения травмы во время передвижения по улице, нужно:"
              ans={[
                { q: "надевать малоскользящую обувь с удобной подошвой", id: 0, a: true },
                { q: "надевать коньки", id: 1, a: false },
                { q: "надевать обувь на каблуке", id: 2, a: false },
                { q: "наступать на каблук обуви и не сгибать ноги в коленях", id: 3, a: false },
                { q: "наступать на всю подошву и слегка расслабить ноги в коленях", id: 4, a: true },
                { q: "передвигаться на носочках, спрятав руки в карманы", id: 5, a: false },
                { q: "передвигаться осторожно, небольшими шажками", id: 6, a: true },
                { q: "передвигаться быстро и уверенно", id: 7, a: false },
              ]}
              addCl={"text-success"}
            />,
            <Select
              quiz={
                "Как можно подготовить обувь для передвижения в гололёд, чтобы она не скользила? Удали неправильный ответ."
              }
              img={i1_9_3}
              ans={[
                { q: "наклеить крест-накрест лейкопластырь на сухую подошву и каблук", id: 0, a: false },
                { q: "выставить обувь на улицу на ночь", id: 1, a: true },
                { q: "перед выходом на улицу натереть подошву наждачной бумагой", id: 2, a: false },
                { q: "выйдя на улицу, наступить обувью в песок", id: 3, a: false }
              ]}
              addCl={"text-white"}
              imgsize={"40%"}
            />,
            <PickTrue
              trueans={["Да", "Нет", "Нет", "Да", "Нет", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Вспомни, как правильно действовать, если ты поскользнулся.
        Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и прямоугольник
        со словом «нет» – если неверное."
              ans={[
                "Если ты поскользнулся, сразу присядь, чтобы снизить высоту падения.",
                "Если ты поскользнулся, постарайся выпрямиться, чтобы упасть на спину.",
                "В момент падения старайся удержать сумку или вещи, которые у тебя в руках.",
                "В момент падения постарайся сгруппироваться, и, перекатившись, смягчить удар о землю.",
                "Постарайся как можно быстрее подняться после падения.",
                "После падения не торопись быстро подниматься, пошевели руками и ногами, убедись, что нигде не чувствуешь боли, только тогда аккуратно попробуй встать.",
              ]}
            />,
            <ColorPic
              ans={
                "Какие правила следует соблюдать, если на улице метель или пурга? Выдели правильные ответы синим цветом, неправильные – красным."
              }
              dec={"Цвет на палитре выбирай нажатием левой клавиши мыши; чтобы выделить ответ, щёлкни на нём левой клавишей мыши."}
              arr={[
                "Нельзя выходить из дома во время пурги. Плотно закрыть окна и двери.",
                "Если сильная метель застала в дороге, нужно спрятаться в овраге или яме.",
                "Находясь на улице во время метели, нельзя передвигаться, нужно стоять на одном месте.",
                "Если сильная метель или пурга застала в дороге, нужно зайт и в первый попавшийся дом и попроситься ос таться в нём до её окончания.",
              ]}
              trueans={["#32adf0", "#f74f5a", "#f74f5a", "#32adf0"]}
            />,
            <Emphas
              quiz="Выполни задания. Выберите правильные ответы."
              ans={[
                {
                  q: "Как называются учёные, которые ведут наблюдения за погодой и на основе этих наблюдений составляют прогнозы погоды?",
                  arr: ["метеорологи", "экологи", "зоологи", "психологи"],
                },
                {
                  q: `Народная примета, которая предсказывает дождь.`,
                  arr: ["Шишки хвойных деревьев раскрываются", "Вечером громко стрекочут кузнечики", "Низко летают ласточки"],
                },
                {
                  q: `Народная примета, которая предсказывает ясную погоду.`,
                  arr: ["Днём закрылись соцветия одуванчиков", "Воробьи купаются в песке", "Вечером громко стрекочут кузнечики"],
                }
              ]}
              trueans={[0, 2, 2]}
              ansImg={false}
            />,
            <Rebus
              img={i1_9_4}
              img2={i1_9_5}
              quiz="Найди и запиши слово, пропущенное в латинской пословице."
              quiz2="________ чувствовать себя безопасно в опасности."
              des="Чтобы найти слово, пройди по указанному маршруту. Начало движения –
            клеточка с совой."
              trueans={"ОПАСНО"}
            />,
          ],
        },
        {
          title: "Тема №10. Стихийные бедствия и безопасность человека",
          quests: [
            <Emphas
              quiz="Определи, какое природное явление изображено на каждой картинке."
              ans={[
                {
                  q: i1_10_1,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_2,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_3,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                },
                {
                  q: i1_10_4,
                  arr: ["смерч", "землетрясение", "извержение вулкана", "засуха"],
                }
              ]}
              trueans={[1, 2, 3, 0]}
              ansImg={true}
            />,
            <Select
              quiz={
                "Прочитай. О каком природном явлении говорится в описании? Подчеркни правильный ответ."
              }
              quiz3="Это опасное явление природы может быть вызвано продолжительными ливнями, быстрым
              таянием снега, а в прибрежных районах – сильным ветром, воздействующим на водную
              поверхность, а также некоторыми другими причинами."

              ans={[
                { q: "землетрясение", id: 0, a: false },
                { q: "наводнение", id: 1, a: true },
                { q: "извержение вулкана", id: 2, a: false },
                { q: "засуха", id: 3, a: false }
              ]}
              addCl={"podperek"}
            />,
            <Rebus
              img={i1_10_6}
              img2={i1_10_5}
              quiz="Разгадай ребус."
              des="Запиши, как называется природное явление, которое изобразил на своём
            рисунке мальчик."
              trueans={"ЦУНАМИ"}
            />,
            <Select
              quiz={
                "Ответь на вопрос Дум Думыча."
              }
              img={i1_10_7}

              ans={[
                { q: "Ветер разрушительной силы, скорость которого больше, чем у мчащегося по улице автомобиля.", id: 0, a: true },
                { q: "Это масса снега, падающая или соскальзывающая с крутых горных склонов и движущаяся с большой скоростью.", id: 1, a: false },
                { q: "Бурный грязе-каменный поток, возникающий в горах во время сильных дождей или таяния снегов.", id: 2, a: false },
              ]}
              addCl={"text-success"}
            />,
            <ColorPic
              ans={
                "Выдели верные утверждения зелёным цветом, неверные – красным."
              }
              dec="Цвета на палитре выбирай нажатием левой клавиши мыши; чтобы выделить утверждение,
            щёлкни на нём левой клавишей мыши."
              arr={[
                "Снежные лавины образуются в горах после сильных снегопадов.",
                "Ураган может переворачивать машины на дорогах, вырывать с корнями деревья, срывать крыши домов, а иногда и разрушать здания.",
                "Извержение вулкана не несёт большой опасности для людей.",
                "Причиной большинства цунами являются землетрясения, которые происходят в океане, под водой.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#18d945", "#f74f5a"]}
            />,
            <Emphas
              quiz="Выбери правильные ответы."
              ans={[
                {
                  q: "Как называется предупредительный сигнал оповещения населения в случае стихийных бедствий?",
                  arr: ["Внимание всем!", "Тревога!", "Опасность!"],
                },
                {
                  q: "Как доводится до населения этот сигнал?",
                  arr: ["способом включения сирен", "рассылается по электронной почте", "с помощью телефонных звонков на мобильные телефоны"],
                },
                {
                  q: "Что должны сделать люди, услышав этот сигнал?",
                  arr: ["включить радио или телевизор и прослушать экстренное сообщение", "покинуть помещение и укрыться в подвалах или подземных переходах", "прибыть на железнодорожный вокзал или автовокзал"],
                },
              ]}
              trueans={[0, 0, 0]}
            />,
            <Imgdrop
              quiz={"Найди нужный заголовок к каждому набору действий и перенеси его в прямоугольник."}
              ans={[
                <>Закрыть двери, окна и ставни.<br /> Выключить газ и электричество. <br />Перенести на верхние этажи (чердаки) зданий ценные вещи и имущество.<br /> Подняться на верхний этаж здания или крышу.</>,
                <>Закрыть двери, окна и ставни.<br /> Выключить газ и электричество.<br /> Погасить огонь в печи или камине. <br />Собрав необходимые вещи и документы, спуститься в укрытие (подвал).</>,
              ]}
              ansImg={false}
              col={6}
              arr={[
                [],
                [],
                [{ id: "1", content: "Действия в случае внезапного затопления" }],
                [{ id: "2", content: "Действия в случае урагана или смерча" }],
              ]}
              arrImg={false}
              trueans={["1", "2"]}
              h="calc(2rem + 5vw)"
              w="calc(5rem + 12vw)"
              hq="calc(2rem + 9vw)"
            />,
            <Select
              quiz="Какие предметы необходимо взять с собой, если поступило сообщение о начале эвакуации? Выбери всё необходимое из предложенного списка."

              img={i1_10_8}

              ans={[
                { q: "документы", id: 0, a: true },
                { q: "лекарства", id: 1, a: true },
                { q: "ролики", id: 2, a: false },
                { q: "запас продуктов", id: 3, a: true },
                { q: "учебники", id: 4, a: false },
                { q: "запасы воды", id: 5, a: true },
                { q: "любимые игрушки", id: 6, a: false },
                { q: "ценности", id: 7, a: true },
                { q: "тёплые вещи", id: 8, a: true },
                { q: "телевизор", id: 9, a: false },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <Select
              quiz="Где можно спрятаться, если ураган застал тебя на открытой местности? Закрась правильные ответы."

              ans={[
                { q: "на дне оврага", id: 0, a: true },
                { q: "за деревом", id: 1, a: false },
                { q: "в автомобиле", id: 2, a: false },
                { q: "на возвышенном месте", id: 3, a: false },
                { q: "в придорожной канаве", id: 4, a: true },
                { q: "на мосту", id: 5, a: false },
              ]}
              addCl={"text-success"}
            />,
            <Select
              quiz="Что будет представлять наибольшую опасность для жизни, если ты выйдешь на
            улицу сразу после стихийного бедствия?"

              img={i1_10_9}

              ans={[
                { q: "грязь и кучи мусора", id: 0, a: false },
                { q: "оборванные электропровода", id: 1, a: true },
                { q: "стоящие на обочине дороги машины", id: 2, a: false },
                { q: "поваленные деревья", id: 3, a: false },
                { q: "нависающие на зданиях части предметов", id: 4, a: true },
              ]}
              addCl={"text-danger"}
              imgsize="20%"
            />,
          ],
        },
        {
          title: "Тема №11. Правила безопасности летом на водоёмах",
          quests: [
            <Select
              quiz="Зачеркни неверные утверждения."
              ans={[
                { q: "Летом на водоёмах нужно обязательно соблюдать правила безопасного поведения.", id: 0, a: false },
                { q: "Тот, кто хорошо умеет плавать, не может утонуть.", id: 1, a: true },
                { q: "Дети должны купаться строго под присмотром взрослых.", id: 2, a: false },
                { q: "Если ты пошёл купаться с друзьями, то тебе не грозит беда, потому что друзья всегда смогут спасти тебя.", id: 3, a: true },
              ]}
              addCl={"perek"}
            />,
            <ImagePic
              imgArr={[i1_11_1, i1_11_2, i1_11_3]}
              trueans={[1]}
              quiz="Кто из ребят прав?"
            />,
            <Subsequence
              img={i1_11_10}
              trueans={["1", "3", "4", "2"]}
              arrans={["", "", "", ""]}
              quiz="Установи соответствие между рисунками и правилами поведения на воде. Напечатай возле каждого
        правила подходящую цифру."
              ans={[
                "Нельзя подплывать к движущимся судам, лодкам, катерам, катамаранам, гидроциклам.",
                "Нельзя нырять и долго находиться под водой.",
                "Нельзя в воде хватать друг друга за руки или ноги.",
                "Нельзя подавать сигналы ложной тревоги.",
              ]}
              col={[11, 11, 8, 4]}
            />,
            <ImagePic
              imgArr={[i1_11_4, i1_11_5, i1_11_6, i1_11_7, i1_11_8, i1_11_9]}
              trueans={[3]}
              quiz="Какой знак устанавливают в тех местах, где купание запрещено?"
            />,
            <SelectedWord
              quiz={"Заполни пропуски в предложении."}
              arrText={["Лучшим временем для принятия водных процедур является время с ",
                " утра и ",
                " вечера.",


              ]}
              img={i1_11_14}
              arrWord={[["4–6 часов", "9–11 часов", "20–22 часов", "17–19 часов"], ["4–6 часов", "9–11 часов", "20–22 часов", "17–19 часов"]]}
              trueAns={["1", "3"]}
            />,
            <Select
              quiz="Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              quiz2="В каких правилах поведения на воде пропущено слово НЕЛЬЗЯ?"
              img={mouse}
              ans={[
                { q: "______ нырять, если не знаешь глубины и рельефа дна.", id: 0, a: false },
                { q: "______ надевать головной убор в солнечную погоду.", id: 1, a: true },
                { q: "______ купаться, если только что поел.", id: 2, a: false },
                { q: "______ купаться под присмотром взрослых.", id: 3, a: true },
                { q: "______ купаться в загрязнённой воде.", id: 4, a: false },
                { q: "______ заплывать за буйки.", id: 5, a: false },
              ]}
              addCl={"text-white"}
              imgsize={"30%"}
            />,
            <Select
              quiz="При каких погодных условиях нельзя купаться?"
              quiz2="В каких правилах поведения на воде пропущено слово НЕЛЬЗЯ?"
              img={i1_11_15}
              ans={[
                { q: "шторм", id: 0, a: true },
                { q: "тепло и солнечно", id: 1, a: false },
                { q: "гроза", id: 2, a: true },
                { q: "пасмурно и холодно", id: 3, a: true }
              ]}
              addCl={"text-danger"}
              imgsize={"30%"}
            />,
            <ImagePic
              imgArr={[i1_11_16, i1_11_17, i1_11_18, i1_11_19]}
              trueans={[1, 3]}
              quiz="Рассмотри картинки. В каких случаях дети нарушили правила поведения на воде?"
            />,
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение,
      нажав в нём левой клавишей мыши."
              arr={[
                "Нельзя стоять и играть в тех местах, откуда можно упасть в воду.",
                "Плавать на лодке можно и без взрослых, так как это безопасно.",
                "Если в воде у вас ногу свела судорога, необходимо сразу же позвать на помощь.",
                "Для плавания можно использовать разные самодельные устройства.",
                "Не умеющим плавать детям купаться можно только в специально оборудованных местах глубиной не более 1 метра!"
              ]}
              trueans={["#32adf0", "#f74f5a", "#32adf0", "#f74f5a", "#32adf0"]}
            />,
            <Rebus
              img={i1_11_20}
              quiz="Разгадай ребус и запиши, что является одной из причин несчастных случаев на воде."
              trueans={"ПАНИКА"}
            />,

          ],
        },
        {
          title: "Тема №12. Правила безопасности в лесу летом. Разведение костра",
          quests: [
            <Select
              quiz="Выбери верные утверждения."
              ans={[
                { q: "Детям нельзя ходить в лес без взрослых.", id: 0, a: true },
                { q: "Детям можно ходить в лес либо со взрослыми, либо с собакой.", id: 1, a: false },
                { q: "Одежда, в которой вы идёте в лес, не должна быть яркой, чтобы быть как можно менее заметным в лесу.", id: 2, a: false },
                { q: "Одежда, в которой вы идёте в лес, должна быть ярких цветов, чтобы вас было хорошо видно издалека.", id: 3, a: true }
              ]}
              addCl={"text-success"}
            />,
            <ImagePic
              imgArr={[i1_12_1, i1_12_2, i1_12_3, i1_12_4, i1_12_5, i1_12_6, i1_12_7, i1_12_8, i1_12_9, i1_12_10]}
              trueans={[0, 3, 6, 7, 8]}
              quiz="Из предложенных вариантов выбери одежду и обувь для похода в лес.
            Отметь все подходящие картинки (щёлкни по ним левой кнопкой мыши)."
            />,
            <SelectedWord
              quiz={"Заполни пропуск в предложении. Выбери правильный ответ из выпадающего списка."}
              arrText={["Возвратиться из леса нужно ",
                ".",
              ]}
              arrWord={[["до обеда", "до дождя", "до рассвета", "до наступления темноты"]]}
              trueAns={["3"]}
            />,
            <PickTrue
              trueans={["Можно", "Нельзя", "Нельзя", "Нельзя", "Нельзя", "Можно", "Нельзя", "Нельзя"]}
              arrans={["Можно", "Нельзя"]}
              quiz="Вспомни, что можно и что нельзя делать в лесу."
              ans={[
                "Собирать лесную землянику.",
                "Трогать детёнышей животных, птенцов, уносить их с собой.",
                "Оставлять осколки стекла, стеклянную посуду.",
                "Бросать горящие спички.",
                "Ловить незнакомых насекомых.",
                "Фотографировать растения и животных.",
                "Шуметь, слушать громкую музыку.",
                "Оставлять мусор."
              ]}
            />,
            <Select
              quiz="Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              quiz3="Ты с родителями идёшь в лес. Какой набор предметов должен быть у тебя
              в рюкзаке на тот случай, если ты потеряешься?
              Нужно выбрать 4 ответа."
              ans={[
                { q: "свисток", id: 0, a: false },
                { q: "питьевая вода", id: 1, a: false },
                { q: "любимая игрушка", id: 2, a: true },
                { q: "скакалка", id: 3, a: true },
                { q: "заряженный мобильный телефон", id: 4, a: false },
                { q: "шоколадка", id: 5, a: false },
                { q: "корзинка", id: 6, a: true },
                { q: "фотоаппарат", id: 7, a: true },
              ]}
              addCl={" text-white"}
              img={mouse}
              imgsize="25%"
            />,
            <PickTrue
              trueans={["Да", "Нет", "Нет", "Да", "Нет", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Вспомни, как правильно действовать, если ты заблудился в лесу."
              quiz2="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и прямоугольник
        со словом «нет» – если неверное."
              ans={[
                "Оставайся на месте.",
                "Не стой на одном месте, двигайся вперёд.",
                "Чтобы сориентироваться, залезь на высокое дерево.",
                "Используй свисток, а если его нет, стучи палкой по дереву.",
                "Не звони родителям, потому что тебя могут наказать, а старайся выбраться сам. ",
                "Береги заряд телефона, не слушай музыку, не смотри картинки, не играй в игры."
              ]}
            />,
            <Rebus
              img={i1_12_11}
              quiz="Разгадай ребус и запиши, как называется прибор, помогающий ориентироваться на местности."
              trueans={"КОМПАС"}
            />,
            <Select
              quiz="Где нельзя разводить костёр?"
              img={i1_12_12}
              ans={[
                { q: "под кронами деревьев", id: 0, a: true },
                { q: "в густом кустарнике", id: 1, a: true },
                { q: "в высокой сухой траве", id: 2, a: true },
                { q: "на специальных площадках, отделённых противопожарной полосой", id: 3, a: false }
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <Select
              quiz="На каком расстоянии от деревьев допустимо разводить в лесу костёр?"
              img={i1_12_13}
              ans={[
                { q: "на любом расстоянии", id: 0, a: false },
                { q: "на расстоянии 50–100 сантиметров", id: 1, a: false },
                { q: "на расстоянии 1–2 метров", id: 2, a: false },
                { q: "на расстоянии 4–6 метров", id: 3, a: true }
              ]}
              addCl={"text-success"}
              imgsize="80%"
            />,
            <DropwordList
              quiz="Как нужно действовать, если ты решил развести в лесу костёр? Расставь перечисленные
            действия в правильной последовательности (сверху вниз)."
              ans={[
                [],
                [],
                [],
                [],
                [{ id: "1", content: "После подготовки территории необходимо снять дёрн на том месте, где будет разводиться костёр." }],
                [{ id: "2", content: "В ямке, образовавшейся после снятия дёрна, развести костёр." }],
                [{ id: "3", content: "Выбрать подходящее для разведения костра  место." }],
                [{ id: "4", content: "От места предполагаемого костра отгрести сухие листья, ветви, хвою, усохшую траву на расстояние 2–3 метра." }],
              ]}
              trueans={["3", "4", "1", "2"]}
              h={90}
            />,
          ],
        },
        {
          title: "Тема №13. Правила безопасности в лесу летом. Ядовитые растения и грибы. Опасные встречи с животными",
          quests: [
            <Select
              quiz="Выбери верные утверждения."
              ans={[
                { q: "Чтобы уберечься от клещей при походе в лес, нужно надеть шапку или панаму, куртку или свитер с длинными рукавами, плотные штаны, которые нужно вправить в резиновые сапоги.", id: 0, a: true },
                { q: "Нельзя трогать детёнышей животных и уносить их с собой, даже если рядом не видно их матери.", id: 1, a: true },
                { q: "Нельзя трогать гнёзда ос, шмелей, пчёл.", id: 2, a: true },
                { q: "Собирать ягоды и грибы в лесу нужно только со взрослыми.", id: 3, a: true },
                { q: "Незнакомые ягоды и грибы нужно пробоваться на вкус.", id: 4, a: false },
                { q: "Ядовитые ягоды и грибы всегда горькие.", id: 5, a: false }
              ]}
              addCl={"text-success"}
            />,
            <Emphas
              quiz="Определи, какое насекомое изображено на каждой картинке. Выбери его название."
              ans={[
                {
                  q: i1_13_1,
                  arr: ["Шмель", "Пчела", "Оса"],
                },
                {
                  q: i1_13_2,
                  arr: ["Шмель", "Пчела", "Оса"],
                },
                {
                  q: i1_13_3,
                  arr: ["Шмель", "Пчела", "Оса"],
                },

              ]}
              trueans={[1, 2, 0]}
              ansImg={true}
            />,
            <Select
              quiz="Вспомни, какую помощь нужно оказать человеку при укусах насекомых: ос, пчёл, шмелей.
          Удали неправильные пункты."
              img={i1_13_4}
              ans={[
                { q: "Извлечь жало, если оно осталось в ранке.", id: 0, a: false },
                { q: "Промыть рану и приложить грелку.", id: 1, a: true },
                { q: "Промыть рану и приложить лёд (холод).", id: 2, a: false },
                { q: "Заклеить рану пластырем.", id: 3, a: true },
                { q: "Дать пострадавшему обильное питьё.", id: 4, a: false },
                { q: "Обеспечить покой и доступ свежего воздуха.", id: 5, a: false },
                { q: "В тяжёлых случаях вызвать скорую помощь или доставить пострадавшего в больницу.", id: 6, a: false },
              ]}
              addCl={"text-white"}
              imgsize="20%"
            />,
            <SelectedWord
              quiz={"Определи, о какой змее говорится в каждом предложении. Выбери правильный ответ из выпадающего списка."}
              arrText={["",
                <> можно узнать по тёмной зигзагообразной полосе на спине. <br /></>,
                <> можно узнать по двум жёлтым или оранжевым пятнам на голове.</>
              ]}
              arrWord={[["Ужа", "Гадюку"], ["Ужа", "Гадюку"]]}
              trueAns={["1", "0"]}
            />,
            <Select
              quiz="Зачеркни неверные утверждения."
              ans={[
                { q: "Змеи – агрессивные существа. Они всегда нападают первыми.", id: 0, a: true },
                { q: "Змеи – пугливые существа. Просто так они не нападают на человека.", id: 1, a: false },
                { q: "Змеи могут укусить с целью самозащиты.", id: 2, a: false },
                { q: "Змеи не могут укусить человека ни в каком случае.", id: 3, a: true },
                { q: "Если укусила змея, нужно немедленно обратиться в больницу.", id: 4, a: false },
                { q: "Укус змеи не несёт опасности для человека, поэтому обращаться к врачу необязательно.", id: 5, a: true }
              ]}
              addCl={"perek"}
            />,
            <Imgdrop
              quiz={"Что означают сигналы светофора? Перенесите под каждый рисунок подходящую запись."}
              ans={["Бледная поганка", "Мухомор"]}
              ansImg={false}
              col={3}
              col2={3}
              arr={[
                [],
                [],
                [{ id: "1", content: i1_13_5 }],
                [{ id: "2", content: i1_13_6 }],
                [{ id: "3", content: i1_13_7 }],
                [{ id: "4", content: i1_13_8 }],
                [{ id: "5", content: i1_13_9 }],
                [{ id: "6", content: i1_13_10 }],

              ]}
              arrImg={true}
              trueans={["3", "2"]}
              h={"11vw"}
              w={"16vw"}
            />,
            <Select
              quiz="Какие симптомы наблюдаются у человека, который отравился грибами?"
              img={i1_13_11}
              ans={[
                { q: "тошнота, рвота", id: 0, a: true },
                { q: "диарея", id: 1, a: true },
                { q: "боль в горле", id: 2, a: false },
                { q: "сильные боли в животе", id: 3, a: true },
                { q: "выпадение волос", id: 4, a: false },
                { q: "повышенная температура тела", id: 5, a: true },
                { q: "заложенность носа", id: 6, a: false },
                { q: "кашель", id: 7, a: false },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <Select
              quiz="Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              quiz3="Какую помощь нужно оказать человеку, у которого после употребления в пищу
              грибов появилась боль в животе, тошнота, озноб, диарея?"
              img={mouse}
              ans={[
                { q: "вызвать врача", id: 0, a: false },
                { q: "поставить горчичники на область груди", id: 1, a: true },
                { q: "дать выпить как можно больше воды и вызвать рвоту", id: 2, a: false },
                { q: "предложить какую-нибудь таблетку", id: 3, a: true },
                { q: "дать выпить активированный уголь", id: 4, a: false },
                { q: "хорошо покормить", id: 5, a: true },
              ]}
              addCl={"text-white"}
              imgsize="25%"
            />,
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
            нём левой клавишей мыши."
              arr={[
                "Нельзя пробовать на вкус ягоды, в которых сомневаешься, как бы аппетитно они не выглядели.",
                "Все ягоды, растущие в лесу, съедобны и полезны.",
                "Ядовитые ягоды способны не только вызвать отравление, но и привести к смерти.",
                "Ядовитыми бывают только чёрные ягоды.",
                "Если ягода красного или жёлтого цвета, то её смело можно употреблять в пищу."
              ]}
              trueans={["#32adf0", "#f74f5a", "#32adf0", "#f74f5a", "#f74f5a"]}
            />,
            <ImagePic
              imgArr={[i1_13_12, i1_13_13, i1_13_14, i1_13_15, i1_13_16, i1_13_17]}
              trueans={[0, 3, 4]}
              quiz="Рассмотри картинки и отметь те, на которых изображены ядовитые растения."
            />
          ],
        },
        {
          title: "Тема №14. Пожарная безопасность (общие вопросы)",
          quests: [
            <ImagePic
              imgArr={[i1_14_1, i1_14_2, i1_14_3, i1_14_4, i1_14_5, i1_14_6, i1_14_7, i1_14_8,]}
              trueans={[0, 1, 2, 3, 5, 7]}
              quiz="Выбери предметы, неосторожное обращение с которыми может привести к пожару."
            />,
            <Select
              quiz="Какие жидкости легко воспламеняются?"

              img={i1_14_9}
              ans={[
                { q: "бензин", id: 0, a: true },
                { q: "керосин", id: 1, a: true },
                { q: "ягодный сироп", id: 2, a: false },
                { q: "томатный сок", id: 3, a: false },
                { q: "жидкое мыло", id: 4, a: false },
                { q: "ацетон", id: 5, a: true },
              ]}
              addCl={"text-success"}
              imgsize="35%"
            />,
            <Select
              quiz="По каким номерам телефонов нужно звонить в случае пожара? Закрась правильные ответы
          красным цветом."
              img={i1_14_10}
              ans={[
                { q: "101", id: 0, a: true },
                { q: "102", id: 1, a: false },
                { q: "103", id: 2, a: false },
                { q: "104", id: 3, a: false },
                { q: "112", id: 4, a: true },
              ]}
              addCl={"text-danger"}
              imgsize="30%"
            />,
            <Select
              quiz="Что может стать причиной гибели людей при пожаре?"
              img={i1_14_11}
              ans={[
                { q: "огонь", id: 0, a: true },
                { q: "дым", id: 1, a: true },
                { q: "паника", id: 2, a: true },
                { q: "недостаток кислорода", id: 3, a: true },
                { q: "обрушение зданий", id: 4, a: true },
                { q: "солнечный свет", id: 5, a: false },
              ]}
              addCl={"text-success"}
              imgsize="80%"
            />,
            <Select
              quiz="Что нужно сообщить по телефону диспетчеру при вызове пожарной службы?"
              ans={[
                { q: "что горит", id: 0, a: true },
                { q: "свой рост и вес", id: 1, a: false },
                { q: "класс, в котором учишься", id: 2, a: false },
                { q: "свою фамилию", id: 3, a: true },
                { q: "оточный адрес", id: 4, a: true },
                { q: "номер телефона", id: 5, a: true },
              ]}
              addCl={"text-success"}
            />,
            <ColorPic
              ans="Если огонь небольшой, можно попробовать сразу же затушить его. Какими способами это
      можно сделать? Выдели правильные ответы синим цветом."

              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
  нём левой клавишей мыши."
              arr={[
                "Набросить на него плотную ткань или одеяло.",
                "Забросать его ненужными газетами или журналами.",
                "Вылить на него ведро (кастрюлю) воды.",
                "Поднести к нему вентилятор."
              ]}
              trueans={["#32adf0", "#000", "#32adf0", "#000"]}
            />,
            <Select
              quiz="Можно ли пожаре пользоваться лифтом?"
              img={i1_14_12}
              ans={[
                { q: "можно", id: 0, a: false },
                { q: "нельзя", id: 1, a: true },
                { q: "можно только тем, кто живёт выше пятого этажа", id: 2, a: false },
                { q: "можно только тем, кто живёт ниже пятого этажа", id: 3, a: false },
              ]}
              addCl={"text-success"}
              imgsize="80%"
            />,
            <PickTrue
              trueans={["Нет", "Да", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и
      прямоугольник со словом «нет» – если неверное."
              ans={[
                "Если в доме возник пожар, нужно вызвать пожарных и спрятаться где-нибудь, лучше в шкафу или под кроватью.",
                "Если в доме возник пожар, нужно выбежать на улицу, закрыв за собой все двери, и сразу же вызвать пожарных.",
                "Если огонь не позволяет покинуть помещение, то нужно вызвать пожарных и укрыться на балконе.",
                "Огонь очень опасен, но ещё более опасен при пожаре дым.",
                "Дым при пожаре очень затрудняет видимость, никакой другой опасности он не несёт.",
              ]}
            />,
            <Select
              quiz="Выбери правильные ответы."
              newquiz1="Ты проснулся утром и увидел, что в квартире много дыма. Как правильно действовать в
    этой ситуации?"
              ans={[
                { q: "побыстрее вскочить с кровати и бежать к выходу", id: 0, a: false },
                { q: "спокойно встать с кровати и слегка пригнувшись двигаться к выходу", id: 1, a: false },
                { q: "скатиться с кровати прямо на пол и на четвереньках или ползком пробираться к выходу", id: 2, a: true },
              ]}
              newquiz2={"Что поможет защититься от дыма?"}
              ansnew={[
                { q: "солнцезащитные очки", id: 3, a: false },
                { q: "мокрое полотенце (ткань)", id: 4, a: true },
                { q: "дезодорант", id: 5, a: false },
                { q: "распылитель", id: 6, a: false },
              ]}
              addCl={"text-success"}
            />,
            <Select
              quiz="Прочитай вопрос Дум Думыча. Оставь только верные ответы, а остальные удали."
              quiz3="В каких правилах пожарной безопасности пропущено слово НЕЛЬЗЯ?"
              img={mouse}
              ans={[
                { q: "______ баловаться дома со спичками и зажигалками.", id: 0, a: false },
                { q: "______ выключать электроприборы, уходя из комнаты или из дома.", id: 1, a: true },
                { q: "______ сушить бельё над плитой.", id: 2, a: false },
                { q: "______ зажигать свечи или бенгальские огни, если ты один дома.", id: 3, a: false },
                { q: "______ без взрослых подходить к печке и открывать печную дверцу.", id: 4, a: false },
                { q: "______ в случае пожара звать людей на помощь.", id: 5, a: true },
              ]}
              addCl={"text-white"}
              imgsize="25%"
            />,
          ],
        },
        {
          title: "Тема №15. Пожарная безопасность (утечка газа, загорание электроприбора, пожар в школе и др.)",
          quests: [
            <Select
              quiz="Что может стать причиной пожара в общественном месте, в квартире, загородном доме?"
              img={i1_15_1}
              ans={[
                { q: "замыкание в неисправной электропроводке", id: 0, a: true },
                { q: "неосторожное обращение с огнём", id: 1, a: true },
                { q: "использование неисправных электроприборов", id: 2, a: true },
                { q: "забытый включённый утюг", id: 3, a: true },
                { q: "утечка и взрыв газа", id: 4, a: true },
                { q: "соблюдение правил пожарной безопасности", id: 5, a: false },
              ]}
              addCl={"podperek"}
              imgsize="30%"
            />,
            <Select
              quiz="Можно ли детям самостоятельно зажигать газовую плиту?"
              img={i1_15_2}
              ans={[
                { q: "можно, если нужно разогреть обед, а никого нет дома", id: 0, a: false },
                { q: "можно, если в квартире или доме есть огнетушитель", id: 1, a: false },
                { q: "можно, если тебе больше семи лет", id: 2, a: false },
                { q: "нельзя", id: 3, a: true },
              ]}
              addCl={"text-success"}
              imgsize="30%"
            />,
            <Select
              quiz="Одна из самых частых причин бытовых пожаров – загоревшееся на сковороде масло. Что
        нужно делать в такой ситуации?"
              img={i1_15_3}
              ans={[
                { q: "Залить пламя водой.", id: 0, a: false },
                { q: "Закрыть пламя металлической крышкой.", id: 1, a: true },
                { q: "Немедленно выключить горелку.", id: 2, a: true },
              ]}
              addCl={"text-success "}
              imgsize="40%"
            />,
            <PickTrue
              trueans={["Нельзя", "Нужно", "Нужно", "Нельзя", "Нельзя", "Нужно", "Нельзя", "Нельзя"]}
              arrans={["Нельзя", "Нужно"]}
              quiz="Как известно, утечка газа – частая причина пожаров. Ты зашёл в дом и почувствовал запах
      газа. Что обязательно нужно делать в этой случае, а чего делать нельзя?"
              ans={[
                "включать свет",
                "перекрывать кран на газовой трубе",
                "открывать окна и проветривать помещение",
                "пользоваться телефоном",
                "включать в сеть электроприборы",
                "вызывать газовую службу",
                "зажигать спички",
                "пользоваться зажигалкой",
              ]}
            />,
            <Select
              quiz="Как правильно действовать, если загорелся электрический прибор? Найди один неверный
        ответ и зачеркни его."
              ans={[
                { q: "Загоревшийся электроприбор быстро залить водой.", id: 0, a: true },
                { q: "Загоревшийся электроприбор отключить от сети и укрыть одеялом.", id: 1, a: false },
                { q: "Если загоревшийся электроприбор невозможно отключить от сети, место горения засыпать землёй из цветочного горшка.", id: 2, a: false },
                { q: "Если в первые минуты справиться с загоранием не удалось, и огонь вышел за пределы корпуса электроприбора, срочно покинуть помещение, так как выделяющийся при горении электроприбора дым очень токсичен.", id: 3, a: false },
              ]}
              addCl={"perek"}
            />,
            <SelectedWord
              quiz="Как правильно вести себя, если в школе случился пожар? С помощью выпадающего
      списка вставь слово НУЖНО или НЕЛЬЗЯ в каждое правило."
              arrText={["После сигнала пожарной сирены ",
                <> паниковать и бежать одному по зданию школы. <br /></>,
                <> в точности выполнять все указания учителя. <br /></>,
                <> по команде учителя эвакуироваться из здания в соответствии с определённым порядком. <br /></>,
                <> мешать своим товарищам. <br /></>,
                <>помогать малышам и одноклассникам. <br /> При выходе из здания </>,
                <>находиться в месте, указанном учителем.</>

              ]}
              arrWord={[["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"]]}
              trueAns={["1", "0", "0", "1", "0", "0"]}
            />,
            <Imgdrop
              quiz={"Найди верное окончание предложения и перенеси его."}
              ans={[
                "Если комнаты задымлены,",
                "Если огонь отрезал путь к выходу,",
                "Если вы отрезаны в замкнутом помещении,",
              ]}
              ansImg={false}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "откройте окно или разбейте стекло и зовите на помощь." }],
                [{ id: "2", content: "стучите в стены, пол, потолок, чтобы Вас услышали люди." }],
                [{ id: "3", content: "передвигайтесь к выходу ползком, опустив голову вниз." }],
              ]}
              arrImg={false}
              trueans={["3", "1", "2"]}
              h="calc(1rem + 5vw)"
              w="calc(5rem + 20vw)"
              hq="calc(2rem + 5vw)"
            />,
            <ColorPic
              ans="Как правильно поступить, если на тебе загорелась одежда и сбросить её не получается?
  Выдели все верные ответы синим цветом."

              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
нём левой клавишей мыши."
              arr={[
                "Побежать как можно быстрее.",
                "Упасть и кататься по полу, по земле.",
                "Упасть в лужу или сугроб, если они есть рядом.",
                "Вылить на себя воду."
              ]}
              trueans={["#000", "#32adf0", "#32adf0", "#32adf0"]}
            />,
            <Rebus
              quiz="Как называется процесс организованного движения людей из здания наружу или в
безопасную зону в случае возникновения пожара? Напиши слово, состоящее из букв изображенных на картинке."
              img={i1_15_5}
              trueans={"ЭВАКУАЦИЯ"}
            />,
            <Rebus
              quiz="Разгадай ребус."
              img={i1_15_4}
              trueans={"ПОЖАРНЫЙ"}
            />,
          ],
        },
        {
          title: "Тема №16. ТБ дома",
          quests: [
            <ImagePic
              imgArr={[i1_16_1, i1_16_2, i1_16_3, i1_16_4, i1_16_5, i1_16_6, i1_16_7, i1_16_8]}
              trueans={[0, 1, 2, 4, 5, 7]}
              quiz="Укажи картинки, на которых изображены источники опасности, которые могут подстерегать
              нас дома."
            />,
            <Select
              quiz="Что нельзя делать, когда в комнате открыто окно?"
              img={i1_16_9}
              ans={[
                { q: "высовываться из окна", id: 0, a: true },
                { q: "ложиться на подоконник", id: 1, a: true },
                { q: "садиться на подоконник", id: 2, a: true },
                { q: "смотреть в окно", id: 3, a: false },
                { q: "сидеть на стуле возле окна", id: 4, a: false },
                { q: "подходить к окну", id: 5, a: false },
                { q: "вставать на подоконник", id: 6, a: true },
                { q: "поливать цветы на подоконнике", id: 7, a: false },
              ]}
              addCl={"podperek"}
            />,
            <Select
              quiz="Балкон – одно из самых опасных мест в квартире. Выбери действия, которые несут вред жизни и
            здоровью."
              img={i1_16_10}
              ans={[
                { q: "свешиваться через перила", id: 0, a: true },
                { q: "сидеть на перилах", id: 1, a: true },
                { q: "толкаться", id: 2, a: true },
                { q: "устраивать на балконе подвижные игры", id: 3, a: true },
                { q: "читать книгу", id: 4, a: false },
                { q: "смотреть в бинокль", id: 5, a: false }

              ]}
              addCl={"text-danger"}
              imgsize="50%"
            />,
            <ImagePic
              imgArr={[i1_16_11, i1_16_12, i1_16_13, i1_16_14, i1_16_15]}
              trueans={[4]}
              quiz="В какой бутылке находится опасная для здоровья жидкость?"
            />,
            <Imgdrop
              quiz={"Перенеси каждый рисунок в подходящий прямоугольник."}
              ans={[
                "Можно повредить пальцы",
                "Можно обжечься",
                "Можно отравиться",
              ]}
              ansImg={false}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: i1_16_18 }],
                [{ id: "2", content: i1_16_16 }],
                [{ id: "3", content: i1_16_19 }],
              ]}
              arrImg={true}
              trueans={["2", "1", "3"]}
              h="calc(5rem + 5vw)"
              w="calc(5rem + 10vw)"
              hq="calc(1rem + 5vw)"
            />,
            <Subsequence
              img={i1_16_20}
              trueans={["3", "2", "4", "1"]}
              arrans={["", "", "", ""]}
              quiz="Напечатай номер знака, к которому относится данное правило."
              ans={[
                "Не играй с острыми предметами.",
                "Не играй со спичками и зажигалками.",
                "Не играй с розетками и электроприборами.",
                "Не бери самостоятельно в руки ёмкости к кипятком."]}
              col={[11, 11, 6, 3]}
            />,
            <Emphas
              quiz="Выдели правильные ответы синим цветом."
              ans={[
                {
                  q: "Нельзя включать и выключать электроприборы ______ .",
                  arr: ["холодными руками", "сухими руками", "тёплыми руками", "мокрыми руками"],
                },
                {
                  q: "Электрические приборы нужно выключать из сети ______.",
                  arr: ["только в том случае, когда уходишь из дому", "по завершению их работы"],
                },
                {
                  q: "Пользоваться электроприбором, у которого оголён провод, ______.",
                  arr: ["нужно аккуратно", "нельзя"],
                },
              ]}
              trueans={[3, 1, 1]}
              ansImg={false}
            />,
            <Select
              quiz="Ответь на вопрос Дум Думыча. Зачеркни все неправильные ответы."
              quiz3="Ты один дома. В дверь позвонили. Ты посмотрел в глазок и увидел, что
            перед дверью стоит женщина и просит открыть дверь. В каких случаях
            можно это сделать?"
              img={mouse}
              ans={[
                { q: "Если женщина знает твоё имя и фамилию, а также имена твоих родителей.", id: 0, a: true },
                { q: "Если женщина сообщила, что её попросила зайти твоя мама.", id: 1, a: true },
                { q: "Если женщина говорит, что работает в полиции.", id: 2, a: true },
                { q: "Если эта женщина – ваша родственница, которую ты хорошо знаешь.", id: 3, a: false },
                { q: "Если женщина уверяет, что она школьная подруга твоей мамы, и даже знает, когда ты родился.", id: 4, a: true },
                { q: "Если эта женщина – одна из маминых подруг, и ты её отлично знаешь.", id: 5, a: false }
              ]}
              addCl={"perek"}
              imgsize="40%"
            />,
            <Select
              quiz="Как правильно поступить, если ты один дома, а дверь пытаются открыть или сломать?
          Выбери все правильные ответы."
              ans={[
                { q: "позвонить в полицию", id: 0, a: true },
                { q: "позвонить другу (подруге)", id: 1, a: false },
                { q: "позвонить родителям на работу или соседям", id: 2, a: true },
                { q: "выпрыгнуть в окно", id: 3, a: false },
                { q: "кричать в окно, звать на помощь", id: 4, a: true },
                { q: "поговорить со взломщиком", id: 5, a: false }
              ]}
              addCl={"text-success"}
            />,
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
      нём левой клавишей мыши."
              arr={[
                "Если ты дома один, то прежде чем выйти из квартиры, нужно посмотреть в глазок и убедиться, что на лестничной площадке никого нет.",
                "Если ты идёшь на прогулку во двор и боишься потерять ключ от квартиры, можно спрятать его под ковриком или в каком-нибудь другом укромном месте на лестничной площадке.",
                "Если, возвратившись из школы, ты обнаружил, что потерялись ключи от квартиры, нужно сразу же сказать об этом родителям.",
                "Постучавшего в дверь незнакомого человека можно впустить в квартиру только в том случае, если он говорит, что ему срочно нужно воспользоваться вашим телефоном, чтобы вызвать скорую помощь.",
                "Если в дверь квартиры позвонили, а в глазок никого не видно, ни в коем случае нельзя открывать дверь и проверять, кто звонил."
              ]}
              trueans={["#32adf0", "#f74f5a", "#32adf0", "#f74f5a", "#32adf0"]}
            />,
          ],
        },
        {
          title: "Тема №17. ТБ в школе, общественных местах",
          quests: [
            <ColorPic
              ans={
                "Выдели верные утверждения синим цветом, неверные – красным."
              }
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
      нём левой клавишей мыши."
              arr={[
                "Общественные места – это места, где временно собирается много людей, например школа, театр, кинотеатр, стадион, клуб, торговый центр и т. д.",
                "Общественные места могут стать опасными для жизни и здоровья при чрезвычайной ситуации.",
                "Оказавшись в малознакомом общественном месте, нужно первым делом обратить внимание на запасные и аварийные выходы, чтобы в случае опасности быстро воспользоваться ими.",
                "Единственным источником опасности в общественных местах может быть только пожар.",
              ]}
              trueans={["#32adf0", "#32adf0", "#32adf0", "#f74f5a"]}
            />,
            <SelectedWord
              quiz="Давай проверим, хорошо ли ты знаешь правила безопасного поведения в школе. С помощью
      выпадающего списка вставь слово НУЖНО или НЕЛЬЗЯ в каждое из правил."
              arrText={[
                "",
                <> покидать школу до окончания занятий по расписанию.<br /> Передвигаться по кабинету, лестнице или коридору</>,
                <> шагом. <br /></>,
                <> толкать друг друга, применять физическую силу, бросать различные предметы.<br /> </>,
                <> уступать дорогу взрослым. <br /></>,
                <> играть в активные игры в помещениях, которые не предназначены для этого. <br />При возникновении в школе экстремальных ситуаций </>,
                <> в точности исполнять все указания учителя.</>

              ]}
              arrWord={[["Нужно", "Нельзя"], ["нужно", "нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["Нужно", "Нельзя"], ["нужно", "нельзя"],]}
              trueAns={["1", "0", "1", "0", "1", "0"]}
            />,
            <Select
              quiz="Удали лишние пункты в списке."
              quiz3="Нельзя приносить с собой в школу:"
              img={i1_17_1}
              ans={[
                { q: "петарды", id: 0, a: false },
                { q: "животных", id: 1, a: false },
                { q: "раскраски", id: 2, a: true },
                { q: "карандаши", id: 3, a: true },
                { q: "ядовитые вещества", id: 4, a: false },
                { q: "книги", id: 5, a: true },
                { q: "настольные игры", id: 6, a: true },
                { q: "бутерброды", id: 7, a: true },
                { q: "напитки", id: 8, a: true },
              ]}
              addCl={"text-white"}
              imgsize="50%"
            />,
            <ColorPic
              ans="В школе часто приходится подниматься по лестнице на другой этаж или спускаться. Укажи,
              какие действия на лестнице совершать нельзя. Выдели их красным цветом."
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
      нём левой клавишей мыши."
              arr={[
                "идти шагом",
                "расталкивать окружающих",
                "держаться правой стороны",
                "прыгать через ступеньки",
                "бежать",
                "съезжать по перилам",
                "смотреть себе под ноги",
                "перегибаться через перила",
              ]}
              trueans={["#000", "#f74f5a", "#000", "#f74f5a", "#f74f5a", "#f74f5a", "#000", "#f74f5a"]}
            />,
            <Select
              quiz="Вспомни, как нужно вести себя в кабинете во время перемены. Какие из перечисленных
    действий не являются безопасными и запрещены?"

              img={i1_17_2}
              ans={[
                { q: "раскачиваться на стуле", id: 0, a: true },
                { q: "поливать цветы", id: 1, a: false },
                { q: "сидеть на подоконнике", id: 2, a: true },
                { q: "касаться электропроводки", id: 3, a: true },
                { q: "мыть доску и наводить порядок в классе", id: 4, a: false },
                { q: "открывать окна", id: 5, a: true },
                { q: "резко распахивать или захлопывать дверь", id: 6, a: true },
                { q: "трогать розетки", id: 7, a: true },
                { q: "играть в настольные игры", id: 8, a: false },
                { q: "писать на доске мелом", id: 9, a: false },
              ]}
              addCl={"text-success"}
              imgsize={'70%'}
            />,
            <Select
              quiz="Жители городов нередко оказываются в местах массового скопления людей, посещая
    концерты, праздники, футбольные матчи и т. д. Из-за возникновения паники любое массовое
    скопление людей может превратиться в неуправляемую толпу. Какие правила поведения
    нужно соблюдать, оказавшись в толпе? Зачеркни неверные рекомендации."

              ans={[
                { q: "Если толпа увлекла тебя, сопротивляйся, не иди вместе с ней.", id: 0, a: true },
                { q: "Если толпа увлекла тебя, не сопротивляйся, иди вместе с ней.", id: 1, a: false },
                { q: "Старайся не приближаться к ограждениям, стенам, стеклянным дверям.", id: 2, a: false },
                { q: "Старайся держаться поближе к стенам, ограждениям, стеклянным дверям.", id: 3, a: true },
                { q: "Если ты упал на землю или пол, постарайся как можно быстрее подняться.", id: 4, a: false },
                { q: "Если ты упал на землю или пол, не пытайся подниматься.", id: 5, a: true },
              ]}
              addCl={"perek"}
            />,
            <Select
              quiz="Как правильно нужно держать руки во время движения в толпе?"

              img={i1_17_3}
              ans={[
                { q: "засунуть в карманы", id: 0, a: false },
                { q: "согнуть в локтях и чуть развести в сторону, защищая грудь", id: 1, a: true },
                { q: "опустить вниз вдоль туловища", id: 2, a: false },
                { q: "вытянуть вперёд, сцепив пальцы в замок", id: 3, a: false }
              ]}
              addCl={"text-success"}
              imgsize="80%"
            />,
            <Select
              quiz="Выбери правильные ответы."
              newquiz1="Как правильно действовать, если толпа сбила тебя с ног и ты оказался на полу или на земле?"
              img={i1_17_4}
              ans={[
                { q: "постараться повернуться и лечь на живот, прикрыть голову руками", id: 0, a: false },
                { q: "свернуться клубком и защищать голову руками, прикрывая затылок", id: 1, a: true },
                { q: "стать на колени и ползти", id: 2, a: false },
              ]}
              newquiz2={"Двигаясь в толпе, ты нечаянно уронил вещь. Можно ли её поднимать?"}
              ansnew={[
                { q: "нельзя", id: 3, a: true },
                { q: "можно", id: 4, a: false },
                { q: "можно только в том случае, если эта вещь очень ценная", id: 5, a: false },
              ]}
              addCl={"text-success"}

              imgsize="30%"
            />,
            <Select
              quiz="Как правильно действовать, если ты обнаружил в общественном месте подозрительную сумку?"

              img={i1_17_5}
              ans={[
                { q: "Никому ничего не сказав, покинуть это место как можно быстрее.", id: 0, a: false },
                { q: "Открыть сумку и посмотреть, что в ней находится.", id: 1, a: false },
                { q: "Сообщить о находке сотруднику полиции, а если его нет рядом, то тому, кто отвечает за то помещение, где она найдена (охране, кассиру, продавцу, дежурному по станции и т. д.), или просто взрослому человеку", id: 2, a: true },
                { q: "Взять сумку и занести сумку туда, где нет людей.", id: 3, a: false },
                { q: "Взять сумку и отнести сумку в ближайшее отделение полиции.", id: 4, a: false },
              ]}
              addCl={"podperek"}
              imgsize="30%"
            />,
            <Rebus
              img={i1_17_6}
              quiz="С помощью ребуса определи, какое слово пропущено в пословице. Запиши это слово."
              quiz2="_____ – половина спасенья."
              trueans={"ОПАСЕНЬЕ"}
            />,
          ],
        },
        {
          title: "Тема №18. ТБ на улице",
          quests: [
            <ColorPic
              ans="Какие места не годятся для игр и прогулок? Выдели ответы красным цветом."
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
      нём левой клавишей мыши."
              arr={[
                "стройплощадка",
                "площадка во дворе дома",
                "подвал",
                "вблизи дороги",
                "школьный стадион",
                "пустырь",
                "чердак, крыша",
                "заброшенный парк"
              ]}
              trueans={["#f74f5a", "#000", "#f74f5a", "#f74f5a", "#000", "#f74f5a", "#f74f5a", "#f74f5a"]}
            />,
            <PickTrue
              trueans={["Нет", "Нет", "Нет", "Да"]}
              arrans={["Да", "Нет"]}
              quiz="Если ты согласен с утверждением, закрась ячейку таблицы со словом «да», если не согласен – ячейку таблицы со словом «нет»."
              ans={[
                "Взрослые люди, даже если они незнакомые, всегда хотят тебе добра и не могут причинить вред.",
                "По внешнему виду и выражению лица взрослого человека можно сказу определить, преступник он или нет.",
                "Если незнакомец улыбается, вежлив с тобой, шутит, он не может быть плохим человеком.",
                "По внешности незнакомого человека нельзя определить, какой он человек и какие у него намерения."
              ]}
            />,
            <Select
              quiz="Выполни задание Дум Думыча."
              quiz3="Выбери правила, которые нужно начать со слов НИКОГДА НЕ."

              img={mouse}
              ans={[
                { q: "_____ вступай в разговор с незнакомыми людьми.", id: 0, a: true },
                { q: "_____ садись в машину к незнакомому человеку.", id: 1, a: true },
                { q: "_____ предупреждай родителей, куда ты идёшь гулять и когда вернёшься.", id: 2, a: false },
                { q: "_____ гуляй с наступлением темноты.", id: 3, a: true },
              ]}
              addCl={"text-success"}
              imgsize="25%"
            />,
            <Select
              quiz="Прочитай. Как нужно поступить в данной ситуации?"
              quiz2="Вы с папой договорились, что он встретит тебя после уроков возле школы и вы поедете покупать
    новый велосипед. Когда уроки закончились, ты вышел из школы и стал ждать папу. Неожиданно
    подъехала красивая машина, из неё вышел человек в строгом синем костюме, подошёл к тебе и
    сказал, что у папы срочное совещание, поэтому он не смог приехать. Этот человек также вежливо
    предложил подвезти тебя до дома."
              ans={[
                { q: "Пойдёшь с ним, ведь откуда он мог знать, что ты ждёшь папу.", id: 0, a: false },
                { q: "Сначала аккуратно выяснишь, знает ли он, как зовут тебя и твоего папу. Если знает, смело доверишься этому человеку.", id: 1, a: false },
                { q: "Сначала выяснишь, знает ли он, где работает твой папа. Если знает, позволишь этому человеку подвезти тебя.", id: 2, a: false },
                { q: "Скажешь, что тебе нужно только на минутку зайти в школу, а оттуда позвонишь папе или маме, чтобы всё проверить.", id: 3, a: true },
                { q: "Все перечисленные выше действия правильные.", id: 4, a: false },
              ]}
              addCl={"text-success"}
            />,
            <Imgdrop
              quiz={"Найди верное окончание предложения и перенеси его."}
              ans={[
                "Если ты знаешь, что тебе придётся возвращаться домой в тёмное время суток,",
                "Если, идя по улице вечером, ты заметил, что тебя начинают преследовать,",
                "Если незнакомый человек схватил тебя и пытается куда-то тащить,",
              ]}
              ansImg={false}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: "беги туда, где много людей, больше света и т. д." }],
                [{ id: "2", content: "кричи, кусайся, царапайся, дерись, вырывайся и убегай." }],
                [{ id: "3", content: "позвони родителям и попроси, чтобы тебя встретили." }],
              ]}
              arrImg={false}
              trueans={["3", "1", "2"]}
              h="calc(1rem + 5vw)"
              w="calc(5rem + 20vw)"
              hq="calc(2rem + 5vw)"
            />,
            <Select
              quiz="В каких ситуациях нужно всегда отвечать «НЕТ!»?"
              ans={[
                { q: "Если незнакомый человек предлагает зайти в гости или подвезти домой.", id: 0, a: true },
                { q: "Если незнакомец спрашивает, как найти улицу или дом, и просит проводить.", id: 1, a: true },
                { q: "Если незнакомый человек предлагает тебе помочь ему донести сумку, обещая заплатить.", id: 2, a: true },
                { q: "Если незнакомец останавливает тебя, когда ты начинаешь переход улицы на красный сигнал светофора.", id: 3, a: false },
                { q: "Если незнакомец на улице предлагает тебе поучаствовать в интересном конкурсе или телепередаче.", id: 4, a: true },
                { q: "Если незнакомец угощает тебя конфетами, пирожными или другими сладостями.", id: 5, a: true },
              ]}
              addCl={"text-warning"}
            />,
            <Emphas
              quiz="На улице, во дворе можно часто встретить разных кошек и собак. Знаешь ли ты, как
  правильно вести себя с этими животными? Выбери ответ, который ты считаешь
  правильным."
              ans={[
                {
                  q: "Можно ли гладить или брать на руки незнакомых кошек или собак?",
                  arr: ["Да", "Нет", "Если они дружелюбны"],
                },
                {
                  q: "Можно ли замахиваться на собаку, пытаясь отогнать её, бросать в неё палки и камни?",
                  arr: ["Да", "Нет", "Если она маленькая"],
                },
                {
                  q: "Опасно ли подходить к бездомной собаке, когда у неё маленькие щенки?",
                  arr: ["Да", "Нет", "Только когда она ест"],
                },
              ]}
              trueans={[1, 1, 0]}
              ansImg={false}
            />,
            <Select
              quiz="Ты хотел погладить бездомную собачку, а она укусила тебя. Рана небольшая. Что делать в
    такой ситуации? Зачеркни неверные ответы."
              img={i1_18_1}
              ans={[
                { q: "сразу же сообщить об этом родителям", id: 0, a: false },
                { q: "не стоит тревожить и волновать родителей, если рана небольшая", id: 1, a: true },
                { q: "место укуса промыть чистой водой с мылом в течение 10 минут, потом обработать перекисью водорода", id: 2, a: false },
                { q: "место укуса промывать нельзя, нужно его сразу же обработать йодом", id: 3, a: true },
                { q: "обратиться к врачу по желанию", id: 4, a: true },
                { q: "обратиться к врачу в обязательном порядке", id: 5, a: false },
              ]}
              addCl={"perek"}
              imgsize="50%"
            />,
            <Emphas
              quiz="Выбери правильные ответы."
              ans={[
                {
                  q: "Может ли укус кошки быть опасен для человека?",
                  arr: ["Да", "Нет"],
                },
                {
                  q: "Какая болезнь НЕ может передаться человеку от кошки или собаки?",
                  arr: ["Лишай", "Бешенство", "Чесотка", "Грипп"],
                },
                {
                  q: "Какая из этих болезней смертельно опасна?",
                  arr: ["Лишай", "Бешенство", "Чесотка", "Грипп"],
                },
              ]}
              trueans={[0, 3, 1]}
              ansImg={false}
            />,
            <Rebus
              img={i1_18_2}
              quiz="В пословице пропущено слово. Напиши это слово, состоящее из букв изображенных на картинке."
              quiz2="__________ — МАТЬ БЕЗОПАСНОСТИ
."
              trueans={"ОСТОРОЖНОСТЬ"}
            />,
          ],
        },
        {
          title: "Тема №19. ТБ в компьютерном классе",
          quests: [
            <Select
              quiz="Прочитай вопрос. Отметь правильные ответы."
              quiz3="Почему необходимо соблюдать правила техники безопасности в компьютерном классе?"

              img={i1_19_1}
              ans={[
                { q: "для сохранения жизни и здоровья", id: 0, a: true },
                { q: "этого хочет учитель", id: 1, a: false },
                { q: "этого хочет директор школы", id: 2, a: false },
                { q: "для сохранения техники", id: 3, a: true },
              ]}
              addCl={"text-primary"}
              imgsize="90%"
            />,
            <Select
              quiz={
                "Ответь на вопросы Дум Думыча."
              }
              newquiz1={"Можно ли входить в компьютерный класс без разрешения учителя?"}
              img={mouse}
              ans={[
                { q: "Да", id: 0, a: false },
                { q: "Нет", id: 1, a: true },
              ]}
              newquiz2={"Можно ли перемещаться по классу во время урока без разрешения учителя?"}

              ansnew={[
                { q: "Да", id: 2, a: false },
                { q: "Нет", id: 3, a: true },

              ]}
              addCl={"text-success"}
              imgsize="30%"
            />,
            <Select
              quiz="Какие предметы нельзя приносить с собой в компьютерный класс? Закрась прямоугольники
          с номерами, которыми обозначены эти предметы."
              img={i1_19_2}
              ans={[
                { q: "1", id: 0, a: false },
                { q: "2", id: 1, a: false },
                { q: "3", id: 2, a: true },
                { q: "4", id: 3, a: true },
                { q: "5", id: 4, a: true },
                { q: "6", id: 5, a: true },
                { q: "7", id: 6, a: true },
              ]}
              addCl={"text-success"}
              imgsize="50%"
              gor={true}
              random={true}
            />,
            <ColorPic
              ans="Выдели синим цветом все правильные варианты. Нельзя приходить в компьютерный класс:"
              dec="Сначала выбери цвет на палитре нажатием левой клавиши мыши, затем выдели утверждение, нажав в
нём левой клавишей мыши."
              arr={[
                "с мокрыми руками",
                "во влажной одежде",
                "в светлой обуви",
                "в верхней одежде",
                "с некрасивой причёской",
                "в грязной обуви",
              ]}
              trueans={["#32adf0", "#32adf0", "#000", "#32adf0", "#000", "#32adf0"]}
            />,
            <Select
              quiz="Является ли правильной посадка девочки при работе за компьютером?"
              img={i1_19_3}
              ans={[
                { q: "Да", id: 0, a: false },
                { q: "Нет", id: 1, a: true },
              ]}
              addCl={"text-success"}
              imgsize="60%"
            />,
            <PickTrue
              trueans={["Нельзя", "Нужно", "Нужно", "Нельзя", "Нельзя", "Нужно", "Нельзя"]}
              arrans={["Нужно", "Нельзя"]}
              quiz="Выбери (нажми) на прямоугольник, что нужно, а что нельзя делать при работе за компьютером."
              ans={[
                "трогать руками монитор",
                "делать перерывы и гимнастику для глаз",
                "быть внимательным",
                "трогать провода и соединительные разъёмы",
                "стучать по клавиатуре и бесцельно нажимать клавиши",
                "соблюдать правильную посадку",
                "класть какие-либо предметы на системный блок и клавиатуру",
              ]}
            />,
            <Select
              quiz="Оставь только правильные утверждения, а остальные удали."
              ans={[
                { q: "Садиться можно только за тот компьютер, который укажет учитель.", id: 0, a: false },
                { q: "Садиться можно за любой компьютер.", id: 1, a: true },
                { q: "Включать компьютер можно только с разрешения учителя.", id: 2, a: false },
                { q: "Если ты готов к работе за компьютером, можно его включать, не дожидаясь распоряжения учителя.", id: 3, a: true },
                { q: "Как только ты выполнил все задания, можно выключить компьютер, не сообщая учителю.", id: 4, a: true },
                { q: "Выключать компьютер можно только с разрешения учителя.", id: 5, a: false },
              ]}
              addCl={"text-white"}
            />,
            <Select
              quiz="Как нужно поступить, если во время работы за компьютером ты обнаружил неисправность
        какого-либо устройства?"
              img={i1_19_4}
              ans={[
                { q: "попытаться устранить самостоятельно, если неисправность мелкая", id: 0, a: false },
                { q: "рассказать об этом другу", id: 1, a: false },
                { q: "сразу же сообщить об этом учителю", id: 2, a: true },
                { q: "сначала закончить выполнение задания, а затем сообщить об этом учителю", id: 3, a: false }
              ]}
              addCl={"text-primary"}
              imgsize="80%"
            />,
            <Select
              quiz="Как должен быть расположен монитор по отношению к глазам человека, работающего за
      компьютером? Выбери 2 правильных ответа."
              img={i1_19_5}
              ans={[
                { q: "Монитор должен располагаться на расстоянии 50–70 см от глаз пользователя.", id: 0, a: true },
                { q: "Монитор должен располагаться на расстоянии полтора – два метра от глаз пользователя.", id: 1, a: false },
                { q: "Нижняя часть экрана обязательная должна быть выше уровня глаз.", id: 2, a: false },
                { q: "Верхняя часть экрана должна быть на уровне глаз либо чуть ниже уровня глаз.", id: 3, a: true }
              ]}
              addCl={"text-success"}
              imgsize="50%"
            />,
            <PickTrue
              trueans={["Да", "Да", "Да", "Нет"]}
              arrans={["Да", "Нет"]}
              quiz="Закрась (нажми) прямоугольник со словом «да», если утверждение верное, и
    прямоугольник со словом «нет» – если неверное."
              ans={[
                "Если не соблюдать технику безопасности, то работа за компьютером может принести вред здоровью.",
                "Если во время работы на компьютере ты почувствовал запах гари или услышал необычный звук, нужно сразу же прекратить работу и сообщить об этом учителю.",
                "Если у тебя температура или плохое самочувствие, то работать за компьютером нельзя.",
                "При работе за компьютером нельзя отрывать взгляд от монитора и переводить его на другие предметы.",
              ]}
            />,
          ],
        },
        {
          title: "Тема №20. Безопасность в интернете",
          quests: [
            <Select
              quiz="Ты получил вот такое сообщение от незнакомого человека в социальной сети: «Привет. Я
            знакомый твоей мамы. Она просила, чтобы ты взял дома 500 рублей и передал мне. Я
            подойду к твоему подъезду через час. Выходи.»."
            quiz2="Как правильно поступить в данной ситуации?
            Зачеркни те действия, которые делать нельзя."
              img={i1_20_1}
              ans={[
                { q: "Возьму деньги и через час выйду к подъезду", id: 0, a: true },
                { q: "Позвоню маме и расскажу об этом сообщении", id: 1, a: false },
                { q: "Уточню у человека, не обманывает ли он меня", id: 2, a: true },
                { q: "Ничего не отвечу на сообщение, удалю его, а человека, по возможности, заблокирую в социальной сети", id: 3, a: false },
                { q: "Не буду спускать к подъезду, напишу человеку адрес, пусть зайдёт сам", id: 4, a: true },
              ]}
              addCl={"perek"}
              imgsize="30%"
            />,
            <ColorPic
              ans={
                "Если ты согласен с утверждением, закрасьте ячейку таблицы с ответом зелёным цветом, если нет – ячейку таблицы красным цветом."
              }
              dec="Цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми на неё
          левой клавишей мыши."
              arr={[
                "Нельзя указывать в интернете свой адрес, телефон и места, где ты часто бываешь.",
                "Нельзя выкладывать в интернете фотографии других людей без их согласия.",
                "В интернете можно доверять любой информации.",
                "Посещать в интернете можно только те сайты, в безопасности которых ты уверен (например, сайт своей школы, сайт мышонка Дум Думыча…)",
                "В виртуальном мире незнакомым людям можно писать всё что угодно, даже оскорбления.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#18d945", "#f74f5a"]}
            />,
            <Imgdrop
              quiz={"Найди верное окончание предложения правил безопасности в сети Интернет и перенеси его."}
              ans={[
                "Нельзя копировать и распространять авторские материалы (игры, программы…) –",
                "Не встречайся в реальной жизни с людьми,",
                "При малейшем сомнении или подозрении в обмане",
                "Не загружай программы, музыку, фильмы, игры на компьютер без согласия взрослых",
              ]}
              ansImg={false}
              col={3}
              col2={3}
              arr={[
                [],
                [],
                [],
                [],
                [{ id: "1", content: "с которыми ты познакомился в интернете.", }],
                [{ id: "2", content: "это преследуется по закону.", }],
                [{ id: "3", content: "они могут содержать вирусы и причинить вред компьютеру.", }],
                [{ id: "4", content: "обратись за советом к взрослым (родителям, учителю).", }],
              ]}
              arrImg={false}
              trueans={["2", "1", "4", "3"]}
              h="calc(2rem + 5vw)"
              w="calc(5rem + 15vw)"
              hq="calc(3rem + 5vw)"
            />,
            <Select
              quiz="Вова получил несколько одинаковых писем с сообщением о том, что он выиграл огромную
            сумму. Чтобы получить её, Вове нужно отправить СМС на указанный номер. Вова в раздумье,
            как ему лучше поступить. Выбери два верных варианта поступка."
              img={i1_20_2}
              ans={[
                { q: "Отправлю СМС сразу же, пока выигрыш не достался другому", id: 0, a: false },
                { q: "Подожду ещё одного письма, если пришлют, значит точно не обман", id: 1, a: false },
                { q: "Отправлю СМС с телефона друга (соседа)", id: 2, a: false },
                { q: "Удалю эти письма и СМС отправлять ни в коем случае не буду", id: 3, a: true },
                { q: "Сообщу об этих письмах родителям", id: 4, a: true },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <PickTrue
              trueans={["Ненадежный", "Надежный", "Ненадежный", "Ненадежный", "Надежный", "Надежный", "Ненадежный", "Ненадежный"]}
              arrans={["Надежный", "Ненадежный"]}
              quiz="Ты, наверное, уже знаешь, что необходимо использовать пароли, которые трудно
          подобрать чужим людям. Укажи возле каждого пароля, надежный он или ненадежный. Щелкни левой клавишей мыши на нужное слово."
              ans={[
                "12345",
                "S83Yamw7519",
                "qwerty",
                "12.06.2010",
                "sasha18lena57LKJ",
                "QhR,Pz.,Ebg7",
                "ivanov12",
                "111111",
              ]}
            />,
            <Select
              quiz="В каких правилах нужно на местах пропусков поставить частицу «не»?"
              ans={[
                { q: "Никому и никогда ___ говори свои пароли.", id: 0, a: true },
                { q: "___ храни пароли в открытом доступе и ___ отправляй их по электронной почте.", id: 1, a: true },
                { q: "___ переходи по ссылкам, которые тебе присылают (особенно, если прислал незнакомец).", id: 2, a: true },
                { q: "При общении с незнакомыми людьми ___ используй веб-камеру.", id: 3, a: true },
                { q: "___ рассказывай родителям, если тебя пригласил на встречу незнакомец из сети.", id: 4, a: false },
                { q: "___ вступай в незнакомые сообщества и ___ распространяй по чьей-либо просьбе материалы агрессивного содержания.", id: 5, a: true },
                { q: "___ будь вежливым и дружелюбным в сети, незнакомым людям можно грубить и угрожать.", id: 6, a: false },
              ]}
              addCl={"text-primary"}
            />,

            <ImagePic
              imgArr={[i1_20_3, i1_20_4, i1_20_5, i1_20_6, i1_20_7]}
              trueans={[0, 1, 2, 4]}
              quiz="Каждый из ребят получил по одному сообщению. Какие из них похожи на обман и не стоит на них отвечать (а лучше удалить)?"
            />,
            <Select
              quiz="Ты захотел зарегистрироваться в социальной сети и родители тебе разрешили. Что можно указать (разместить на своей страничке)?"
              img={i1_20_8}
              ans={[
                { q: "страну, город", id: 0, a: true },
                { q: "фотографии родителей без их разрешения", id: 1, a: false },
                { q: "полное ФИО", id: 2, a: false },
                { q: "полный адрес, где проживаешь", id: 3, a: false },
                { q: "номер телефона", id: 4, a: false },
                { q: "свои увлечения", id: 5, a: true },
                { q: "адреса и время посещения кружков", id: 6, a: false },
                { q: "изображение тигра вместо своего фото", id: 7, a: true },
              ]}
              addCl={"podperek"}
              imgsize="60%"
            />,
            <PickTrue
              trueans={["Нельзя", "Нельзя", "Нельзя", "Можно", "Можно"]}
              arrans={["Можно", "Нельзя"]}
              quiz="Отметь, можно или нельзя делать описанные действия."
              ans={[
                "Ты играешь в сети Интернет в интересную игру. Вдруг игра останавливается и тебя просят заплатить, чтобы играть дальше. Можно ли без ведома родителей оплатить игру со своего мобильного телефона?",
                "Вы с другом увидели рекламу в сети Интернет об интересной бесплатной игре. Друг тебе предложил скачать игру на компьютер. Можно это сделать?",
                "Тебе пришло письмо с файлом. Написано, что в этом файле содержится новая версия твоей любимой игры. Можно скачать присланный файл?",
                "Ты играешь в новую компьютерную игру. Тебе пришло подозрительное сообщение. Можно сообщить об этом маме?",
                "Учительница предложила поиграть в интересную интернет-игру по изучению таблицы умножения. Можно ли рассказать об этом родителям?"
              ]}
            />,
            <Rebus
              img={i1_20_9}
              quiz="Разгадай ребус и запиши, как называется преступления в сфере информационных
        технологий, такие как распространение вредоносных программ, взлом паролей, кражу
        номеров банковских карт, распространения ложной информации о ком-либо. За данное
        преступление человек несёт уголовную ответственность."
              trueans={"КИБЕРПРЕСТУПНОСТЬ"}
            />,
          ],
        },
      ],
    },
    {
      title: "ЗОЖ",
      bg: background2,
      class: [
        {
          title: "Тема №1. Основы ЗОЖ",
          quests: [
            <ImagePic
              imgArr={[img2_1_1, img2_1_2, img2_1_3, img2_1_4]}
              trueans={[0]}
              multi={false}
              quiz="Говорят, что организм здорового человека работает как ...
                Какое слово пропущено? Отметь подходящую картинку (нажми на неё)."
            />,
            <Arrow
              quiz="Здоровье человека состоит из физического, психического, социального и духовного
            здоровья. Сопоставь каждое описание. (зажми левой клавишей мыши описание и перетяни его так, что бы описание было напротив правильного ответа."
              ans={[
                "Физическое здоровье",
                "Психическое здоровье",
                "Социальное здоровье",
                "Духовное здоровье",
              ]}
              description={[
                "Человек умеет управлять своим поведением,контролирует свои чувства и эмоции, спокоен",
                "У человека нормальная температура тела, крепкий сон, хороший аппетит, ничего не болит",
                "Человек способен сочувствовать, сопереживать, оказывать помощь другим людям, делать им добро бескорыстно",
                "Человек доброжелателен, умеет правильно выстраивать отношения с родными, друзьями, учителями, уважительно относится к людям",
              ]}
              trueans={[
                "У человека нормальная температура тела, крепкий сон, хороший аппетит, ничего не болит",
                "Человек умеет управлять своим поведением,контролирует свои чувства и эмоции, спокоен",
                "Человек доброжелателен, умеет правильно выстраивать отношения с родными, друзьями, учителями, уважительно относится к людям",
                "Человек способен сочувствовать, сопереживать, оказывать помощь другим людям, делать им добро бескорыстно",
              ]}
            />,
            <Emphas
              quiz="Выдели слова, которые пропущены в этих пословицах."
              quiz2="Кликни левой клавишей мыши по нужными словам"
              ans={[
                {
                  q: "___ лучше всякого лекарства.",
                  arr: ["Торт", "Сон", "Плаванье", "Газировка"],
                },
                {
                  q: "Если хочешь быть здоров – ___.",
                  arr: ["Одевайся", "Не ленись", "Закаляйся", "Убирайся"],
                },
                {
                  q: "___ залог здоровья.",
                  arr: ["Чистота", "Аппетит", "Чтение", "Учёба"],
                },
              ]}
              trueans={[1, 2, 0]}
              ansImg={false}
            />,
            <Dropword />,
            <ColorPic
              ans={
                "Если утверждение верное, закрасьте ячейку таблицы с ответом зелёным цветом, если неверное – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Режим дня – это правильное распределение времени на сон, питание,работу и отдых.",
                "Обязательно нужно мыть руки по приходу домой, до и после еды, после туалета.",
                "Врач-офтальмолог занимается лечение зубов.",
                "Длительность просмотра телевизора не должна превышать 4 часов подряд.",
                "Делать прививки нужно строго по рекомендациям: между первой и последующими прививками должно пройти определенное время в зависимости от вида прививки.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#f74f5a", "#18d945"]}
            />,
            <Arrow
              quiz="Найди к каждому описанию свою пословицу. (зажми левой клавишей мыши описание и перетяни его так, что бы описание было напротив правильно ответа."
              description={[
                "Пищу надо пережёвывать тщательно, чтобы желудку легче было её переварить, и она быстрее усвоится.",
                "Так могут говорить о сильном и здоровом человеке.",
                "Социальное здоровье",
              ]}
              ans={[
                "На нём хоть воду вози",
                "Быстрого да ловкого болезнь не догонит",
                "Кто долго жуёт, тот долго живёт",
              ]}
              trueans={[
                "Так могут говорить о сильном и здоровом человеке.",
                "Социальное здоровье",
                "Пищу надо пережёвывать тщательно, чтобы желудку легче было её переварить, и она быстрее усвоится.",
              ]}
            />,
            <Rebus
              img={rebus1}
              quiz="Разгадай ребус и запиши, как называется процесс введения людям вакцин, препаратов, которые помогают сформировать иммунитет против многих инфекционных заболеваний."
              trueans={"ВАКЦИНАЦИЯ"}
            />,
            <Imgdrop
              quiz={"Перенеси в каждый прямоугольник под описанием нужную картинку.(зажимай картинку левой клавишей мыши и перетаскивай в нужное место)"}
              ans={[
                "Ромашку применяют как успокаивающее, противоспалительное средство. Отваром ромашки полощут горло, например.",
                "Листья подорожника используют для заживления ран, порезов; а также – при укусах пчёл, ос и даже змей.",
                "Иван-чай (кипрей) заваривают как чай. Используют при многих заболеваниях, а также как успокоительное средство."
              ]}
              ansImg={false}
              col={4}
              col2={4}
              arr={[
                [],
                [],
                [],
                [{ id: "1", content: img_1 }],
                [{ id: "2", content: img2 }],
                [{ id: "3", content: img3 }],
              ]}
              arrImg={true}
              trueans={["2", "3", "1"]}
              h="calc(5rem + 10vw)"
              w="calc(5rem + 10vw)"
            />,
            <Select
              quiz={
                "Что в себя включает понятие «Здоровый образ жизни»? Отметь это (нажми)."
              }
              img={docter21}
              ans={[
                { q: "Хорошее настроение", id: 0, a: true },
                { q: "Соблюдение режима дня", id: 1, a: true },
                { q: "Дружба с вредными привычками", id: 2, a: false },
                { q: "Личная гигиена", id: 3, a: true },
                { q: "Свежий воздух", id: 4, a: true },
                { q: "Правильное питание", id: 5, a: true },
                { q: "Подвижный образ жизни", id: 6, a: true },
                { q: "Отказ от занятия спортом", id: 7, a: false },
                { q: "Здоровый сон", id: 8, a: true },
              ]}
              addCl={"text-success"}
              imgsize="40%"
            />,
            <Select
              quiz={
                "Хорошие дружеские отношения помогают сохранять здоровье. Если ты кого-то обидел, надо обязательно попросить прощение. А если обидели тебя, надо уметь прощать. На чём же строятся дружеские отношения? Зачеркни лишнее (нажми на это)."
              }
              img={frends21}
              ans={[
                { q: "Доверие", id: 0, a: false },
                { q: "Уважение", id: 1, a: false },
                { q: "Конфликты", id: 2, a: true },
                { q: "Драки", id: 3, a: true },
                { q: "Искренность", id: 4, a: false },
                { q: "Взаимопонимание", id: 5, a: false },
              ]}
              addCl={"perek"}
              imgsize="80%"
            />,
          ],
        },
        {
          title: "Тема №2. Гигиена тела и рук человека",
          quests: [
            <ColorPic
              ans={
                "Если утверждение верное, закрасьте ячейку таблицы с ответом зелёным цветом, если неверное – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Необходимо стричь ногти по мере их отрастания.",
                "Умываться и принимать душ надо ежедневно.",
                "Менять нижнее бельё можно через день.",
                "Мыть руки перед едой надо обязательно.",
                "Полоскать рот и чистить зубы надо каждый раз после еды.",
              ]}
              trueans={["#18d945", "#18d945", "#f74f5a", "#18d945", "#f74f5a"]}
            />,
            <DropwordList
              quiz="Заполни пропуски в данной пословице. (зажимай ответы левой клавишей
              мыши и перетаскивай в нужное место)"
              ans={[
                [],
                [],
                [],
                [],
                [],
                [{ id: "1", content: "А нечистым" }],
                [{ id: "2", content: "Стыд и срам" }],
                [{ id: "3", content: "Надо, надо умываться" }],
                [{ id: "4", content: "По утрам и вечерам" }],
                [{ id: "5", content: "Трубочистам -" }],
              ]}
              trueans={["3", "4", "1", "5", "2"]}
              h={60}
            />,
            <Select
              quiz={
                "Подумай, какие три слова описывают понятие «опрятный человек». (нажми один раз левой клавиши мыши на слово)"
              }
              img={select2}
              ans={[
                { q: "Глупый", id: 0, a: false },
                { q: "Чистый", id: 1, a: true },
                { q: "Грязный", id: 2, a: false },
                { q: "Грустный", id: 3, a: false },
                { q: "Аккуратный", id: 4, a: true },
                { q: "Веселый", id: 5, a: false },
                { q: "Дурно пахнущий", id: 6, a: false },
                { q: "Чистоплотный", id: 7, a: true },
              ]}
              addCl={"text-success"}
              imgsize="70%"
            />,
            <ImagePic
              imgArr={[i1, i2, i3, i4, i5, i6, i7]}
              trueans={[0, 2, 3, 5, 6]}
              quiz="Что относится к предметам личной гигиены? Отметь нужные картинки (нажми на них)."
            />,
            <Select
              quiz={
                "Отметь ситуации, при которых нужно обязательно мыть руки. (нажми один раз левой клавиши мыши на вариант)"
              }
              img={select3}
              ans={[
                { q: "После посещения туалета", id: 0, a: true },
                { q: "Перед принятием пищи", id: 1, a: true },
                { q: "После чтения книги", id: 2, a: false },
                { q: "После просмотра фильма", id: 3, a: false },
                { q: "После разговора по телефону", id: 4, a: false },
                { q: "После посещения общественных мест", id: 5, a: true },
                { q: "Перед обработкой ран, порезов на коже", id: 6, a: true },
                { q: "После возвращения домой с улицы", id: 7, a: true },
                { q: "После ухода за больным членом семья", id: 8, a: true },
              ]}
              addCl={"text-primary"}
              imgsize="50%"
            />,
            <Select
              quiz={
                "ДИЗЕНТЕРИЯ – болезнь грязных рук. Признаки: повышение температуры, боль в животе, рвота, жидкий стул... Чтобы этого избежать, необходимо соблюдать правила личной гигиены. Ну а что же надо делать при признаках заболевания? (нажми один раз левой клавиши мыши на предложение)"
              }
              img={select4}
              ans={[
                { q: "Принять какие-нибудь лекарства", id: 0, a: false },
                { q: "Больше пить воды и лежать", id: 1, a: false },
                { q: "Обратиться к врачу", id: 2, a: true },
                { q: "Обратиться к врачу", id: 3, a: false },
              ]}
              addCl={"text-success"}
              imgsize="50%"
            />,
            <Select
              quiz={
                "Глядя на рисунок, повтори, как правильно мыть руки. Ниже прочти правила. Удали неверное правило. (нажми один раз левой клавиши мыши на предложение)"
              }
              img={select5}
              ans={[
                {
                  q: "Руки надо мыть тёплой, а не холодной или горячей водой",
                  id: 0, a: false
                },
                {
                  q: "Нужно хорошо намыливать руки – с обеих сторон",
                  id: 1, a: false
                },
                {
                  q: "Необходимо хорошо тереть руки друг о друга, уделяя внимание запястьям, пальцам, коже между пальцами и ногтям",
                  id: 2, a: false
                },
                { q: "Мыло можно до конца не смывать", id: 3, a: true },
                { q: "Руки надо мыть не менее 15 секунд", id: 4, a: false },
              ]}
              addCl={"text-white"}
            />,
            <SelectedWord
              quiz={"Определи, какие пропущены слова в правилах профилактики «болезней грязных рук». Выбери пропущенные слова из выпадающего списка."}
              arrText={["Руки необходимо мыть обязательно после посещения ",
                ", по приходу с улицы и перед едой.  Мыть руки необходимо с",
                ", тщательно тереть друг о друга.  Нельзя покупать продукты питания на ",
                "«с рук». Покупать продукты питания надо только у продавца в ",
                " халате (фартуке), в специальном головном ",
                ", нарукавниках. Нельзя грызть",
                "и брать в рот ручки и карандаши."

              ]}
              arrWord={[["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"], ["улице", "чистом", "ногти", "туалета", "мылом", "уборе"]]}
              trueAns={["3", "4", "0", "1", "5", "2"]}
            />,
            <ColorWord />,
            <ColorPic
              ans={
                "Если поступок хороший, закрасьте ячейку таблицы зелёным цветом, если плохой – ячейку таблицы красным цветом. (цвета на палитре выбирай нажатием левой клавиши мыши; чтобы закрасить ячейку, нажми в ней левой клавишей мыши)"
              }
              arr={[
                "Чистить зубы утром и вечером",
                "Умываться каждый день утром и вечером",
                "Не следить за чистотой одежды.",
                "Регулярно мыть голову и принимать душ.",
                "Регулярно подстригать ногти.",
                "Еженедельно менять нижнее бельё.",
                "Пользоваться чужими мочалкой, зубной щёткой, полотенцем.",
              ]}
              trueans={[
                "#18d945",
                "#18d945",
                "#f74f5a",
                "#18d945",
                "#18d945",
                "#f74f5a",
                "#f74f5a",
              ]}
            />,
          ],
        }
      ],
    }
  ],
};

export const DATA = [Zog_book];
